TRUNCATE subject RESTART IDENTITY CASCADE;

INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('22 05 2023','10:12','ИУ6-31Б','Лабораторная работа','Теория вероятностей и математическая статистика',195,1112),
  ('25 05 2023','10:48','ИУ6-32Б','Семинарское занятие','Сопротивление материалов',330,741),
  ('10 09 2022','18:01','СМ12-13Б','Лекция','Электроника',194,546),
  ('23 04 2023','18:44','ИУ3-45Б','Лабораторная работа','Электроника',166,815),
  ('19 04 2023','13:27','ИУ3-75М','Семинарское занятие','Теоретическая механика',275,414),
  ('01 05 2023','13:01','ИУ6-32М','Лабораторная работа','Сопротивление материалов',213,489),
  ('13 04 2023','13:38','ИУ3-75М','Лекция','Электроника',156,461),
  ('10 12 2022','13:03','ИУ6-34Б','Лекция','Электроника',218,343),
  ('03 10 2022','16:08','ИУ6-35Б','Семинарское занятие','Основы программирования',12,847),
  ('17 04 2023','10:40','ИУ7-36Б','Лекция','Английский язык',62,931);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('29 09 2022','13:58','ИУ8-35Б','Лабораторная работа','Теоретическая механика',440,151),
  ('02 04 2023','09:52','ИУ3-75М','Лабораторная работа','Языки интернет-программирования',158,930),
  ('05 06 2023','17:14','Э9-22Б','Семинарское занятие','История',210,752),
  ('26 10 2022','10:54','СМ12-13Б','Лекция','Электротехника',241,342),
  ('20 09 2022','13:52','Э9-32Б','Лабораторная работа','Английский язык',382,253),
  ('16 10 2022','12:44','ЛТ11-55Б','Семинарское занятие','Основы программирования',434,637),
  ('12 10 2022','17:50','ИУ6-45Б','Лекция','Языки интернет-программирования',352,811),
  ('11 12 2022','16:54','Э9-12Б','Лекция','Электротехника',45,516),
  ('22 04 2023','15:13','ИУ3-45Б','Семинарское занятие','Электротехника',311,430),
  ('07 05 2023','10:25','ИУ6-35М','Лабораторная работа','Теоретическая механика',369,587);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('31 03 2023','13:27','ИУ3-53Б','Лекция','Английский язык',12,311),
  ('11 10 2022','16:27','ИУ6-32Б','Семинарское занятие','Теория вероятностей и математическая статистика',269,504),
  ('01 04 2023','11:45','ИУ9-32Б','Лабораторная работа','Основы программирования',467,851),
  ('09 11 2022','10:15','ЛТ11-55Б','Лабораторная работа','Социология',359,890),
  ('21 03 2023','16:20','ИУ9-32Б','Лабораторная работа','Физика',30,784),
  ('12 10 2022','14:33','ИУ6-32Б','Семинарское занятие','Социология',408,353),
  ('06 05 2023','16:20','ИУ3-75Б','Семинарское занятие','Основы программирования',53,873),
  ('20 05 2023','08:36','ИУ6-55Б','Лабораторная работа','Базы данных',173,886),
  ('07 03 2023','14:21','СМ12-15Б','Лабораторная работа','Электротехника',266,631),
  ('15 10 2022','10:04','ИУ3-33Б','Семинарское занятие','Языки интернет-программирования',345,532);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('25 04 2023','11:54','ИУ6-35М','Лекция','Базы данных',84,272),
  ('13 05 2023','14:04','ЛТ11-13Б','Лабораторная работа','Базы данных',168,484),
  ('07 04 2023','10:03','ИУ6-35М','Семинарское занятие','Основы программирования',363,1083),
  ('14 09 2022','17:09','ИУ3-45Б','Лабораторная работа','Интегралы и дифференциальные уравнения',323,949),
  ('11 11 2022','13:28','ИУ9-32Б','Семинарское занятие','Теоретическая механика',297,984),
  ('16 03 2023','17:08','ЛТ11-33Б','Лекция','Языки интернет-программирования',310,507),
  ('09 04 2023','12:25','СМ12-14Б','Лабораторная работа','Сопротивление материалов',58,777),
  ('03 04 2023','11:59','ИУ6-35Б','Лекция','Теоретическая механика',229,670),
  ('06 01 2023','16:30','Э9-22Б','Лабораторная работа','Электротехника',441,361),
  ('17 09 2022','10:15','ФН11-13Б','Лабораторная работа','Языки интернет-программирования',31,226);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('05 09 2022','18:14','ФН11-13Б','Лабораторная работа','Теория вероятностей и математическая статистика',75,620),
  ('05 06 2023','18:14','ФН11-13Б','Лабораторная работа','Электротехника',158,685),
  ('05 11 2022','13:21','ЛТ11-33Б','Лекция','Социология',289,828),
  ('01 11 2022','18:45','Э9-22Б','Лекция','История',356,706),
  ('13 11 2022','12:17','ЛТ11-33Б','Лабораторная работа','Теоретическая механика',222,867),
  ('08 03 2023','13:29','Э9-32Б','Лабораторная работа','Сопротивление материалов',12,1132),
  ('01 03 2023','10:54','ИУ3-75Б','Семинарское занятие','Теория вероятностей и математическая статистика',270,601),
  ('28 02 2023','15:04','ИУ6-32М','Лекция','Теоретическая механика',331,1020),
  ('04 01 2023','14:31','ИУ3-33Б','Лекция','Физика',437,429),
  ('06 06 2023','13:02','ЛТ11-13Б','Семинарское занятие','Английский язык',358,222);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('02 12 2022','09:03','ИУ6-55Б','Лекция','Базы данных',28,850),
  ('06 05 2023','11:32','ИУ6-55Б','Семинарское занятие','Электроника',275,199),
  ('25 05 2023','08:54','ЛТ11-33Б','Семинарское занятие','Электроника',52,335),
  ('26 03 2023','17:40','ИУ6-32Б','Семинарское занятие','Физика',167,583),
  ('11 10 2022','18:03','ИУ3-42М','Лабораторная работа','Интегралы и дифференциальные уравнения',38,952),
  ('05 10 2022','15:09','СМ12-14Б','Лабораторная работа','Английский язык',189,1122),
  ('26 10 2022','16:56','ИУ7-36Б','Лекция','Социология',437,660),
  ('28 02 2023','14:20','ИУ6-45Б','Лекция','Электроника',172,913),
  ('12 10 2022','14:04','Э9-22Б','Семинарское занятие','Базы данных',415,951),
  ('26 10 2022','11:04','ИУ3-33Б','Лабораторная работа','Социология',414,528);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('26 09 2022','10:25','ИУ6-35Б','Лекция','Теория вероятностей и математическая статистика',163,226),
  ('20 03 2023','17:59','ИУ6-31Б','Лабораторная работа','Теоретическая механика',122,306),
  ('18 11 2022','16:12','ИУ6-45Б','Лекция','Сопротивление материалов',270,202),
  ('24 10 2022','15:14','ИУ6-34Б','Лабораторная работа','Физика',269,292),
  ('29 10 2022','16:49','ИУ9-32Б','Лекция','Сопротивление материалов',374,312),
  ('18 10 2022','09:42','ИУ3-53Б','Лабораторная работа','Основы программирования',359,362),
  ('11 11 2022','14:41','ИУ7-36Б','Лекция','Языки интернет-программирования',69,457),
  ('05 03 2023','14:48','ИУ3-33Б','Лекция','Языки интернет-программирования',267,266),
  ('01 05 2023','09:55','ИУ3-45Б','Семинарское занятие','Основы программирования',12,473),
  ('21 12 2022','11:30','ИУ3-75Б','Семинарское занятие','Сопротивление материалов',480,607);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('03 12 2022','13:43','СМ12-11Б','Семинарское занятие','Английский язык',390,366),
  ('22 11 2022','14:42','ИУ3-45Б','Лекция','Интегралы и дифференциальные уравнения',419,461),
  ('25 11 2022','15:04','СМ12-11Б','Лекция','Электротехника',189,215),
  ('29 03 2023','17:28','ИУ6-45Б','Лекция','Основы программирования',431,443),
  ('19 05 2023','09:45','ИУ6-35Б','Лекция','История',184,844),
  ('02 11 2022','18:10','ИУ6-35Б','Семинарское занятие','Теория вероятностей и математическая статистика',306,785),
  ('19 03 2023','15:47','ИУ6-34Б','Семинарское занятие','Языки интернет-программирования',390,844),
  ('13 09 2022','16:15','СМ12-15Б','Лабораторная работа','Английский язык',368,645),
  ('18 04 2023','11:58','ИУ3-53Б','Лекция','Социология',203,233),
  ('23 10 2022','08:42','СМ12-13Б','Лекция','История',265,965);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('16 11 2022','16:27','ИУ6-31Б','Лабораторная работа','Сопротивление материалов',329,935),
  ('01 01 2023','15:04','ФН11-13Б','Семинарское занятие','Языки интернет-программирования',360,744),
  ('04 05 2023','15:38','СМ12-13Б','Лабораторная работа','Сопротивление материалов',404,215),
  ('29 04 2023','14:33','Э9-12Б','Семинарское занятие','Языки интернет-программирования',105,566),
  ('30 09 2022','15:06','Э9-22Б','Семинарское занятие','Базы данных',257,505),
  ('12 09 2022','16:33','ИУ7-36Б','Лекция','Интегралы и дифференциальные уравнения',274,278),
  ('15 03 2023','12:30','ИУ3-75М','Лекция','Электроника',340,154),
  ('16 10 2022','14:45','Э9-12Б','Семинарское занятие','Теоретическая механика',96,1031),
  ('15 01 2023','10:40','Э9-32Б','Семинарское занятие','Английский язык',140,150),
  ('23 11 2022','11:34','ИУ8-35Б','Лекция','Социология',196,938);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('08 04 2023','10:03','ИУ6-32М','Лабораторная работа','Сопротивление материалов',66,489),
  ('15 11 2022','15:05','Э9-12Б','Лекция','Электротехника',440,379),
  ('29 01 2023','16:08','ИУ6-32М','Лабораторная работа','Основы программирования',66,269),
  ('05 03 2023','15:27','ИУ8-35Б','Лекция','Сопротивление материалов',324,497),
  ('17 12 2022','10:01','ФН11-13Б','Семинарское занятие','Основы программирования',56,488),
  ('30 03 2023','13:42','ИУ3-45Б','Лекция','Физика',478,995),
  ('25 05 2023','11:31','Э9-22Б','Семинарское занятие','Физика',372,969),
  ('02 10 2022','09:59','СМ12-14Б','Семинарское занятие','Теория вероятностей и математическая статистика',157,156),
  ('08 10 2022','13:54','СМ12-11Б','Лекция','Теория вероятностей и математическая статистика',448,802),
  ('02 02 2023','18:05','ИУ3-42М','Семинарское занятие','Физика',469,1113);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('03 05 2023','16:46','ЛТ11-33Б','Лабораторная работа','Теория вероятностей и математическая статистика',37,220),
  ('23 01 2023','13:25','ЛТ11-13Б','Семинарское занятие','Теоретическая механика',254,313),
  ('28 09 2022','13:51','ИУ7-36Б','Лабораторная работа','Физика',280,560),
  ('27 09 2022','12:51','СМ12-11Б','Лекция','Базы данных',243,279),
  ('17 11 2022','09:45','ИУ8-35Б','Лабораторная работа','Языки интернет-программирования',6,749),
  ('31 05 2023','15:19','ИУ3-33Б','Лабораторная работа','Теория вероятностей и математическая статистика',298,780),
  ('26 11 2022','17:57','СМ12-13Б','Семинарское занятие','Английский язык',7,180),
  ('28 04 2023','16:32','ИУ6-55Б','Лекция','Сопротивление материалов',377,261),
  ('17 03 2023','13:22','ИУ6-35Б','Семинарское занятие','Базы данных',490,924),
  ('09 10 2022','16:57','Э9-22Б','Лекция','Базы данных',382,725);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('05 11 2022','15:49','ИУ6-32Б','Лабораторная работа','Базы данных',239,525),
  ('06 03 2023','12:35','ИУ6-55Б','Лекция','Английский язык',469,890),
  ('23 11 2022','13:53','СМ12-11Б','Лабораторная работа','Физика',73,245),
  ('04 02 2023','08:55','СМ12-15Б','Семинарское занятие','Электроника',443,925),
  ('05 04 2023','08:41','ИУ6-34Б','Лекция','История',404,664),
  ('09 10 2022','15:47','ИУ6-31Б','Лабораторная работа','Языки интернет-программирования',413,689),
  ('13 03 2023','14:45','Э9-22Б','Лекция','Физика',259,1023),
  ('26 03 2023','11:36','Э9-12Б','Семинарское занятие','Основы программирования',401,205),
  ('27 12 2022','10:34','ИУ6-31Б','Семинарское занятие','Английский язык',416,156),
  ('15 10 2022','12:22','Э9-12Б','Семинарское занятие','Электротехника',494,1021);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('29 03 2023','17:35','ИУ6-55Б','Лекция','Языки интернет-программирования',125,493),
  ('11 12 2022','16:46','ИУ3-75Б','Семинарское занятие','Физика',357,929),
  ('31 03 2023','17:09','ИУ6-35Б','Семинарское занятие','Языки интернет-программирования',349,491),
  ('02 03 2023','13:14','ЛТ11-33Б','Лекция','Сопротивление материалов',221,340),
  ('08 04 2023','10:47','ЛТ11-13Б','Лабораторная работа','Физика',194,383),
  ('20 02 2023','15:15','ИУ7-36Б','Семинарское занятие','Английский язык',466,1027),
  ('13 01 2023','16:03','ИУ6-35Б','Семинарское занятие','Английский язык',304,384),
  ('03 04 2023','14:23','ФН11-13Б','Семинарское занятие','Электротехника',128,289),
  ('24 10 2022','10:43','ИУ3-45Б','Лабораторная работа','Физика',68,347),
  ('20 01 2023','08:53','ЛТ11-33Б','Семинарское занятие','Сопротивление материалов',404,1149);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('09 03 2023','09:21','ИУ6-34Б','Семинарское занятие','Английский язык',382,779),
  ('20 02 2023','12:02','ИУ3-42М','Лекция','Теоретическая механика',80,468),
  ('05 04 2023','09:50','ИУ6-35М','Лабораторная работа','Теоретическая механика',132,362),
  ('27 01 2023','13:35','Э9-22Б','Лабораторная работа','Базы данных',480,977),
  ('12 09 2022','18:23','ИУ3-45Б','Лекция','Электроника',311,519),
  ('22 02 2023','15:30','ИУ3-75Б','Лекция','Базы данных',390,165),
  ('23 04 2023','17:40','ИУ3-53Б','Лекция','Электроника',384,1114),
  ('09 06 2023','18:53','ИУ6-32Б','Лекция','Интегралы и дифференциальные уравнения',330,632),
  ('24 04 2023','11:19','СМ12-11Б','Семинарское занятие','Основы программирования',366,1082),
  ('02 04 2023','18:29','ИУ6-45Б','Лекция','Электротехника',239,738);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('07 03 2023','11:26','ИУ6-55Б','Лабораторная работа','Электротехника',59,881),
  ('20 12 2022','10:40','ФН11-13Б','Лекция','Социология',299,515),
  ('16 12 2022','17:55','СМ12-13Б','Лекция','Физика',315,870),
  ('16 03 2023','13:28','ИУ6-45Б','Лабораторная работа','Теоретическая механика',311,210),
  ('09 06 2023','10:58','ИУ3-53Б','Лабораторная работа','Языки интернет-программирования',85,609),
  ('03 01 2023','15:29','ИУ6-32Б','Лабораторная работа','Теория вероятностей и математическая статистика',118,407),
  ('04 04 2023','08:45','ЛТ11-13Б','Лекция','Теория вероятностей и математическая статистика',91,1062),
  ('18 10 2022','17:16','ИУ3-53Б','Семинарское занятие','Теоретическая механика',106,485),
  ('03 05 2023','10:46','Э9-22Б','Семинарское занятие','Языки интернет-программирования',177,282),
  ('03 09 2022','11:44','СМ12-13Б','Лабораторная работа','Электротехника',54,1118);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('13 05 2023','16:36','СМ12-13Б','Лабораторная работа','История',419,595),
  ('21 05 2023','14:40','ИУ6-35М','Лабораторная работа','Интегралы и дифференциальные уравнения',301,883),
  ('30 04 2023','08:38','ИУ3-53Б','Лабораторная работа','Теория вероятностей и математическая статистика',73,121),
  ('31 05 2023','15:32','ИУ6-32М','Семинарское занятие','Электроника',453,502),
  ('21 02 2023','14:53','ИУ9-32Б','Семинарское занятие','Физика',300,310),
  ('14 02 2023','09:23','ИУ3-33Б','Лабораторная работа','Социология',389,847),
  ('07 01 2023','16:19','ИУ6-32М','Лекция','Основы программирования',470,376),
  ('04 05 2023','10:32','ИУ6-35Б','Лабораторная работа','Английский язык',310,166),
  ('15 02 2023','09:05','ИУ6-32М','Лабораторная работа','Электроника',437,422),
  ('24 02 2023','09:15','СМ12-14Б','Семинарское занятие','Социология',319,444);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('22 12 2022','12:27','ИУ9-32Б','Семинарское занятие','Электротехника',328,435),
  ('16 10 2022','09:56','ИУ6-32Б','Семинарское занятие','Теоретическая механика',77,715),
  ('16 12 2022','12:43','ИУ6-32Б','Лабораторная работа','История',200,682),
  ('05 10 2022','12:40','ИУ3-75М','Лабораторная работа','Сопротивление материалов',174,312),
  ('30 01 2023','12:22','ИУ3-75Б','Семинарское занятие','Основы программирования',95,1139),
  ('08 05 2023','09:56','ИУ3-33Б','Семинарское занятие','Физика',88,272),
  ('23 02 2023','14:22','ИУ3-42М','Лабораторная работа','Теоретическая механика',396,1058),
  ('12 04 2023','18:23','ИУ6-45Б','Семинарское занятие','Электроника',346,526),
  ('01 06 2023','14:33','ИУ3-45Б','Лабораторная работа','Основы программирования',117,224),
  ('20 11 2022','09:08','ИУ3-45Б','Семинарское занятие','Английский язык',319,820);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('03 09 2022','13:26','ИУ8-35Б','Семинарское занятие','Электроника',468,1101),
  ('22 11 2022','10:25','Э9-32Б','Лекция','Языки интернет-программирования',188,649),
  ('02 03 2023','11:55','ИУ8-35Б','Лекция','Электротехника',282,705),
  ('23 01 2023','08:34','ИУ3-75М','Лабораторная работа','Теория вероятностей и математическая статистика',292,108),
  ('12 12 2022','10:13','ИУ3-45Б','Лабораторная работа','Основы программирования',179,1062),
  ('18 01 2023','09:15','ФН11-13Б','Семинарское занятие','Теория вероятностей и математическая статистика',419,1041),
  ('19 02 2023','12:42','ИУ7-36Б','Семинарское занятие','Интегралы и дифференциальные уравнения',67,299),
  ('17 04 2023','18:49','СМ12-11Б','Лекция','Интегралы и дифференциальные уравнения',401,412),
  ('07 03 2023','12:45','ИУ3-75М','Лекция','Основы программирования',185,1117),
  ('17 03 2023','11:20','ИУ3-75М','Семинарское занятие','Базы данных',77,964);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('21 10 2022','17:24','ФН11-13Б','Лекция','Электроника',428,337),
  ('05 06 2023','09:36','ИУ3-75Б','Лабораторная работа','Английский язык',293,199),
  ('27 02 2023','12:48','ИУ3-53Б','Лекция','Языки интернет-программирования',170,384),
  ('10 03 2023','13:51','СМ12-13Б','Лабораторная работа','Основы программирования',421,891),
  ('24 12 2022','10:04','ИУ6-55Б','Семинарское занятие','Сопротивление материалов',10,780),
  ('13 03 2023','16:18','ИУ6-45Б','Семинарское занятие','Английский язык',202,226),
  ('24 10 2022','14:44','ФН11-13Б','Лекция','Английский язык',475,624),
  ('15 09 2022','09:57','ИУ6-34Б','Лекция','Социология',159,455),
  ('07 04 2023','16:46','Э9-22Б','Лекция','Физика',97,749),
  ('19 12 2022','11:27','ИУ8-35Б','Семинарское занятие','История',223,197);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('22 10 2022','13:57','ИУ6-35Б','Лекция','Интегралы и дифференциальные уравнения',41,1097),
  ('31 03 2023','13:10','ИУ8-35Б','Лекция','Базы данных',3,160),
  ('09 02 2023','10:25','ИУ3-75Б','Лекция','Электроника',24,488),
  ('19 01 2023','17:33','ИУ6-31Б','Лекция','История',453,1040),
  ('27 12 2022','14:39','ЛТ11-33Б','Семинарское занятие','Физика',50,499),
  ('11 09 2022','08:40','ИУ3-53Б','Лекция','Основы программирования',337,817),
  ('30 04 2023','13:30','ЛТ11-33Б','Семинарское занятие','Сопротивление материалов',485,246),
  ('20 01 2023','15:50','СМ12-13Б','Лабораторная работа','Языки интернет-программирования',113,879),
  ('27 02 2023','10:04','ИУ3-53Б','Лабораторная работа','Основы программирования',347,378),
  ('30 03 2023','10:30','ИУ6-55Б','Лабораторная работа','Сопротивление материалов',13,553);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('07 11 2022','10:24','СМ12-11Б','Семинарское занятие','Основы программирования',291,623),
  ('23 10 2022','17:45','ИУ3-33Б','Семинарское занятие','Сопротивление материалов',342,863),
  ('27 10 2022','18:22','ИУ3-42М','Лекция','Физика',407,1082),
  ('03 03 2023','10:32','ИУ3-75Б','Лекция','Основы программирования',328,347),
  ('21 04 2023','17:31','ИУ3-42М','Лекция','Сопротивление материалов',347,181),
  ('21 09 2022','18:12','Э9-12Б','Лабораторная работа','Английский язык',297,587),
  ('20 10 2022','14:40','ИУ6-55Б','Лабораторная работа','Базы данных',403,1021),
  ('07 04 2023','11:13','ЛТ11-33Б','Лекция','Основы программирования',107,304),
  ('16 04 2023','17:58','ИУ3-75Б','Лабораторная работа','Сопротивление материалов',58,198),
  ('04 04 2023','13:21','ИУ9-32Б','Лекция','Теория вероятностей и математическая статистика',142,576);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('29 03 2023','12:25','ИУ6-45Б','Лабораторная работа','Основы программирования',284,600),
  ('02 02 2023','11:27','ИУ7-36Б','Лабораторная работа','Интегралы и дифференциальные уравнения',130,1138),
  ('27 04 2023','10:33','ИУ3-75М','Лекция','Электроника',304,853),
  ('05 03 2023','14:56','ИУ6-32М','Семинарское занятие','История',431,220),
  ('02 03 2023','17:31','ИУ3-45Б','Семинарское занятие','Электротехника',96,213),
  ('22 02 2023','18:49','ЛТ11-55Б','Лекция','Языки интернет-программирования',244,138),
  ('07 03 2023','14:33','СМ12-15Б','Лабораторная работа','Физика',126,667),
  ('11 12 2022','13:14','ИУ7-36Б','Лекция','Базы данных',147,1117),
  ('30 11 2022','08:59','СМ12-13Б','Семинарское занятие','Теория вероятностей и математическая статистика',45,913),
  ('13 02 2023','17:25','Э9-32Б','Семинарское занятие','Интегралы и дифференциальные уравнения',76,947);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('21 02 2023','12:03','Э9-12Б','Лабораторная работа','Теоретическая механика',363,300),
  ('30 05 2023','17:29','ЛТ11-13Б','Семинарское занятие','Базы данных',226,248),
  ('15 02 2023','10:32','СМ12-14Б','Лекция','Основы программирования',377,596),
  ('27 05 2023','12:01','ИУ3-75Б','Лекция','Базы данных',319,635),
  ('17 03 2023','11:43','ИУ3-42М','Лекция','Интегралы и дифференциальные уравнения',300,241),
  ('07 05 2023','12:00','ИУ6-45Б','Лабораторная работа','Английский язык',55,322),
  ('24 04 2023','15:41','СМ12-14Б','Лекция','Электроника',442,853),
  ('06 10 2022','10:33','ИУ6-34Б','Лекция','Языки интернет-программирования',443,912),
  ('30 01 2023','17:46','СМ12-11Б','Лекция','Интегралы и дифференциальные уравнения',109,166),
  ('05 12 2022','12:52','ИУ6-32М','Лабораторная работа','Английский язык',283,1036);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('12 09 2022','14:17','СМ12-14Б','Семинарское занятие','Английский язык',173,404),
  ('24 02 2023','09:05','ИУ6-34Б','Лекция','История',97,391),
  ('22 04 2023','18:45','ИУ3-75Б','Лекция','Основы программирования',203,577),
  ('13 11 2022','09:20','ЛТ11-55Б','Лабораторная работа','Электроника',402,308),
  ('19 04 2023','16:27','ИУ3-53Б','Лабораторная работа','Базы данных',296,658),
  ('25 05 2023','16:11','ИУ3-75Б','Лабораторная работа','Социология',172,1078),
  ('12 12 2022','10:55','ИУ7-36Б','Семинарское занятие','Физика',1,341),
  ('07 02 2023','14:52','ИУ3-42М','Лабораторная работа','Интегралы и дифференциальные уравнения',74,510),
  ('30 04 2023','16:04','СМ12-11Б','Лабораторная работа','Физика',90,1138),
  ('28 05 2023','11:17','ИУ3-75Б','Лекция','Физика',15,146);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('03 03 2023','10:06','ИУ6-35М','Лабораторная работа','Базы данных',262,884),
  ('21 09 2022','17:25','ИУ6-55Б','Семинарское занятие','Электротехника',357,711),
  ('28 10 2022','11:23','ИУ6-31Б','Лекция','Английский язык',432,1136),
  ('26 11 2022','11:21','ИУ6-32М','Лабораторная работа','Электротехника',428,904),
  ('14 04 2023','16:14','СМ12-15Б','Лабораторная работа','Электроника',457,596),
  ('04 10 2022','14:53','ИУ3-75Б','Лабораторная работа','Физика',82,362),
  ('17 10 2022','09:08','ИУ6-32Б','Семинарское занятие','Физика',276,884),
  ('07 02 2023','18:49','ИУ6-31Б','Лабораторная работа','Теоретическая механика',258,357),
  ('27 10 2022','09:04','ИУ6-55Б','Лабораторная работа','Основы программирования',251,127),
  ('31 05 2023','09:20','ЛТ11-33Б','Семинарское занятие','Основы программирования',47,1089);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('07 03 2023','11:23','ИУ6-35Б','Лабораторная работа','Английский язык',186,407),
  ('05 09 2022','14:44','ИУ8-35Б','Лабораторная работа','Английский язык',395,394),
  ('28 02 2023','14:03','СМ12-15Б','Семинарское занятие','Электротехника',69,727),
  ('19 12 2022','09:26','ЛТ11-33Б','Лекция','Базы данных',149,290),
  ('25 11 2022','10:37','ИУ6-35Б','Семинарское занятие','История',291,194),
  ('12 02 2023','12:37','ИУ3-75Б','Семинарское занятие','Электроника',275,1132),
  ('19 04 2023','09:27','ИУ6-45Б','Лекция','Теория вероятностей и математическая статистика',25,740),
  ('07 09 2022','16:57','ИУ6-45Б','Лабораторная работа','Основы программирования',15,971),
  ('14 11 2022','15:24','ИУ6-35Б','Лекция','Английский язык',248,155),
  ('18 05 2023','11:06','ИУ3-75Б','Лабораторная работа','Языки интернет-программирования',398,234);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('04 04 2023','10:59','ИУ3-45Б','Лекция','История',317,650),
  ('31 01 2023','10:12','Э9-32Б','Лекция','Социология',202,919),
  ('05 09 2022','09:00','ИУ6-55Б','Лекция','Электроника',472,1107),
  ('05 10 2022','16:57','ИУ6-35Б','Лекция','История',92,413),
  ('02 05 2023','18:28','ЛТ11-13Б','Лабораторная работа','Основы программирования',412,658),
  ('28 05 2023','18:37','ЛТ11-55Б','Семинарское занятие','Языки интернет-программирования',279,260),
  ('13 09 2022','14:16','ИУ6-35Б','Семинарское занятие','Электроника',420,323),
  ('13 09 2022','11:03','СМ12-13Б','Лекция','Основы программирования',246,273),
  ('24 11 2022','09:46','ИУ6-35Б','Семинарское занятие','Сопротивление материалов',206,847),
  ('28 03 2023','11:04','ИУ8-35Б','Лекция','Основы программирования',346,177);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('02 10 2022','18:50','ИУ6-34Б','Лекция','Социология',173,978),
  ('29 11 2022','18:43','ИУ8-35Б','Семинарское занятие','Английский язык',90,379),
  ('11 03 2023','15:51','ИУ3-33Б','Лекция','Основы программирования',428,734),
  ('21 11 2022','16:27','ИУ3-33Б','Лабораторная работа','Социология',198,514),
  ('14 12 2022','08:55','ИУ3-75М','Лабораторная работа','Социология',401,562),
  ('08 05 2023','17:10','ИУ6-34Б','Семинарское занятие','Интегралы и дифференциальные уравнения',184,202),
  ('13 02 2023','12:40','Э9-12Б','Лекция','Базы данных',100,1128),
  ('06 06 2023','12:19','ИУ3-75Б','Лабораторная работа','Английский язык',460,173),
  ('09 12 2022','11:01','ИУ8-35Б','Лекция','Сопротивление материалов',482,182),
  ('17 03 2023','10:14','ИУ6-45Б','Семинарское занятие','Физика',385,178);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('10 02 2023','11:03','ИУ3-53Б','Семинарское занятие','Основы программирования',275,336),
  ('20 03 2023','13:22','ИУ9-32Б','Семинарское занятие','История',285,878),
  ('26 04 2023','16:33','ЛТ11-55Б','Семинарское занятие','Английский язык',285,113),
  ('20 04 2023','10:24','ИУ9-32Б','Семинарское занятие','Физика',367,935),
  ('17 05 2023','15:01','ЛТ11-33Б','Семинарское занятие','Физика',162,972),
  ('01 06 2023','13:50','ИУ6-35Б','Семинарское занятие','Интегралы и дифференциальные уравнения',206,740),
  ('12 04 2023','14:20','ЛТ11-13Б','Лекция','Электротехника',181,788),
  ('05 11 2022','12:34','СМ12-11Б','Лабораторная работа','Сопротивление материалов',149,137),
  ('27 04 2023','16:49','ИУ6-31Б','Лекция','Основы программирования',66,349),
  ('06 05 2023','12:31','ИУ3-45Б','Лекция','Английский язык',463,727);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('29 03 2023','13:26','СМ12-11Б','Лекция','История',276,726),
  ('01 06 2023','11:55','ЛТ11-55Б','Семинарское занятие','Основы программирования',263,334),
  ('18 05 2023','17:57','ЛТ11-55Б','Семинарское занятие','Английский язык',371,815),
  ('30 04 2023','09:11','ИУ3-33Б','Семинарское занятие','Теоретическая механика',43,161),
  ('14 03 2023','11:17','ИУ6-35Б','Лекция','Базы данных',484,1127),
  ('26 04 2023','18:42','ИУ6-45Б','Семинарское занятие','Физика',164,951),
  ('25 10 2022','18:24','ФН11-13Б','Семинарское занятие','Основы программирования',441,805),
  ('11 10 2022','11:35','ФН11-13Б','Семинарское занятие','Интегралы и дифференциальные уравнения',146,1137),
  ('04 01 2023','17:05','ИУ3-33Б','Лекция','Физика',206,502),
  ('12 12 2022','13:40','ИУ9-32Б','Семинарское занятие','Электротехника',170,976);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('25 12 2022','13:07','Э9-22Б','Лабораторная работа','Социология',147,646),
  ('15 10 2022','18:04','Э9-12Б','Лабораторная работа','Социология',470,557),
  ('23 09 2022','15:55','СМ12-14Б','Лекция','Социология',474,494),
  ('17 10 2022','15:51','ИУ3-75М','Лабораторная работа','Основы программирования',190,336),
  ('24 10 2022','16:04','СМ12-11Б','Семинарское занятие','Английский язык',115,872),
  ('17 04 2023','14:47','ИУ6-31Б','Лекция','Сопротивление материалов',376,950),
  ('18 12 2022','17:50','ЛТ11-13Б','Семинарское занятие','Теоретическая механика',449,1128),
  ('30 09 2022','18:26','ИУ6-34Б','Лабораторная работа','Электротехника',292,775),
  ('26 01 2023','14:30','ИУ3-45Б','Лекция','Электротехника',129,681),
  ('23 05 2023','13:52','ИУ3-53Б','Лекция','Электротехника',289,1147);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('17 04 2023','18:48','ЛТ11-33Б','Лабораторная работа','Интегралы и дифференциальные уравнения',471,223),
  ('24 04 2023','09:44','СМ12-13Б','Лабораторная работа','Социология',490,273),
  ('20 04 2023','17:08','ИУ6-32Б','Лабораторная работа','Языки интернет-программирования',330,567),
  ('30 04 2023','10:50','ИУ6-55Б','Лабораторная работа','Языки интернет-программирования',207,1010),
  ('03 03 2023','16:40','ИУ8-35Б','Семинарское занятие','Электроника',5,236),
  ('14 12 2022','09:30','ИУ6-31Б','Лекция','Электротехника',224,595),
  ('25 12 2022','13:05','ИУ3-75М','Семинарское занятие','Физика',131,146),
  ('15 11 2022','13:41','ИУ6-45Б','Лабораторная работа','Интегралы и дифференциальные уравнения',459,918),
  ('14 01 2023','12:52','ИУ7-36Б','Семинарское занятие','Английский язык',296,1066),
  ('06 10 2022','13:09','ИУ7-36Б','Семинарское занятие','Электротехника',191,761);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('25 05 2023','16:59','ИУ6-31Б','Лекция','Электротехника',458,417),
  ('16 10 2022','10:29','ИУ6-34Б','Семинарское занятие','Электротехника',498,931),
  ('05 03 2023','15:37','ИУ3-53Б','Лекция','Электротехника',165,125),
  ('28 03 2023','13:28','Э9-32Б','Семинарское занятие','Базы данных',65,949),
  ('09 06 2023','14:54','ЛТ11-13Б','Семинарское занятие','Английский язык',5,643),
  ('10 04 2023','10:42','ИУ8-35Б','Лабораторная работа','История',439,322),
  ('13 12 2022','12:01','ИУ6-32М','Лабораторная работа','Сопротивление материалов',143,604),
  ('28 04 2023','10:59','СМ12-11Б','Лабораторная работа','Основы программирования',414,165),
  ('06 01 2023','14:24','ИУ6-34Б','Семинарское занятие','Английский язык',177,548),
  ('07 12 2022','09:22','ФН11-13Б','Лекция','Базы данных',22,387);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('28 05 2023','14:49','ИУ6-32Б','Лекция','Физика',295,581),
  ('05 10 2022','13:32','ИУ6-31Б','Лабораторная работа','Теория вероятностей и математическая статистика',273,890),
  ('04 09 2022','17:51','ИУ6-55Б','Лекция','Основы программирования',391,105),
  ('15 02 2023','08:34','ИУ6-32Б','Лабораторная работа','Электроника',133,643),
  ('26 03 2023','16:25','ИУ3-75Б','Лабораторная работа','История',305,1093),
  ('16 11 2022','13:43','ЛТ11-13Б','Семинарское занятие','Электроника',26,856),
  ('15 11 2022','14:11','ЛТ11-13Б','Семинарское занятие','Электроника',203,761),
  ('31 10 2022','13:54','ФН11-13Б','Лекция','Теоретическая механика',103,956),
  ('15 10 2022','13:00','ИУ3-33Б','Лабораторная работа','Теория вероятностей и математическая статистика',61,881),
  ('28 12 2022','14:08','ИУ8-35Б','Лабораторная работа','Теоретическая механика',272,648);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('23 04 2023','17:34','Э9-32Б','Лабораторная работа','Физика',455,217),
  ('11 11 2022','12:11','СМ12-13Б','Лабораторная работа','Физика',106,321),
  ('07 11 2022','14:56','СМ12-15Б','Лекция','Физика',26,265),
  ('07 10 2022','16:24','ИУ6-45Б','Лабораторная работа','Базы данных',437,714),
  ('15 03 2023','14:38','ИУ6-32М','Семинарское занятие','Электротехника',435,481),
  ('06 02 2023','12:13','ЛТ11-33Б','Лекция','Электротехника',184,902),
  ('10 02 2023','09:21','ИУ6-35М','Семинарское занятие','Теория вероятностей и математическая статистика',191,282),
  ('04 01 2023','16:06','ИУ3-75Б','Лекция','Сопротивление материалов',376,809),
  ('16 01 2023','13:39','ИУ3-53Б','Лекция','Электроника',11,620),
  ('02 04 2023','13:52','СМ12-13Б','Лабораторная работа','Интегралы и дифференциальные уравнения',496,454);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('07 10 2022','15:21','Э9-12Б','Семинарское занятие','Сопротивление материалов',306,469),
  ('18 11 2022','10:52','ИУ3-42М','Семинарское занятие','Основы программирования',455,394),
  ('20 03 2023','13:37','ИУ6-31Б','Семинарское занятие','Языки интернет-программирования',176,940),
  ('27 09 2022','16:34','ИУ6-35М','Лабораторная работа','Электротехника',219,162),
  ('04 04 2023','15:23','ИУ3-45Б','Лабораторная работа','Английский язык',471,412),
  ('31 12 2022','16:54','СМ12-11Б','Семинарское занятие','Языки интернет-программирования',203,552),
  ('01 04 2023','12:45','ЛТ11-55Б','Лабораторная работа','История',351,108),
  ('05 09 2022','16:54','ИУ6-35М','Лекция','Языки интернет-программирования',168,823),
  ('25 05 2023','14:10','СМ12-13Б','Лекция','Электротехника',27,371),
  ('22 05 2023','13:19','ИУ6-45Б','Лекция','Базы данных',140,610);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('08 05 2023','12:41','ИУ8-35Б','Лекция','Языки интернет-программирования',50,171),
  ('24 02 2023','14:05','Э9-12Б','Семинарское занятие','Физика',32,783),
  ('11 12 2022','18:01','ИУ6-32Б','Лекция','Теория вероятностей и математическая статистика',360,1085),
  ('01 01 2023','12:12','ИУ7-36Б','Семинарское занятие','Теория вероятностей и математическая статистика',471,1043),
  ('20 02 2023','14:00','ИУ3-45Б','Лабораторная работа','Теоретическая механика',59,686),
  ('27 01 2023','14:01','СМ12-13Б','Семинарское занятие','Социология',108,112),
  ('22 11 2022','09:22','ИУ3-33Б','Семинарское занятие','Физика',88,779),
  ('08 02 2023','18:59','ИУ6-35Б','Лабораторная работа','Английский язык',242,1131),
  ('10 11 2022','15:43','ЛТ11-33Б','Лабораторная работа','Английский язык',306,396),
  ('26 10 2022','15:29','Э9-12Б','Лекция','Теоретическая механика',432,599);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('22 03 2023','13:46','ЛТ11-33Б','Лекция','Языки интернет-программирования',438,1118),
  ('07 02 2023','12:29','ИУ3-53Б','Лабораторная работа','Основы программирования',267,126),
  ('07 10 2022','14:15','СМ12-14Б','Лекция','Английский язык',201,240),
  ('10 12 2022','17:48','ИУ6-55Б','Лекция','Основы программирования',305,1128),
  ('08 12 2022','16:00','ЛТ11-13Б','Лекция','Теоретическая механика',124,1140),
  ('26 05 2023','10:38','ИУ3-75Б','Семинарское занятие','История',240,198),
  ('18 03 2023','12:57','ИУ6-55Б','Лекция','Электротехника',394,1070),
  ('18 11 2022','13:36','ФН11-13Б','Семинарское занятие','Теория вероятностей и математическая статистика',449,861),
  ('27 03 2023','12:05','ИУ6-31Б','Семинарское занятие','Физика',287,549),
  ('08 06 2023','13:12','ИУ6-55Б','Семинарское занятие','Социология',218,372);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('18 03 2023','11:51','ИУ3-42М','Лабораторная работа','Физика',168,1090),
  ('30 11 2022','08:34','ИУ6-34Б','Лекция','Электротехника',83,120),
  ('24 04 2023','18:45','СМ12-13Б','Лекция','Электротехника',288,167),
  ('29 09 2022','13:17','Э9-32Б','Лабораторная работа','История',261,833),
  ('12 11 2022','12:35','ИУ6-45Б','Лабораторная работа','Языки интернет-программирования',408,844),
  ('21 04 2023','16:03','ИУ6-32Б','Лекция','Интегралы и дифференциальные уравнения',487,597),
  ('30 04 2023','11:57','ИУ9-32Б','Лабораторная работа','Английский язык',332,1127),
  ('21 10 2022','16:28','ИУ3-45Б','Семинарское занятие','Теория вероятностей и математическая статистика',118,347),
  ('16 01 2023','09:39','ИУ3-42М','Лабораторная работа','Базы данных',181,145),
  ('11 01 2023','10:25','СМ12-14Б','Лекция','Основы программирования',41,510);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('06 10 2022','17:53','ИУ3-53Б','Лекция','Электроника',350,458),
  ('19 11 2022','11:49','СМ12-14Б','Лекция','Языки интернет-программирования',278,1002),
  ('09 12 2022','15:27','Э9-22Б','Семинарское занятие','Социология',44,366),
  ('25 04 2023','10:45','ИУ3-33Б','Лекция','Теоретическая механика',7,1006),
  ('06 09 2022','16:36','СМ12-13Б','Лекция','Физика',206,574),
  ('02 03 2023','12:07','ИУ9-32Б','Лабораторная работа','Социология',231,808),
  ('22 01 2023','15:36','ИУ6-35Б','Лекция','Английский язык',459,587),
  ('04 04 2023','12:48','ИУ6-32Б','Лекция','Социология',370,237),
  ('20 09 2022','12:53','ИУ3-75М','Лекция','Английский язык',428,276),
  ('07 03 2023','11:32','СМ12-14Б','Семинарское занятие','Интегралы и дифференциальные уравнения',344,707);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('20 09 2022','09:12','Э9-12Б','Лабораторная работа','История',98,730),
  ('29 03 2023','09:51','ИУ3-53Б','Лекция','Базы данных',313,110),
  ('27 03 2023','13:54','ИУ7-36Б','Лабораторная работа','Электроника',338,803),
  ('11 12 2022','14:33','ЛТ11-55Б','Семинарское занятие','Базы данных',277,951),
  ('23 10 2022','13:08','ЛТ11-13Б','Лабораторная работа','Социология',100,1107),
  ('28 09 2022','09:24','ИУ6-34Б','Лабораторная работа','Теория вероятностей и математическая статистика',367,848),
  ('12 03 2023','16:25','ИУ6-45Б','Лабораторная работа','Основы программирования',169,584),
  ('24 09 2022','17:26','ИУ8-35Б','Лекция','История',219,478),
  ('04 09 2022','12:36','СМ12-11Б','Лекция','Сопротивление материалов',334,844),
  ('22 05 2023','11:10','ИУ6-32Б','Лекция','Электротехника',302,273);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('29 12 2022','10:58','ЛТ11-33Б','Лекция','Сопротивление материалов',190,1099),
  ('30 01 2023','16:54','ЛТ11-13Б','Лабораторная работа','Базы данных',256,1034),
  ('27 12 2022','15:48','ЛТ11-33Б','Лабораторная работа','Социология',367,918),
  ('31 01 2023','13:30','ЛТ11-55Б','Семинарское занятие','Интегралы и дифференциальные уравнения',451,838),
  ('30 11 2022','16:24','Э9-12Б','Семинарское занятие','Базы данных',136,975),
  ('11 10 2022','14:41','ИУ9-32Б','Семинарское занятие','Социология',418,518),
  ('02 12 2022','09:02','ИУ3-42М','Лабораторная работа','Интегралы и дифференциальные уравнения',63,1021),
  ('14 04 2023','11:53','ИУ6-31Б','Семинарское занятие','Сопротивление материалов',169,296),
  ('09 01 2023','12:30','ИУ7-36Б','Семинарское занятие','Электроника',432,443),
  ('27 09 2022','13:40','ИУ6-45Б','Лабораторная работа','Базы данных',78,1105);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('14 05 2023','18:23','Э9-22Б','Лекция','Английский язык',494,517),
  ('20 02 2023','15:16','ИУ9-32Б','Лабораторная работа','Теория вероятностей и математическая статистика',455,241),
  ('01 12 2022','13:03','Э9-32Б','Лабораторная работа','Сопротивление материалов',180,354),
  ('27 02 2023','11:38','ИУ6-34Б','Семинарское занятие','Электротехника',343,677),
  ('27 10 2022','13:46','Э9-32Б','Лабораторная работа','Английский язык',460,898),
  ('01 11 2022','10:42','ИУ6-34Б','Семинарское занятие','Основы программирования',299,483),
  ('31 10 2022','16:21','ИУ3-33Б','Лекция','Базы данных',51,664),
  ('03 04 2023','17:12','ИУ6-35Б','Семинарское занятие','Электротехника',347,716),
  ('14 10 2022','18:32','ИУ8-35Б','Семинарское занятие','История',284,472),
  ('06 11 2022','11:28','ЛТ11-55Б','Лабораторная работа','Теоретическая механика',471,494);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('13 04 2023','18:51','ИУ6-31Б','Лекция','Интегралы и дифференциальные уравнения',375,1011),
  ('27 12 2022','13:23','СМ12-15Б','Лабораторная работа','История',454,167),
  ('08 12 2022','14:39','ИУ6-32М','Семинарское занятие','Теоретическая механика',438,539),
  ('09 09 2022','17:51','ИУ6-31Б','Лабораторная работа','Физика',227,219),
  ('09 09 2022','16:39','Э9-12Б','Лекция','Электротехника',103,446),
  ('24 10 2022','11:35','ЛТ11-55Б','Семинарское занятие','Сопротивление материалов',23,575),
  ('01 10 2022','11:17','ИУ6-34Б','Семинарское занятие','Базы данных',384,1006),
  ('08 11 2022','12:52','Э9-22Б','Семинарское занятие','Социология',111,125),
  ('13 09 2022','18:22','ИУ6-31Б','Лекция','Интегралы и дифференциальные уравнения',202,190),
  ('01 11 2022','10:25','Э9-22Б','Семинарское занятие','Языки интернет-программирования',199,813);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('22 04 2023','11:22','ЛТ11-55Б','Семинарское занятие','Интегралы и дифференциальные уравнения',214,480),
  ('13 10 2022','09:05','ИУ6-32Б','Семинарское занятие','Теоретическая механика',324,314),
  ('21 09 2022','17:32','СМ12-14Б','Лабораторная работа','Теория вероятностей и математическая статистика',81,227),
  ('10 03 2023','17:56','ЛТ11-33Б','Лабораторная работа','Основы программирования',334,210),
  ('20 01 2023','15:34','Э9-32Б','Лабораторная работа','Теория вероятностей и математическая статистика',159,658),
  ('16 01 2023','12:39','ИУ3-42М','Лабораторная работа','Электротехника',236,1078),
  ('22 05 2023','08:44','ИУ3-75Б','Лекция','Базы данных',47,770),
  ('09 05 2023','11:12','ФН11-13Б','Лекция','Сопротивление материалов',420,1132),
  ('21 11 2022','14:43','СМ12-13Б','Семинарское занятие','Электроника',460,693),
  ('16 03 2023','18:11','ИУ6-32Б','Семинарское занятие','Английский язык',469,786);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('01 01 2023','16:48','СМ12-14Б','Лекция','Языки интернет-программирования',225,1079),
  ('22 11 2022','15:52','ИУ9-32Б','Семинарское занятие','Социология',366,1109),
  ('19 04 2023','10:58','ИУ8-35Б','Семинарское занятие','Социология',267,376),
  ('09 06 2023','17:52','ИУ9-32Б','Семинарское занятие','Языки интернет-программирования',111,984),
  ('05 02 2023','12:36','ЛТ11-13Б','Семинарское занятие','Базы данных',143,917),
  ('04 03 2023','09:04','СМ12-11Б','Семинарское занятие','Теоретическая механика',216,208),
  ('20 09 2022','13:00','ИУ6-32Б','Семинарское занятие','Интегралы и дифференциальные уравнения',495,951),
  ('02 04 2023','12:12','ЛТ11-13Б','Семинарское занятие','Физика',177,1116),
  ('21 02 2023','12:21','СМ12-15Б','Лабораторная работа','Электроника',474,499),
  ('11 10 2022','11:07','ИУ3-45Б','Лабораторная работа','Теория вероятностей и математическая статистика',465,196);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('01 06 2023','09:21','ЛТ11-33Б','Семинарское занятие','Сопротивление материалов',441,376),
  ('27 09 2022','15:04','ИУ3-53Б','Семинарское занятие','Языки интернет-программирования',262,294),
  ('03 06 2023','18:13','ИУ6-34Б','Лекция','Языки интернет-программирования',229,636),
  ('19 09 2022','17:24','ИУ6-35Б','Лабораторная работа','Сопротивление материалов',54,718),
  ('09 06 2023','10:58','ИУ6-55Б','Семинарское занятие','Основы программирования',427,961),
  ('24 04 2023','15:26','ИУ6-32Б','Семинарское занятие','Теоретическая механика',318,622),
  ('14 05 2023','08:53','ИУ6-32Б','Семинарское занятие','Электроника',394,730),
  ('17 03 2023','10:16','СМ12-11Б','Лабораторная работа','Физика',120,1127),
  ('19 09 2022','13:54','Э9-32Б','Лабораторная работа','Сопротивление материалов',315,318),
  ('28 10 2022','10:26','ИУ3-33Б','Лекция','Электроника',175,649);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('28 05 2023','09:13','Э9-12Б','Лабораторная работа','Английский язык',216,762),
  ('17 01 2023','14:04','СМ12-13Б','Семинарское занятие','Электротехника',402,357),
  ('21 12 2022','14:48','ИУ3-53Б','Лабораторная работа','Языки интернет-программирования',125,311),
  ('07 11 2022','16:02','Э9-32Б','Семинарское занятие','Электротехника',341,658),
  ('15 10 2022','12:36','Э9-22Б','Семинарское занятие','Основы программирования',285,493),
  ('24 11 2022','14:04','ИУ3-75Б','Лабораторная работа','Электротехника',165,715),
  ('11 11 2022','14:28','Э9-32Б','Лекция','Теоретическая механика',233,629),
  ('18 10 2022','14:49','ИУ6-32Б','Семинарское занятие','Интегралы и дифференциальные уравнения',460,927),
  ('01 06 2023','12:38','ИУ6-55Б','Лабораторная работа','Электротехника',253,994),
  ('24 01 2023','17:55','СМ12-14Б','Лекция','Интегралы и дифференциальные уравнения',298,782);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('17 05 2023','15:19','ИУ8-35Б','Лекция','Интегралы и дифференциальные уравнения',229,207),
  ('17 03 2023','09:10','ИУ6-55Б','Лекция','Сопротивление материалов',79,1108),
  ('05 02 2023','12:07','ИУ8-35Б','Семинарское занятие','История',342,137),
  ('28 10 2022','12:53','ИУ3-75Б','Лекция','История',310,753),
  ('09 01 2023','10:30','ИУ9-32Б','Лекция','Языки интернет-программирования',384,489),
  ('09 02 2023','17:17','ИУ6-32М','Лабораторная работа','Электроника',52,1028),
  ('12 10 2022','18:18','ИУ6-31Б','Лабораторная работа','Социология',245,1143),
  ('13 05 2023','14:49','ИУ3-42М','Лекция','Основы программирования',346,593),
  ('04 01 2023','14:37','ЛТ11-55Б','Лабораторная работа','Базы данных',407,156),
  ('09 09 2022','12:57','СМ12-14Б','Семинарское занятие','Основы программирования',458,729);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('11 01 2023','08:58','ИУ6-31Б','Лабораторная работа','Сопротивление материалов',438,282),
  ('27 12 2022','14:51','ИУ3-53Б','Лекция','Сопротивление материалов',425,993),
  ('01 12 2022','12:48','ЛТ11-13Б','Лабораторная работа','Базы данных',85,570),
  ('08 03 2023','09:57','ИУ6-45Б','Семинарское занятие','Теория вероятностей и математическая статистика',365,1137),
  ('24 12 2022','15:48','Э9-32Б','Лабораторная работа','Языки интернет-программирования',193,726),
  ('24 01 2023','15:13','ИУ6-31Б','Лабораторная работа','История',2,611),
  ('12 03 2023','12:59','ИУ6-32М','Лабораторная работа','Интегралы и дифференциальные уравнения',20,1149),
  ('12 04 2023','13:32','СМ12-15Б','Лекция','Языки интернет-программирования',413,589),
  ('15 09 2022','13:10','ИУ6-45Б','Семинарское занятие','Социология',65,729),
  ('04 02 2023','13:26','ЛТ11-55Б','Лекция','Интегралы и дифференциальные уравнения',278,1139);
  
  
  
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('02 06 2023','16:26','ИУ7-36Б','Лабораторная работа','Физика',480,171),
  ('24 01 2023','08:58','ИУ3-75М','Лабораторная работа','Социология',345,1139),
  ('29 01 2023','17:16','ИУ8-35Б','Лекция','Социология',265,440),
  ('05 05 2023','09:13','ИУ3-75М','Семинарское занятие','Социология',386,1052),
  ('21 12 2022','10:01','ИУ3-75Б','Лабораторная работа','Интегралы и дифференциальные уравнения',324,139),
  ('04 09 2022','16:15','ИУ6-35М','Лекция','Языки интернет-программирования',286,1017),
  ('26 01 2023','18:46','СМ12-13Б','Лабораторная работа','Электротехника',107,329),
  ('26 10 2022','14:42','ИУ3-75Б','Лабораторная работа','Базы данных',248,1044),
  ('08 02 2023','18:43','ИУ6-32М','Лекция','Сопротивление материалов',323,198),
  ('07 09 2022','12:28','СМ12-14Б','Лекция','Английский язык',40,572);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('01 03 2023','10:49','ИУ7-36Б','Лабораторная работа','Языки интернет-программирования',223,842),
  ('19 12 2022','12:38','ИУ3-75М','Семинарское занятие','Языки интернет-программирования',280,884),
  ('26 02 2023','11:37','Э9-22Б','Лабораторная работа','Интегралы и дифференциальные уравнения',374,514),
  ('31 10 2022','18:17','ИУ6-55Б','Лекция','Интегралы и дифференциальные уравнения',118,479),
  ('25 11 2022','14:40','ИУ6-31Б','Семинарское занятие','Теория вероятностей и математическая статистика',148,1105),
  ('23 02 2023','16:39','ЛТ11-33Б','Семинарское занятие','Сопротивление материалов',236,651),
  ('19 04 2023','15:58','Э9-12Б','Лабораторная работа','Английский язык',173,567),
  ('15 09 2022','11:12','ИУ3-75М','Лабораторная работа','Английский язык',411,562),
  ('04 05 2023','10:56','СМ12-15Б','Семинарское занятие','Интегралы и дифференциальные уравнения',166,1011),
  ('02 05 2023','09:20','ИУ3-45Б','Семинарское занятие','История',493,566);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('29 11 2022','14:40','СМ12-14Б','Семинарское занятие','Электротехника',25,709),
  ('27 04 2023','15:09','ИУ6-35Б','Лекция','Интегралы и дифференциальные уравнения',192,880),
  ('14 04 2023','10:04','ИУ6-45Б','Семинарское занятие','Интегралы и дифференциальные уравнения',292,309),
  ('29 03 2023','16:19','ИУ3-53Б','Лабораторная работа','Электроника',89,709),
  ('26 01 2023','16:00','ИУ6-32М','Семинарское занятие','Основы программирования',117,624),
  ('08 05 2023','11:40','ИУ7-36Б','Семинарское занятие','Теоретическая механика',363,934),
  ('01 11 2022','11:01','ИУ6-31Б','Лекция','Физика',341,543),
  ('01 02 2023','12:34','Э9-12Б','Семинарское занятие','Теория вероятностей и математическая статистика',161,487),
  ('27 11 2022','16:19','ЛТ11-13Б','Семинарское занятие','Теория вероятностей и математическая статистика',484,925),
  ('24 04 2023','13:49','ЛТ11-13Б','Семинарское занятие','История',261,485);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('27 11 2022','13:48','ИУ3-75Б','Лабораторная работа','Базы данных',115,354),
  ('03 04 2023','08:34','ИУ3-75Б','Лекция','Электротехника',346,641),
  ('09 01 2023','14:35','ИУ3-75Б','Лабораторная работа','Электротехника',413,726),
  ('25 10 2022','15:30','СМ12-13Б','Семинарское занятие','Сопротивление материалов',82,461),
  ('21 02 2023','13:43','ИУ3-33Б','Лекция','Интегралы и дифференциальные уравнения',164,127),
  ('19 11 2022','18:12','ИУ3-45Б','Семинарское занятие','Языки интернет-программирования',130,937),
  ('03 05 2023','17:47','ИУ6-35М','Семинарское занятие','Сопротивление материалов',305,223),
  ('25 12 2022','16:20','ЛТ11-33Б','Лабораторная работа','Языки интернет-программирования',279,442),
  ('18 11 2022','12:21','СМ12-13Б','Лекция','Сопротивление материалов',135,970),
  ('04 09 2022','12:14','ИУ6-55Б','Семинарское занятие','Теория вероятностей и математическая статистика',25,787);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('04 11 2022','16:42','СМ12-13Б','Лабораторная работа','Английский язык',459,613),
  ('30 10 2022','18:04','ИУ3-45Б','Лабораторная работа','Интегралы и дифференциальные уравнения',489,384),
  ('07 12 2022','16:43','ИУ6-35М','Семинарское занятие','Социология',102,639),
  ('27 10 2022','12:09','ИУ9-32Б','Лекция','История',255,617),
  ('19 04 2023','17:24','СМ12-14Б','Лекция','Физика',11,1032),
  ('14 11 2022','11:12','ИУ3-33Б','Лекция','Языки интернет-программирования',448,813),
  ('23 01 2023','14:16','ИУ6-35М','Семинарское занятие','История',103,361),
  ('05 12 2022','09:15','ИУ6-32Б','Лабораторная работа','История',268,266),
  ('07 04 2023','12:10','ЛТ11-55Б','Лабораторная работа','Базы данных',72,903),
  ('18 09 2022','16:38','ИУ9-32Б','Лабораторная работа','Физика',497,113);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('31 01 2023','09:30','Э9-22Б','Семинарское занятие','Основы программирования',242,591),
  ('19 01 2023','14:51','ИУ3-33Б','Лекция','Интегралы и дифференциальные уравнения',184,597),
  ('14 10 2022','18:57','ИУ3-33Б','Лабораторная работа','Теоретическая механика',431,659),
  ('24 09 2022','10:37','ИУ6-32Б','Семинарское занятие','Английский язык',31,1132),
  ('04 04 2023','11:14','ИУ6-34Б','Лекция','Теория вероятностей и математическая статистика',413,162),
  ('18 04 2023','12:27','ИУ6-32Б','Лабораторная работа','Сопротивление материалов',347,938),
  ('04 05 2023','09:52','ИУ6-35М','Семинарское занятие','История',393,935),
  ('25 01 2023','13:12','ФН11-13Б','Лекция','Электротехника',41,848),
  ('09 06 2023','17:07','ИУ3-53Б','Лабораторная работа','Сопротивление материалов',326,867),
  ('18 02 2023','09:39','ИУ6-55Б','Лабораторная работа','Основы программирования',204,1097);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('10 09 2022','12:38','ИУ9-32Б','Лабораторная работа','Теория вероятностей и математическая статистика',282,570),
  ('15 04 2023','17:16','СМ12-14Б','Лекция','Сопротивление материалов',213,222),
  ('18 09 2022','11:42','ЛТ11-13Б','Семинарское занятие','Электроника',426,874),
  ('13 09 2022','17:33','ИУ9-32Б','Лабораторная работа','Сопротивление материалов',438,830),
  ('15 05 2023','14:53','ИУ8-35Б','Лекция','Теория вероятностей и математическая статистика',286,585),
  ('15 11 2022','14:36','ИУ6-45Б','Лабораторная работа','Электроника',189,272),
  ('19 05 2023','15:05','ЛТ11-33Б','Семинарское занятие','Теория вероятностей и математическая статистика',162,727),
  ('26 02 2023','10:32','ИУ6-34Б','Семинарское занятие','Сопротивление материалов',18,1080),
  ('07 06 2023','11:13','Э9-12Б','Лабораторная работа','Базы данных',343,722),
  ('02 06 2023','15:24','ИУ6-32Б','Семинарское занятие','Физика',497,126);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('30 11 2022','16:25','Э9-32Б','Лабораторная работа','История',199,895),
  ('12 03 2023','09:33','ФН11-13Б','Лабораторная работа','Теоретическая механика',356,199),
  ('07 04 2023','10:55','ИУ6-32М','Лабораторная работа','Сопротивление материалов',161,578),
  ('17 11 2022','11:36','ИУ3-33Б','Лабораторная работа','Базы данных',64,1006),
  ('17 01 2023','13:14','ИУ6-34Б','Семинарское занятие','Интегралы и дифференциальные уравнения',341,185),
  ('17 03 2023','09:19','СМ12-13Б','Лабораторная работа','Социология',457,977),
  ('04 04 2023','18:50','ЛТ11-55Б','Лабораторная работа','Языки интернет-программирования',263,161),
  ('22 03 2023','16:10','ИУ3-45Б','Лекция','История',276,986),
  ('28 01 2023','18:49','Э9-22Б','Лекция','Физика',420,785),
  ('14 01 2023','18:10','ИУ6-45Б','Лекция','Языки интернет-программирования',287,310);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('09 11 2022','11:08','ИУ3-75Б','Лабораторная работа','Физика',365,1091),
  ('12 10 2022','15:25','ИУ7-36Б','Лабораторная работа','Физика',49,749),
  ('21 02 2023','15:57','СМ12-15Б','Лабораторная работа','Физика',60,1108),
  ('22 01 2023','15:41','ИУ3-53Б','Лабораторная работа','Электротехника',294,909),
  ('04 03 2023','13:09','ИУ7-36Б','Семинарское занятие','Социология',441,248),
  ('07 11 2022','09:33','ИУ7-36Б','Лабораторная работа','Физика',219,470),
  ('15 09 2022','12:48','СМ12-11Б','Лекция','Социология',83,252),
  ('20 09 2022','13:17','ИУ6-32М','Лабораторная работа','Электроника',180,562),
  ('05 01 2023','15:21','ИУ3-42М','Семинарское занятие','Основы программирования',254,673),
  ('01 02 2023','13:51','ИУ3-53Б','Семинарское занятие','Электротехника',462,236);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('17 10 2022','13:05','ИУ9-32Б','Лекция','Теория вероятностей и математическая статистика',103,437),
  ('28 03 2023','12:36','ИУ6-34Б','Семинарское занятие','Электротехника',432,425),
  ('26 02 2023','15:51','ИУ6-32М','Лекция','Теоретическая механика',187,1063),
  ('02 02 2023','09:50','ИУ6-35Б','Лекция','Сопротивление материалов',26,788),
  ('01 06 2023','11:59','ИУ3-53Б','Лабораторная работа','Интегралы и дифференциальные уравнения',85,297),
  ('12 11 2022','18:03','ИУ6-34Б','Лабораторная работа','Электроника',176,1076),
  ('12 02 2023','08:56','СМ12-13Б','Семинарское занятие','История',419,559),
  ('20 10 2022','18:11','ИУ3-33Б','Лекция','Физика',469,971),
  ('25 05 2023','18:30','ИУ6-31Б','Семинарское занятие','Теоретическая механика',245,269),
  ('08 09 2022','18:24','СМ12-13Б','Лекция','Физика',236,786);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('22 04 2023','10:15','Э9-32Б','Лекция','Теоретическая механика',312,1025),
  ('05 03 2023','13:11','ИУ6-55Б','Лекция','Электроника',77,452),
  ('21 12 2022','14:00','СМ12-13Б','Лабораторная работа','Английский язык',309,978),
  ('31 05 2023','09:10','ИУ7-36Б','Лабораторная работа','Основы программирования',126,323),
  ('08 04 2023','10:09','ИУ6-55Б','Лекция','Основы программирования',257,778),
  ('12 05 2023','13:42','ИУ6-45Б','Семинарское занятие','История',56,1014),
  ('21 04 2023','17:01','ИУ3-45Б','Лабораторная работа','История',221,345),
  ('28 11 2022','18:36','ЛТ11-33Б','Лабораторная работа','Теория вероятностей и математическая статистика',454,444),
  ('26 11 2022','10:15','ИУ6-35Б','Лабораторная работа','Теоретическая механика',307,489),
  ('26 10 2022','13:07','ЛТ11-55Б','Лекция','Теоретическая механика',283,783);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('25 02 2023','10:31','ИУ6-45Б','Семинарское занятие','Базы данных',231,965),
  ('08 04 2023','17:42','СМ12-11Б','Семинарское занятие','История',127,261),
  ('03 06 2023','16:55','ИУ9-32Б','Семинарское занятие','Интегралы и дифференциальные уравнения',431,337),
  ('19 10 2022','16:32','ИУ6-32Б','Лекция','Электроника',133,134),
  ('14 03 2023','11:16','ИУ8-35Б','Семинарское занятие','Электротехника',50,954),
  ('27 09 2022','09:29','СМ12-11Б','Лабораторная работа','Базы данных',47,957),
  ('28 11 2022','09:02','ИУ6-55Б','Лекция','Английский язык',101,495),
  ('16 12 2022','18:41','ЛТ11-13Б','Лекция','Теория вероятностей и математическая статистика',176,711),
  ('24 01 2023','10:04','ИУ9-32Б','Семинарское занятие','Теоретическая механика',33,268),
  ('07 02 2023','16:47','СМ12-11Б','Семинарское занятие','Основы программирования',346,819);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('23 03 2023','11:48','ИУ3-45Б','Семинарское занятие','Теория вероятностей и математическая статистика',198,104),
  ('22 10 2022','18:22','ИУ3-42М','Лекция','Электротехника',35,765),
  ('23 02 2023','14:06','СМ12-15Б','Лекция','Основы программирования',337,490),
  ('12 11 2022','09:45','ИУ3-53Б','Лекция','Электротехника',353,858),
  ('24 01 2023','14:19','СМ12-14Б','Лабораторная работа','Английский язык',310,369),
  ('30 10 2022','16:34','ЛТ11-55Б','Семинарское занятие','Теория вероятностей и математическая статистика',480,966),
  ('11 05 2023','09:57','ИУ6-31Б','Семинарское занятие','Теоретическая механика',211,352),
  ('08 03 2023','11:46','ИУ3-33Б','Лабораторная работа','Интегралы и дифференциальные уравнения',93,650),
  ('20 05 2023','14:34','ИУ6-35Б','Лекция','Английский язык',345,398),
  ('03 10 2022','18:23','ИУ6-32М','Лекция','Английский язык',248,111);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('04 02 2023','12:45','ИУ3-33Б','Лекция','Теория вероятностей и математическая статистика',18,516),
  ('16 10 2022','10:40','СМ12-14Б','Лекция','Теоретическая механика',273,504),
  ('03 04 2023','13:07','ИУ3-33Б','Лабораторная работа','Теория вероятностей и математическая статистика',320,214),
  ('15 04 2023','12:50','ФН11-13Б','Лекция','Базы данных',91,540),
  ('02 09 2022','14:04','ЛТ11-13Б','Семинарское занятие','Электротехника',26,1041),
  ('14 02 2023','15:30','СМ12-13Б','Лекция','Физика',39,402),
  ('23 09 2022','12:16','ИУ3-33Б','Семинарское занятие','Интегралы и дифференциальные уравнения',162,197),
  ('11 01 2023','16:46','ИУ6-35М','Лекция','Электротехника',457,745),
  ('28 04 2023','10:59','СМ12-15Б','Лекция','Языки интернет-программирования',28,278),
  ('25 12 2022','13:10','ИУ3-75Б','Семинарское занятие','Английский язык',25,829);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('21 05 2023','14:55','ИУ6-45Б','Семинарское занятие','Теория вероятностей и математическая статистика',307,913),
  ('22 01 2023','10:41','ЛТ11-13Б','Лекция','История',211,265),
  ('02 12 2022','15:27','ИУ3-53Б','Семинарское занятие','Электротехника',280,1069),
  ('20 09 2022','08:37','ИУ6-55Б','Лабораторная работа','Базы данных',224,637),
  ('25 11 2022','17:43','ЛТ11-13Б','Лабораторная работа','Английский язык',30,603),
  ('02 05 2023','18:37','ИУ9-32Б','Лабораторная работа','Сопротивление материалов',112,1042),
  ('02 09 2022','18:14','СМ12-11Б','Лабораторная работа','Сопротивление материалов',214,857),
  ('04 09 2022','13:44','ИУ6-34Б','Лекция','Электроника',73,194),
  ('15 03 2023','14:50','ФН11-13Б','Лекция','Английский язык',479,183),
  ('10 03 2023','17:21','ИУ3-75М','Лабораторная работа','Английский язык',488,907);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('09 03 2023','14:51','ИУ6-45Б','Семинарское занятие','Электроника',321,260),
  ('03 12 2022','11:17','ИУ6-35М','Семинарское занятие','Базы данных',79,1139),
  ('27 03 2023','11:56','ИУ7-36Б','Лекция','История',56,340),
  ('06 01 2023','16:04','ИУ6-55Б','Лабораторная работа','Теоретическая механика',481,1055),
  ('22 04 2023','09:31','ЛТ11-55Б','Лабораторная работа','Интегралы и дифференциальные уравнения',294,740),
  ('12 01 2023','17:57','СМ12-14Б','Семинарское занятие','Английский язык',359,933),
  ('07 09 2022','12:47','Э9-32Б','Лабораторная работа','Языки интернет-программирования',56,536),
  ('20 01 2023','16:37','СМ12-15Б','Лекция','Электротехника',279,483),
  ('18 11 2022','09:24','ИУ6-31Б','Лекция','Теоретическая механика',377,1012),
  ('09 12 2022','10:58','ИУ3-42М','Семинарское занятие','Физика',326,865);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('24 03 2023','15:27','ИУ6-35М','Семинарское занятие','Социология',441,222),
  ('14 10 2022','15:03','ЛТ11-55Б','Семинарское занятие','Социология',394,999),
  ('07 04 2023','11:06','СМ12-11Б','Семинарское занятие','Английский язык',194,355),
  ('28 05 2023','11:46','ИУ6-32М','Семинарское занятие','Сопротивление материалов',310,594),
  ('20 10 2022','18:52','ФН11-13Б','Лабораторная работа','Социология',110,901),
  ('23 11 2022','16:40','ИУ7-36Б','Семинарское занятие','Основы программирования',27,913),
  ('17 10 2022','12:57','ИУ6-31Б','Лекция','Основы программирования',389,598),
  ('19 12 2022','16:34','СМ12-11Б','Лабораторная работа','Теоретическая механика',126,1024),
  ('14 10 2022','11:39','ЛТ11-33Б','Лекция','Основы программирования',325,651),
  ('08 04 2023','10:41','Э9-32Б','Лабораторная работа','Теоретическая механика',358,138);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('08 12 2022','10:58','СМ12-11Б','Семинарское занятие','Теория вероятностей и математическая статистика',349,1013),
  ('03 11 2022','12:49','ИУ3-33Б','Лекция','Сопротивление материалов',380,674),
  ('09 02 2023','14:19','Э9-22Б','Лекция','Электроника',335,1038),
  ('10 04 2023','14:20','ИУ9-32Б','Семинарское занятие','Теория вероятностей и математическая статистика',17,187),
  ('01 03 2023','15:04','ИУ6-31Б','Семинарское занятие','Электроника',406,531),
  ('09 09 2022','16:01','ИУ6-31Б','Лабораторная работа','История',19,988),
  ('22 09 2022','12:00','ИУ6-32Б','Лекция','Сопротивление материалов',268,1132),
  ('09 02 2023','16:09','ИУ3-33Б','Семинарское занятие','Интегралы и дифференциальные уравнения',79,318),
  ('22 03 2023','11:23','Э9-12Б','Лекция','Социология',350,1060),
  ('21 02 2023','11:28','Э9-12Б','Лекция','Английский язык',136,827);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('14 01 2023','12:48','ИУ3-75Б','Лекция','Базы данных',327,467),
  ('19 10 2022','13:23','ФН11-13Б','Лабораторная работа','Базы данных',459,493),
  ('16 01 2023','10:09','ИУ3-75М','Лекция','Английский язык',462,393),
  ('12 01 2023','14:02','СМ12-11Б','Семинарское занятие','Социология',430,1033),
  ('05 06 2023','12:33','ИУ9-32Б','Лабораторная работа','Физика',376,878),
  ('19 01 2023','17:39','Э9-22Б','Лекция','Физика',52,566),
  ('21 11 2022','11:43','ИУ3-45Б','Лабораторная работа','Интегралы и дифференциальные уравнения',45,888),
  ('16 03 2023','17:06','ИУ3-53Б','Лекция','Теоретическая механика',314,769),
  ('08 12 2022','14:33','ИУ7-36Б','Лекция','Физика',114,833),
  ('08 10 2022','14:28','ИУ6-35М','Лекция','История',461,665);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('05 01 2023','12:02','ИУ6-45Б','Лабораторная работа','Теоретическая механика',232,145),
  ('15 05 2023','13:00','ИУ3-75Б','Семинарское занятие','Теория вероятностей и математическая статистика',241,959),
  ('26 12 2022','11:22','СМ12-11Б','Семинарское занятие','Физика',71,994),
  ('22 10 2022','17:06','ИУ3-53Б','Лекция','Электроника',105,1002),
  ('28 12 2022','18:40','СМ12-14Б','Лабораторная работа','Теория вероятностей и математическая статистика',88,996),
  ('15 03 2023','12:03','ЛТ11-13Б','Лабораторная работа','Языки интернет-программирования',226,594),
  ('01 04 2023','15:13','ИУ6-32М','Лабораторная работа','Языки интернет-программирования',198,101),
  ('15 01 2023','08:38','ИУ3-75М','Семинарское занятие','Сопротивление материалов',454,870),
  ('11 12 2022','14:44','ИУ6-32Б','Лабораторная работа','Сопротивление материалов',353,1058),
  ('29 04 2023','13:58','ИУ6-35М','Семинарское занятие','Электроника',130,311);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('18 05 2023','15:26','СМ12-13Б','Семинарское занятие','История',422,414),
  ('14 10 2022','17:09','ИУ3-45Б','Семинарское занятие','Английский язык',385,1000),
  ('17 12 2022','15:48','ИУ3-33Б','Лабораторная работа','Теория вероятностей и математическая статистика',447,510),
  ('29 03 2023','17:52','ИУ6-45Б','Лабораторная работа','История',308,888),
  ('09 11 2022','11:33','ИУ6-35М','Лабораторная работа','Базы данных',303,610),
  ('02 05 2023','11:53','ФН11-13Б','Лабораторная работа','Языки интернет-программирования',149,397),
  ('23 11 2022','17:13','ИУ6-55Б','Лекция','Электроника',403,994),
  ('22 11 2022','18:10','СМ12-15Б','Семинарское занятие','Основы программирования',245,265),
  ('11 02 2023','09:21','ИУ3-75М','Семинарское занятие','Социология',427,959),
  ('03 02 2023','11:57','ИУ6-34Б','Семинарское занятие','Основы программирования',25,887);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('26 02 2023','12:24','ФН11-13Б','Лекция','Сопротивление материалов',179,624),
  ('04 12 2022','12:13','ИУ9-32Б','Семинарское занятие','Основы программирования',183,1070),
  ('28 01 2023','12:34','ИУ3-33Б','Семинарское занятие','Базы данных',77,144),
  ('01 11 2022','17:00','Э9-32Б','Лекция','Языки интернет-программирования',172,885),
  ('02 01 2023','13:49','ИУ3-75Б','Семинарское занятие','Физика',256,1102),
  ('17 03 2023','14:06','СМ12-11Б','Лабораторная работа','Социология',346,1095),
  ('02 04 2023','12:19','СМ12-15Б','Лабораторная работа','Теория вероятностей и математическая статистика',258,174),
  ('12 09 2022','12:15','Э9-12Б','Семинарское занятие','Интегралы и дифференциальные уравнения',496,237),
  ('05 05 2023','12:35','Э9-12Б','Лекция','Интегралы и дифференциальные уравнения',346,226),
  ('15 02 2023','17:48','ИУ6-35Б','Лекция','Английский язык',160,251);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('22 02 2023','12:54','ИУ6-55Б','Семинарское занятие','Теоретическая механика',267,835),
  ('30 05 2023','17:05','Э9-12Б','Лекция','Физика',457,752),
  ('06 10 2022','17:33','Э9-32Б','Семинарское занятие','Сопротивление материалов',359,171),
  ('27 12 2022','16:02','ЛТ11-33Б','Семинарское занятие','Физика',288,326),
  ('26 02 2023','18:40','ИУ6-31Б','Лекция','Теория вероятностей и математическая статистика',280,927),
  ('20 03 2023','12:10','ЛТ11-13Б','Лекция','Электроника',275,494),
  ('07 01 2023','11:10','ЛТ11-55Б','Лекция','Теоретическая механика',170,741),
  ('09 06 2023','11:16','ИУ8-35Б','Семинарское занятие','Электротехника',291,823),
  ('07 05 2023','15:53','ИУ6-32М','Лабораторная работа','Теория вероятностей и математическая статистика',247,423),
  ('09 12 2022','10:47','СМ12-11Б','Лабораторная работа','Электроника',195,1082);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('30 05 2023','16:55','ИУ7-36Б','Семинарское занятие','Физика',219,581),
  ('30 09 2022','09:00','ИУ6-55Б','Семинарское занятие','Теория вероятностей и математическая статистика',87,971),
  ('17 12 2022','08:32','ИУ3-75Б','Лекция','Социология',483,937),
  ('19 03 2023','15:29','СМ12-13Б','Семинарское занятие','История',290,605),
  ('05 06 2023','11:43','СМ12-14Б','Лабораторная работа','Физика',106,1041),
  ('09 12 2022','18:58','ИУ3-75Б','Лекция','Базы данных',60,184),
  ('21 11 2022','12:36','ИУ3-75М','Семинарское занятие','Базы данных',135,468),
  ('22 05 2023','10:22','ЛТ11-13Б','Лабораторная работа','История',384,805),
  ('01 04 2023','11:37','ФН11-13Б','Лекция','Языки интернет-программирования',465,706),
  ('28 11 2022','17:35','ЛТ11-13Б','Семинарское занятие','Сопротивление материалов',463,620);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('10 03 2023','16:49','ИУ9-32Б','Лабораторная работа','Сопротивление материалов',338,194),
  ('01 06 2023','11:22','ИУ7-36Б','Семинарское занятие','Электроника',141,1059),
  ('18 10 2022','16:02','СМ12-14Б','Семинарское занятие','Сопротивление материалов',221,1061),
  ('18 09 2022','14:41','ИУ3-75Б','Лабораторная работа','Теория вероятностей и математическая статистика',93,365),
  ('10 12 2022','16:41','ИУ6-45Б','Лекция','История',481,503),
  ('06 04 2023','12:28','ЛТ11-13Б','Лабораторная работа','Электротехника',476,712),
  ('26 02 2023','17:26','ИУ3-75М','Лекция','Электротехника',69,1122),
  ('29 09 2022','18:11','ИУ6-32М','Лекция','Английский язык',245,673),
  ('02 02 2023','15:53','ЛТ11-55Б','Семинарское занятие','Базы данных',94,210),
  ('14 04 2023','18:15','ЛТ11-13Б','Лекция','Социология',303,741);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('02 03 2023','18:40','ИУ7-36Б','Лекция','Базы данных',323,1056),
  ('10 09 2022','14:04','Э9-32Б','Семинарское занятие','Теория вероятностей и математическая статистика',195,344),
  ('31 03 2023','13:24','ФН11-13Б','Семинарское занятие','Сопротивление материалов',311,986),
  ('09 09 2022','17:07','ИУ6-35Б','Семинарское занятие','Основы программирования',158,969),
  ('27 11 2022','11:05','Э9-22Б','Лекция','Английский язык',492,1040),
  ('27 09 2022','09:46','ИУ3-53Б','Семинарское занятие','Социология',101,745),
  ('07 06 2023','13:28','ЛТ11-55Б','Лекция','Социология',46,1033),
  ('04 01 2023','14:51','ИУ6-35Б','Семинарское занятие','Интегралы и дифференциальные уравнения',415,812),
  ('03 11 2022','12:33','Э9-32Б','Лекция','Базы данных',377,596),
  ('07 03 2023','16:33','ИУ8-35Б','Семинарское занятие','Английский язык',78,577);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('15 02 2023','12:13','ИУ6-45Б','Лекция','Английский язык',208,852),
  ('13 12 2022','13:26','ИУ3-45Б','Семинарское занятие','Английский язык',263,527),
  ('05 04 2023','10:45','ЛТ11-55Б','Семинарское занятие','Английский язык',74,480),
  ('29 12 2022','16:00','ФН11-13Б','Лабораторная работа','Социология',356,569),
  ('23 05 2023','17:34','ИУ6-31Б','Семинарское занятие','Социология',486,647),
  ('21 09 2022','15:19','СМ12-13Б','Семинарское занятие','Социология',164,213),
  ('29 04 2023','11:41','ИУ6-45Б','Лекция','Электроника',165,581),
  ('20 09 2022','18:00','ИУ6-35М','Семинарское занятие','Электроника',20,558),
  ('29 11 2022','16:53','ИУ6-31Б','Лекция','Теория вероятностей и математическая статистика',81,1019),
  ('22 10 2022','15:24','ИУ3-75Б','Лекция','Базы данных',424,407);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('28 09 2022','10:19','ИУ6-35Б','Семинарское занятие','Теория вероятностей и математическая статистика',363,1143),
  ('13 03 2023','17:49','ЛТ11-55Б','Лекция','Основы программирования',157,523),
  ('18 02 2023','16:12','Э9-32Б','Лекция','Физика',282,1025),
  ('01 02 2023','08:52','ИУ9-32Б','Лабораторная работа','Теоретическая механика',86,378),
  ('30 11 2022','09:24','ИУ8-35Б','Лабораторная работа','Физика',303,522),
  ('11 12 2022','17:30','ИУ3-45Б','Семинарское занятие','История',499,892),
  ('19 04 2023','13:39','ИУ6-32Б','Лекция','Теория вероятностей и математическая статистика',44,391),
  ('22 04 2023','14:17','ЛТ11-13Б','Лабораторная работа','Сопротивление материалов',79,198),
  ('28 05 2023','10:13','ИУ3-42М','Лекция','Социология',251,389),
  ('13 10 2022','09:15','ЛТ11-13Б','Лабораторная работа','Электротехника',51,886);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('29 12 2022','17:16','ФН11-13Б','Лекция','Социология',488,820),
  ('02 05 2023','10:59','Э9-12Б','Лабораторная работа','Интегралы и дифференциальные уравнения',240,718),
  ('18 02 2023','10:04','ИУ3-42М','Лабораторная работа','Теория вероятностей и математическая статистика',264,1131),
  ('28 09 2022','11:04','СМ12-15Б','Семинарское занятие','Базы данных',490,386),
  ('04 10 2022','10:10','ИУ7-36Б','Лабораторная работа','Интегралы и дифференциальные уравнения',456,324),
  ('14 12 2022','18:37','ИУ8-35Б','Семинарское занятие','Базы данных',470,759),
  ('11 03 2023','16:33','ИУ6-35Б','Семинарское занятие','Физика',254,534),
  ('08 09 2022','17:22','ИУ3-33Б','Лабораторная работа','Теоретическая механика',254,327),
  ('15 04 2023','17:44','ИУ6-32Б','Лабораторная работа','История',473,873),
  ('29 11 2022','12:16','ИУ6-55Б','Семинарское занятие','Электроника',484,662);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('30 10 2022','12:18','ИУ3-33Б','Лекция','Электротехника',58,559),
  ('04 10 2022','10:06','ИУ8-35Б','Семинарское занятие','История',99,166),
  ('11 10 2022','11:52','ФН11-13Б','Лабораторная работа','Теория вероятностей и математическая статистика',217,940),
  ('11 01 2023','09:49','ИУ3-75М','Семинарское занятие','Базы данных',200,531),
  ('02 06 2023','17:44','ИУ6-32М','Семинарское занятие','Электротехника',452,102),
  ('31 05 2023','11:30','ИУ6-34Б','Семинарское занятие','История',268,843),
  ('26 12 2022','12:37','ИУ6-35Б','Семинарское занятие','Теоретическая механика',226,298),
  ('14 09 2022','13:59','Э9-32Б','Лекция','Физика',96,742),
  ('27 04 2023','14:33','СМ12-11Б','Лабораторная работа','Электроника',55,199),
  ('10 12 2022','14:14','Э9-12Б','Лабораторная работа','Теоретическая механика',158,453);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('08 01 2023','18:51','ИУ3-75М','Семинарское занятие','Социология',60,428),
  ('02 02 2023','09:54','ИУ3-75Б','Лабораторная работа','Английский язык',166,652),
  ('12 03 2023','09:36','ИУ9-32Б','Семинарское занятие','Базы данных',489,957),
  ('28 12 2022','15:01','ИУ3-42М','Семинарское занятие','Теория вероятностей и математическая статистика',239,630),
  ('17 10 2022','11:24','СМ12-13Б','Семинарское занятие','Электротехника',147,424),
  ('04 03 2023','08:52','ИУ3-33Б','Лекция','Электроника',151,1080),
  ('03 06 2023','18:22','ЛТ11-55Б','Лабораторная работа','Теория вероятностей и математическая статистика',266,213),
  ('30 09 2022','16:59','Э9-32Б','Лекция','Базы данных',492,830),
  ('02 04 2023','13:33','ИУ6-35Б','Лекция','Сопротивление материалов',145,407),
  ('13 11 2022','12:21','ИУ9-32Б','Лабораторная работа','Теоретическая механика',380,239);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('02 02 2023','18:32','ИУ6-35Б','Семинарское занятие','Теоретическая механика',118,1041),
  ('01 01 2023','08:52','ИУ6-55Б','Семинарское занятие','Теория вероятностей и математическая статистика',201,931),
  ('04 01 2023','09:14','ИУ6-35Б','Лабораторная работа','Социология',378,242),
  ('05 11 2022','16:19','ИУ8-35Б','Лабораторная работа','Основы программирования',443,835),
  ('09 10 2022','15:42','ИУ6-45Б','Лабораторная работа','Электротехника',484,670),
  ('02 09 2022','16:33','ФН11-13Б','Семинарское занятие','Электроника',61,471),
  ('21 01 2023','12:45','ИУ6-35Б','Лабораторная работа','Языки интернет-программирования',382,181),
  ('12 01 2023','11:31','ИУ9-32Б','Лабораторная работа','Социология',209,470),
  ('07 05 2023','11:34','СМ12-15Б','Семинарское занятие','Английский язык',145,749),
  ('14 02 2023','15:07','ИУ9-32Б','Лабораторная работа','Языки интернет-программирования',291,753);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('04 06 2023','11:19','СМ12-14Б','Семинарское занятие','Физика',412,671),
  ('14 09 2022','17:45','ИУ6-35М','Семинарское занятие','Сопротивление материалов',28,597),
  ('26 01 2023','16:03','ЛТ11-55Б','Лекция','Английский язык',374,299),
  ('30 03 2023','13:38','ИУ7-36Б','Семинарское занятие','Социология',58,224),
  ('06 04 2023','09:51','СМ12-15Б','Лабораторная работа','Теория вероятностей и математическая статистика',365,138),
  ('20 01 2023','16:07','СМ12-13Б','Семинарское занятие','Теоретическая механика',418,664),
  ('28 12 2022','15:46','ИУ6-35М','Семинарское занятие','Сопротивление материалов',368,621),
  ('20 03 2023','11:35','Э9-12Б','Лекция','История',233,521),
  ('05 05 2023','08:52','ИУ6-55Б','Лабораторная работа','История',258,996),
  ('16 04 2023','10:27','ФН11-13Б','Лекция','Социология',273,808);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('12 09 2022','11:33','ИУ6-55Б','Семинарское занятие','Интегралы и дифференциальные уравнения',81,1133),
  ('15 03 2023','15:43','ИУ6-31Б','Лабораторная работа','Интегралы и дифференциальные уравнения',183,429),
  ('17 09 2022','16:32','ИУ7-36Б','Лекция','Сопротивление материалов',351,712),
  ('06 06 2023','13:50','ИУ3-33Б','Семинарское занятие','Электротехника',339,535),
  ('13 02 2023','16:12','ЛТ11-13Б','Семинарское занятие','Английский язык',338,918),
  ('29 11 2022','14:13','Э9-22Б','Семинарское занятие','Сопротивление материалов',344,924),
  ('05 11 2022','13:42','ИУ8-35Б','Лабораторная работа','Электротехника',487,895),
  ('17 03 2023','08:48','ИУ8-35Б','Лекция','Английский язык',234,1089),
  ('13 04 2023','12:14','СМ12-13Б','Семинарское занятие','Теоретическая механика',186,146),
  ('23 09 2022','17:54','ИУ6-35Б','Лабораторная работа','Электроника',378,688);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('23 02 2023','17:12','Э9-12Б','Лабораторная работа','Теоретическая механика',229,936),
  ('10 02 2023','16:10','ИУ6-32Б','Семинарское занятие','Языки интернет-программирования',352,892),
  ('20 01 2023','09:20','ИУ7-36Б','Лабораторная работа','Теория вероятностей и математическая статистика',301,182),
  ('08 12 2022','12:34','ИУ6-32Б','Лабораторная работа','Теоретическая механика',47,912),
  ('29 04 2023','09:04','ЛТ11-13Б','Семинарское занятие','Интегралы и дифференциальные уравнения',232,673),
  ('23 10 2022','14:59','СМ12-11Б','Семинарское занятие','Физика',190,646),
  ('19 01 2023','15:52','Э9-22Б','Лабораторная работа','Сопротивление материалов',116,1146),
  ('26 12 2022','17:52','ИУ6-35М','Лабораторная работа','Языки интернет-программирования',405,155),
  ('26 10 2022','11:07','ИУ6-45Б','Семинарское занятие','Социология',98,516),
  ('26 04 2023','11:49','ИУ3-42М','Лекция','Электроника',222,919);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('11 04 2023','17:47','ИУ6-45Б','Семинарское занятие','Социология',256,766),
  ('08 06 2023','13:56','ИУ6-55Б','Семинарское занятие','Сопротивление материалов',294,501),
  ('12 02 2023','08:30','СМ12-14Б','Лекция','Базы данных',322,327),
  ('20 12 2022','15:19','Э9-12Б','Семинарское занятие','Физика',129,355),
  ('23 10 2022','11:35','ИУ6-35М','Лекция','Английский язык',324,437),
  ('06 01 2023','12:55','ИУ6-35Б','Лабораторная работа','Социология',372,293),
  ('25 11 2022','18:36','ИУ3-33Б','Лабораторная работа','Физика',73,543),
  ('26 10 2022','09:18','ИУ7-36Б','Лекция','Физика',102,231),
  ('10 03 2023','14:41','ИУ6-32Б','Лекция','Интегралы и дифференциальные уравнения',430,412),
  ('25 12 2022','14:30','СМ12-15Б','Лабораторная работа','Базы данных',146,327);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('22 01 2023','15:00','ИУ7-36Б','Семинарское занятие','Языки интернет-программирования',151,861),
  ('13 09 2022','14:34','ИУ6-34Б','Лабораторная работа','Сопротивление материалов',104,962),
  ('14 03 2023','18:19','ЛТ11-13Б','Лабораторная работа','Физика',37,603),
  ('10 12 2022','16:14','ИУ3-75М','Семинарское занятие','Сопротивление материалов',232,154),
  ('14 03 2023','17:22','СМ12-13Б','Лабораторная работа','Сопротивление материалов',444,775),
  ('14 05 2023','17:08','ЛТ11-13Б','Лекция','История',214,598),
  ('09 10 2022','11:30','СМ12-13Б','Семинарское занятие','Физика',168,799),
  ('17 03 2023','16:54','СМ12-13Б','Лабораторная работа','Базы данных',453,1044),
  ('14 01 2023','11:01','Э9-22Б','Лабораторная работа','Базы данных',196,188),
  ('16 11 2022','14:48','ИУ9-32Б','Лабораторная работа','Электротехника',97,180);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('27 05 2023','14:30','ИУ8-35Б','Лабораторная работа','Электротехника',24,476),
  ('05 10 2022','09:12','СМ12-13Б','Семинарское занятие','Основы программирования',153,362),
  ('16 04 2023','16:19','ИУ6-31Б','Лабораторная работа','Английский язык',40,491),
  ('04 05 2023','10:55','СМ12-14Б','Лекция','Интегралы и дифференциальные уравнения',5,607),
  ('13 02 2023','13:41','ИУ3-75М','Лекция','Языки интернет-программирования',483,157),
  ('17 12 2022','18:50','ИУ6-32Б','Лекция','Основы программирования',412,249),
  ('29 03 2023','15:22','ИУ6-55Б','Лекция','История',349,1122),
  ('03 10 2022','16:30','ИУ9-32Б','Семинарское занятие','Основы программирования',334,394),
  ('06 06 2023','17:08','ЛТ11-13Б','Лекция','Электроника',444,144),
  ('19 10 2022','14:09','ИУ6-35Б','Семинарское занятие','Базы данных',431,777);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('09 03 2023','10:35','ИУ7-36Б','Семинарское занятие','Электротехника',108,140),
  ('10 10 2022','12:26','ИУ3-75Б','Лекция','Языки интернет-программирования',444,871),
  ('14 09 2022','10:04','ИУ3-42М','Семинарское занятие','Языки интернет-программирования',76,685),
  ('03 09 2022','17:17','ИУ7-36Б','Лабораторная работа','Базы данных',40,687),
  ('16 05 2023','15:22','ИУ6-35М','Лабораторная работа','Языки интернет-программирования',315,493),
  ('02 01 2023','16:40','СМ12-15Б','Лекция','Английский язык',76,471),
  ('05 06 2023','08:45','ЛТ11-55Б','Лекция','Английский язык',184,548),
  ('14 02 2023','12:57','ИУ3-53Б','Лабораторная работа','Теоретическая механика',182,856),
  ('21 12 2022','13:43','Э9-32Б','Лабораторная работа','Теория вероятностей и математическая статистика',349,468),
  ('02 10 2022','16:50','ИУ3-42М','Лекция','Электроника',238,245);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('17 09 2022','11:58','ИУ6-35Б','Лабораторная работа','Социология',38,1109),
  ('03 11 2022','10:56','ИУ6-32М','Лабораторная работа','Физика',221,897),
  ('01 06 2023','11:37','ИУ6-34Б','Семинарское занятие','Базы данных',231,725),
  ('21 11 2022','11:47','ИУ6-34Б','Лабораторная работа','Интегралы и дифференциальные уравнения',288,431),
  ('15 05 2023','13:09','ИУ7-36Б','Лекция','История',474,662),
  ('11 03 2023','17:24','ЛТ11-55Б','Семинарское занятие','Социология',111,207),
  ('22 10 2022','14:30','Э9-22Б','Семинарское занятие','Теоретическая механика',396,230),
  ('11 01 2023','18:46','ИУ6-32М','Семинарское занятие','Языки интернет-программирования',314,487),
  ('19 12 2022','11:18','ИУ6-55Б','Семинарское занятие','Английский язык',282,475),
  ('16 03 2023','17:40','ИУ6-31Б','Семинарское занятие','Теория вероятностей и математическая статистика',390,572);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('28 11 2022','14:57','ИУ6-32М','Семинарское занятие','Языки интернет-программирования',46,582),
  ('04 04 2023','13:30','ИУ6-32Б','Лекция','Социология',191,1142),
  ('05 10 2022','12:33','ИУ9-32Б','Лабораторная работа','История',450,576),
  ('12 04 2023','16:50','ИУ3-75М','Лекция','Английский язык',288,731),
  ('13 03 2023','10:12','ФН11-13Б','Лекция','Физика',397,801),
  ('18 02 2023','09:45','ИУ8-35Б','Лабораторная работа','История',205,565),
  ('25 03 2023','17:16','ИУ3-75Б','Семинарское занятие','Английский язык',116,112),
  ('10 02 2023','18:07','ИУ6-32Б','Лекция','Языки интернет-программирования',134,1015),
  ('19 09 2022','09:18','ИУ6-31Б','Семинарское занятие','Базы данных',187,268),
  ('14 04 2023','17:32','СМ12-15Б','Семинарское занятие','Английский язык',156,257);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('29 05 2023','11:47','ИУ6-45Б','Семинарское занятие','Сопротивление материалов',11,143),
  ('17 04 2023','14:55','ИУ6-45Б','Лабораторная работа','Основы программирования',348,1056),
  ('09 12 2022','09:53','ФН11-13Б','Семинарское занятие','Социология',286,303),
  ('26 10 2022','17:17','ИУ3-45Б','Лекция','Интегралы и дифференциальные уравнения',493,1150),
  ('28 11 2022','10:14','Э9-22Б','Семинарское занятие','Английский язык',410,346),
  ('29 10 2022','08:59','ИУ3-42М','Лекция','Базы данных',239,597),
  ('11 05 2023','15:44','СМ12-13Б','Лабораторная работа','Языки интернет-программирования',378,718),
  ('26 05 2023','09:31','ИУ6-35Б','Лекция','Электроника',86,882),
  ('10 01 2023','16:57','СМ12-13Б','Лекция','Базы данных',330,1092),
  ('26 05 2023','08:42','ИУ3-33Б','Лекция','Интегралы и дифференциальные уравнения',249,742);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('03 02 2023','12:53','ИУ3-42М','Лабораторная работа','Электроника',356,256),
  ('21 02 2023','14:57','СМ12-11Б','Лабораторная работа','Сопротивление материалов',401,256),
  ('19 09 2022','16:06','ЛТ11-13Б','Лекция','История',255,199),
  ('07 05 2023','10:37','Э9-12Б','Семинарское занятие','Социология',207,152),
  ('28 01 2023','09:14','ИУ3-75М','Семинарское занятие','Базы данных',156,702),
  ('15 09 2022','12:40','СМ12-13Б','Лабораторная работа','Теория вероятностей и математическая статистика',76,613),
  ('25 01 2023','12:40','СМ12-15Б','Лабораторная работа','Социология',243,426),
  ('16 09 2022','14:08','ИУ3-42М','Семинарское занятие','Электротехника',221,198),
  ('26 09 2022','09:40','ИУ6-45Б','Семинарское занятие','Теоретическая механика',244,1115),
  ('09 03 2023','18:38','Э9-12Б','Семинарское занятие','Языки интернет-программирования',253,1144);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('07 01 2023','10:42','СМ12-15Б','Лекция','Английский язык',286,1004),
  ('24 09 2022','10:10','ИУ3-53Б','Лабораторная работа','Языки интернет-программирования',383,188),
  ('20 12 2022','14:52','ИУ6-34Б','Семинарское занятие','Английский язык',118,261),
  ('15 11 2022','14:10','СМ12-11Б','Лабораторная работа','Электротехника',258,733),
  ('26 05 2023','18:14','СМ12-13Б','Лекция','Теоретическая механика',150,877),
  ('08 02 2023','14:16','ИУ3-45Б','Лабораторная работа','Физика',281,469),
  ('17 09 2022','16:14','ИУ6-35Б','Семинарское занятие','Теоретическая механика',177,1094),
  ('12 01 2023','16:25','Э9-12Б','Семинарское занятие','Электротехника',315,434),
  ('08 02 2023','10:00','ИУ8-35Б','Семинарское занятие','История',229,474),
  ('06 10 2022','12:05','ИУ3-42М','Лабораторная работа','Теоретическая механика',84,940);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('15 12 2022','16:26','ИУ6-34Б','Семинарское занятие','Английский язык',241,416),
  ('29 11 2022','10:31','СМ12-15Б','Семинарское занятие','Английский язык',318,785),
  ('27 04 2023','10:32','ИУ8-35Б','Лекция','История',293,151),
  ('08 05 2023','17:44','ЛТ11-55Б','Семинарское занятие','Базы данных',480,214),
  ('17 10 2022','15:32','ИУ6-35М','Семинарское занятие','Языки интернет-программирования',224,503),
  ('19 05 2023','11:37','ИУ3-33Б','Лекция','История',18,416),
  ('06 06 2023','14:18','ЛТ11-13Б','Лабораторная работа','Физика',357,995),
  ('02 10 2022','10:00','Э9-12Б','Лабораторная работа','Теория вероятностей и математическая статистика',144,171),
  ('04 09 2022','15:22','ИУ6-35Б','Лабораторная работа','Теоретическая механика',394,916),
  ('19 10 2022','16:07','ИУ8-35Б','Семинарское занятие','Теория вероятностей и математическая статистика',162,206);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('19 01 2023','18:33','ИУ6-55Б','Лекция','Интегралы и дифференциальные уравнения',372,846),
  ('23 11 2022','13:25','ИУ7-36Б','Лекция','История',222,911),
  ('17 09 2022','12:06','СМ12-14Б','Лабораторная работа','Теория вероятностей и математическая статистика',64,697),
  ('19 12 2022','12:30','Э9-22Б','Семинарское занятие','Языки интернет-программирования',256,303),
  ('07 03 2023','16:40','ИУ3-42М','Семинарское занятие','Интегралы и дифференциальные уравнения',178,1146),
  ('08 11 2022','16:01','СМ12-11Б','Семинарское занятие','Теоретическая механика',79,999),
  ('30 01 2023','16:34','Э9-32Б','Лекция','Языки интернет-программирования',440,603),
  ('22 12 2022','13:12','ИУ3-75Б','Семинарское занятие','Социология',266,727),
  ('25 05 2023','16:07','ИУ6-35Б','Семинарское занятие','Основы программирования',396,785),
  ('07 03 2023','12:37','ИУ6-35М','Лабораторная работа','Физика',469,938);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('09 09 2022','11:23','ИУ3-33Б','Лекция','Теория вероятностей и математическая статистика',20,954),
  ('24 10 2022','11:10','ИУ8-35Б','Лабораторная работа','Языки интернет-программирования',429,1038),
  ('20 04 2023','12:54','Э9-32Б','Лабораторная работа','Интегралы и дифференциальные уравнения',289,1141),
  ('31 03 2023','10:47','ИУ6-32Б','Семинарское занятие','Базы данных',306,803),
  ('29 04 2023','14:21','ИУ3-75М','Лабораторная работа','Базы данных',215,608),
  ('06 10 2022','13:00','ИУ3-45Б','Лабораторная работа','Языки интернет-программирования',10,1118),
  ('26 12 2022','17:55','ЛТ11-13Б','Лабораторная работа','Базы данных',244,896),
  ('28 09 2022','14:04','ЛТ11-33Б','Лабораторная работа','Электроника',454,643),
  ('03 06 2023','12:18','ИУ3-75М','Лекция','Интегралы и дифференциальные уравнения',280,566),
  ('01 11 2022','12:34','ИУ8-35Б','Лабораторная работа','Интегралы и дифференциальные уравнения',26,977);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('03 04 2023','18:15','ИУ6-35М','Лабораторная работа','Интегралы и дифференциальные уравнения',487,106),
  ('04 03 2023','17:50','Э9-32Б','Лекция','Интегралы и дифференциальные уравнения',311,582),
  ('20 09 2022','13:39','ИУ6-32Б','Семинарское занятие','Интегралы и дифференциальные уравнения',246,724),
  ('16 01 2023','09:55','ИУ3-45Б','Семинарское занятие','Электротехника',396,495),
  ('09 01 2023','09:23','СМ12-11Б','Семинарское занятие','Электротехника',80,125),
  ('15 04 2023','13:34','ИУ3-33Б','Лекция','Теоретическая механика',39,622),
  ('22 02 2023','12:52','ИУ3-45Б','Семинарское занятие','Теоретическая механика',219,531),
  ('29 01 2023','14:51','ИУ3-75Б','Семинарское занятие','Сопротивление материалов',100,395),
  ('05 01 2023','14:57','ИУ3-75М','Лабораторная работа','Английский язык',469,803),
  ('19 10 2022','14:32','ИУ3-75М','Лабораторная работа','История',6,940);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('10 02 2023','08:46','СМ12-14Б','Лекция','Электроника',275,151),
  ('17 12 2022','11:13','Э9-12Б','Лабораторная работа','Социология',497,696),
  ('24 01 2023','08:59','ЛТ11-55Б','Лабораторная работа','Физика',253,814),
  ('15 09 2022','15:16','СМ12-14Б','Лабораторная работа','Электротехника',361,438),
  ('22 02 2023','13:37','Э9-22Б','Лабораторная работа','История',368,320),
  ('09 03 2023','12:41','Э9-32Б','Лекция','Английский язык',194,524),
  ('01 05 2023','11:35','ИУ6-55Б','Лабораторная работа','Основы программирования',293,780),
  ('09 12 2022','16:54','ИУ3-42М','Лекция','Электротехника',304,238),
  ('19 12 2022','18:14','ИУ6-31Б','Лекция','Теоретическая механика',431,847),
  ('14 02 2023','11:48','ИУ6-32М','Семинарское занятие','Теоретическая механика',353,235);
INSERT INTO class (date,time,group_code,class_type,subject_name,professor_id,classroom)
VALUES
  ('25 03 2023','09:37','ИУ6-55Б','Лекция','Теоретическая механика',290,279),
  ('15 09 2022','09:13','СМ12-14Б','Семинарское занятие','Интегралы и дифференциальные уравнения',478,454),
  ('20 11 2022','15:45','ИУ7-36Б','Лекция','Сопротивление материалов',288,1087),
  ('05 03 2023','08:50','ИУ3-75Б','Семинарское занятие','Электротехника',489,678),
  ('03 09 2022','17:07','ИУ6-31Б','Лекция','Физика',197,800),
  ('18 04 2023','11:09','ИУ3-42М','Лабораторная работа','Теоретическая механика',196,566),
  ('18 05 2023','14:45','СМ12-15Б','Лабораторная работа','История',493,772),
  ('29 11 2022','12:44','СМ12-11Б','Семинарское занятие','Языки интернет-программирования',354,653),
  ('15 05 2023','16:25','ИУ3-75Б','Семинарское занятие','Теория вероятностей и математическая статистика',280,910),
  ('30 04 2023','14:48','ИУ6-35Б','Лабораторная работа','Физика',326,424);
