TRUNCATE "group" RESTART IDENTITY CASCADE;
INSERT INTO "group" (students_number,group_code,semester,degree)
VALUES
  (8,'ИУ6-34Б',2,'Бакалавриат'),
  (14,'ИУ6-32Б',4,'Специалитет'),
  (29,'ЛТ11-13Б',9,'Бакалавриат'),
  (7,'ИУ3-35Б',7,'Бакалавриат'),
  (11,'ИУ6-34Б',2,'Бакалавриат'),
  (2,'ЛТ11-33Б',5,'Аспирантура'),
  (5,'ИУ3-53Б',7,'Аспирантура'),
  (3,'ИУ3-53Б',1,'Магистратура'),
  (27,'ИУ3-35Б',3,'Специалитет'),
  (10,'Э9-22Б',8,'Бакалавриат');
INSERT INTO "group" (students_number,group_code,semester,degree)
VALUES
  (20,'ИУ6-34Б',8,'Бакалавриат'),
  (4,'СМ12-11Б',6,'Магистратура'),
  (15,'ИУ3-35Б',4,'Бакалавриат'),
  (14,'СМ12-14Б',3,'Аспирантура'),
  (17,'ИУ6-32Б',1,'Аспирантура'),
  (1,'ИУ3-33Б',6,'Магистратура'),
  (11,'ЛТ11-13Б',8,'Специалитет'),
  (5,'Э9-22Б',8,'Аспирантура'),
  (29,'ИУ6-34Б',4,'Специалитет'),
  (23,'Э9-22Б',4,'Специалитет');
INSERT INTO "group" (students_number,group_code,semester,degree)
VALUES
  (26,'Э9-32Б',9,'Аспирантура'),
  (16,'ИУ3-45Б',6,'Аспирантура'),
  (1,'ИУ3-53Б',7,'Магистратура'),
  (10,'Э9-32Б',3,'Аспирантура'),
  (13,'ИУ3-42М',2,'Магистратура'),
  (16,'ИУ3-33Б',8,'Аспирантура'),
  (27,'ИУ6-32Б',2,'Магистратура'),
  (8,'ИУ8-35б',10,'Магистратура'),
  (25,'ИУ6-35Б',8,'Специалитет'),
  (23,'ИУ6-25М',8,'Специалитет');
INSERT INTO "group" (students_number,group_code,semester,degree)
VALUES
  (14,'Э9-22Б',10,'Магистратура'),
  (4,'СМ12-14Б',9,'Аспирантура'),
  (23,'Э9-12Б',7,'Специалитет'),
  (16,'ИУ8-35б',5,'Магистратура'),
  (2,'ЛТ11-55Б',10,'Магистратура'),
  (5,'СМ12-13Б',1,'Магистратура'),
  (25,'СМ12-14Б',3,'Бакалавриат'),
  (2,'ИУ3-53Б',0,'Магистратура'),
  (8,'ЛТ11-33Б',2,'Бакалавриат'),
  (8,'ИУ6-31Б',6,'Бакалавриат');
INSERT INTO "group" (students_number,group_code,semester,degree)
VALUES
  (29,'ИУ6-45Б',0,'Аспирантура'),
  (5,'ИУ6-32М',4,'Бакалавриат'),
  (29,'СМ12-15Б',6,'Специалитет'),
  (30,'Э9-32Б',1,'Бакалавриат'),
  (24,'ИУ3-75М',4,'Бакалавриат'),
  (26,'ИУ6-31Б',0,'Аспирантура'),
  (11,'ИУ6-32Б',8,'Аспирантура'),
  (7,'ИУ3-75М',4,'Бакалавриат'),
  (27,'СМ12-15Б',5,'Магистратура'),
  (17,'Э9-22Б',8,'Магистратура');
