TRUNCATE professor RESTART IDENTITY CASCADE;

INSERT INTO professor (professor_name,department,work_status,science_degree)
VALUES
  ('Лукин К.Б.','ИУ7','Семинарист','Доктор наук'),
  ('Халайджи А.К.','Л2','Лектор','Кандидат наук'),
  ('Мугла Д.Р.','Л2','Лаборант','Доктор наук'),
  ('Веселовская О.А.','СГН3','Семинарист','Бакалавр'),
  ('Горяинов В.Б.','ФН11','Лектор','Бакалавр'),
  ('Птицына И.В.','ИУ3','Лектор','Магистр'),
  ('Халайджи А.К.','ИУ6','Семинарист','Магистр'),
  ('Иванова Г.С.','Э9','Лектор','Доктор наук'),
  ('Веселовская О.А.','ФН11','Лектор','Доктор наук'),
  ('Мугла Д.Р.','СГН3','Семинарист','Кандидат наук');
INSERT INTO professor (professor_name,department,work_status,science_degree)
VALUES
  ('Константинов М.Ю.','СГН3','Лектор','Бакалавр'),
  ('Халайджи А.К.','ИУ3','Лаборант','Магистр'),
  ('Мугла Д.Р.','СГН3','Лаборант','Магистр'),
  ('Левина Е.Ю.','ИУ1','Лаборант','Магистр'),
  ('Губарь А.М.','ИУ7','Лаборант','Магистр'),
  ('Птицына И.В.','РК1','Лаборант','Доктор наук'),
  ('Самарев Р.С.','ФН11','Лаборант','Доктор наук'),
  ('Веселовская О.А.','ФН4','Лаборант','Бакалавр'),
  ('Лукин К.Б.','ИУ9','Лектор','Кандидат наук'),
  ('Мугла Д.Р.','ИУ6','Лаборант','Доктор наук');
INSERT INTO professor (professor_name,department,work_status,science_degree)
VALUES
  ('Фомин М.М.','Л2','Лаборант','Доктор наук'),
  ('Константинов М.Ю.','ИУ6','Лаборант','Магистр'),
  ('Скворцов С.П.','СГН3','Лаборант','Магистр'),
  ('Миков Д.А.','ИУ3','Лектор','Кандидат наук'),
  ('Самарев Р.С.','Л2','Семинарист','Доктор наук'),
  ('Иванова Г.С.','Л2','Лаборант','Бакалавр'),
  ('Миков Д.А.','Л2','Семинарист','Магистр'),
  ('Горяинов В.Б.','РК1','Лаборант','Магистр'),
  ('Горяинов В.Б.','ИУ3','Лектор','Бакалавр'),
  ('Веселовская О.А.','ИУ9','Лектор','Доктор наук');
INSERT INTO professor (professor_name,department,work_status,science_degree)
VALUES
  ('Константинов М.Ю.','ИУ6','Лаборант','Бакалавр'),
  ('Горяинов В.Б.','Л4','Лаборант','Кандидат наук'),
  ('Губарь А.М.','ФН12','Лаборант','Магистр'),
  ('Подзорова М.И.','ИУ3','Лаборант','Кандидат наук'),
  ('Подзорова М.И.','ФН11','Лектор','Бакалавр'),
  ('Птицына И.В.','ИУ7','Семинарист','Бакалавр'),
  ('Самарев Р.С.','ИУ7','Лектор','Доктор наук'),
  ('Скворцов С.П.','ФН11','Лектор','Доктор наук'),
  ('Миков Д.А.','ИУ6','Семинарист','Доктор наук'),
  ('Иванова Г.С.','РК1','Лаборант','Доктор наук');
INSERT INTO professor (professor_name,department,work_status,science_degree)
VALUES
  ('Иванова Г.С.','ИУ6','Лаборант','Кандидат наук'),
  ('Подзорова М.И.','ФН11','Семинарист','Кандидат наук'),
  ('Скворцов С.П.','ИУ6','Семинарист','Кандидат наук'),
  ('Чуев А.С.','ИУ3','Лектор','Доктор наук'),
  ('Чуев А.С.','Л4','Лектор','Кандидат наук'),
  ('Халайджи А.К.','ФН11','Семинарист','Магистр'),
  ('Подзорова М.И.','Л2','Семинарист','Кандидат наук'),
  ('Птицына И.В.','ФН12','Семинарист','Доктор наук'),
  ('Миков Д.А.','ФН11','Лектор','Бакалавр'),
  ('Халайджи А.К.','ФН11','Лаборант','Доктор наук');
INSERT INTO professor (professor_name,department,work_status,science_degree)
VALUES
  ('Чуев А.С.','ФН4','Лаборант','Доктор наук'),
  ('Горяинов В.Б.','ФН11','Лаборант','Доктор наук'),
  ('Подзорова М.И.','ИУ1','Лаборант','Магистр'),
  ('Веселовская О.А.','ИУ3','Лаборант','Магистр'),
  ('Птицына И.В.','ИУ9','Семинарист','Бакалавр'),
  ('Левина Е.Ю.','ИУ6','Лектор','Бакалавр'),
  ('Птицына И.В.','ИУ3','Лаборант','Кандидат наук'),
  ('Лукин К.Б.','ИУ1','Лектор','Доктор наук'),
  ('Скворцов С.П.','ИУ9','Лектор','Кандидат наук'),
  ('Скворцов С.П.','ФН4','Лаборант','Кандидат наук');
INSERT INTO professor (professor_name,department,work_status,science_degree)
VALUES
  ('Самарев Р.С.','ИУ9','Семинарист','Бакалавр'),
  ('Чуев А.С.','ИУ3','Лаборант','Доктор наук'),
  ('Птицына И.В.','ИУ7','Лаборант','Бакалавр'),
  ('Халайджи А.К.','ФН11','Семинарист','Бакалавр'),
  ('Мугла Д.Р.','ИУ1','Семинарист','Доктор наук'),
  ('Скворцов С.П.','ФН4','Семинарист','Магистр'),
  ('Губарь А.М.','ИУ3','Семинарист','Кандидат наук'),
  ('Фомин М.М.','ИУ7','Семинарист','Кандидат наук'),
  ('Фомин М.М.','ФН12','Лектор','Магистр'),
  ('Горяинов В.Б.','ИУ9','Семинарист','Магистр');
INSERT INTO professor (professor_name,department,work_status,science_degree)
VALUES
  ('Губарь А.М.','РК1','Лаборант','Доктор наук'),
  ('Птицына И.В.','ФН12','Лаборант','Кандидат наук'),
  ('Скворцов С.П.','ИУ7','Лаборант','Кандидат наук'),
  ('Иванова Г.С.','ФН11','Лектор','Магистр'),
  ('Самарев Р.С.','Л4','Лектор','Магистр'),
  ('Иванова Г.С.','ФН12','Семинарист','Кандидат наук'),
  ('Самарев Р.С.','ИУ6','Лаборант','Магистр'),
  ('Лукин К.Б.','ИУ6','Семинарист','Бакалавр'),
  ('Лукин К.Б.','Л2','Лектор','Бакалавр'),
  ('Мугла Д.Р.','ИУ6','Лаборант','Бакалавр');
INSERT INTO professor (professor_name,department,work_status,science_degree)
VALUES
  ('Иванова Г.С.','ИУ3','Лаборант','Кандидат наук'),
  ('Губарь А.М.','Л4','Семинарист','Доктор наук'),
  ('Фомин М.М.','Э9','Семинарист','Магистр'),
  ('Мугла Д.Р.','Л2','Семинарист','Бакалавр'),
  ('Иванова Г.С.','ФН4','Лаборант','Кандидат наук'),
  ('Птицына И.В.','ИУ6','Лектор','Магистр'),
  ('Горяинов В.Б.','ИУ6','Лаборант','Кандидат наук'),
  ('Иванова Г.С.','Э9','Лаборант','Бакалавр'),
  ('Птицына И.В.','Э9','Лаборант','Доктор наук'),
  ('Левина Е.Ю.','ИУ9','Лаборант','Бакалавр');
INSERT INTO professor (professor_name,department,work_status,science_degree)
VALUES
  ('Миков Д.А.','ИУ1','Лектор','Кандидат наук'),
  ('Самарев Р.С.','ИУ6','Лаборант','Кандидат наук'),
  ('Фомин М.М.','ИУ7','Лаборант','Бакалавр'),
  ('Иванова Г.С.','РК1','Лаборант','Магистр'),
  ('Миков Д.А.','ИУ1','Лектор','Доктор наук'),
  ('Веселовская О.А.','ФН12','Лектор','Магистр'),
  ('Горяинов В.Б.','Э9','Семинарист','Кандидат наук'),
  ('Скворцов С.П.','Л2','Лаборант','Доктор наук'),
  ('Константинов М.Ю.','Л2','Семинарист','Магистр'),
  ('Подзорова М.И.','ИУ6','Лаборант','Магистр');
INSERT INTO professor (professor_name,department,work_status,science_degree)
VALUES
  ('Скворцов С.П.','РК1','Семинарист','Доктор наук'),
  ('Иванова Г.С.','СГН3','Семинарист','Кандидат наук'),
  ('Чуев А.С.','ИУ1','Лектор','Доктор наук'),
  ('Птицына И.В.','ФН12','Лаборант','Бакалавр'),
  ('Константинов М.Ю.','ИУ7','Семинарист','Магистр'),
  ('Мугла Д.Р.','ИУ3','Лектор','Бакалавр'),
  ('Губарь А.М.','СГН3','Лектор','Доктор наук'),
  ('Губарь А.М.','ИУ7','Лектор','Магистр'),
  ('Самарев Р.С.','ФН12','Семинарист','Бакалавр'),
  ('Лукин К.Б.','Э9','Лаборант','Магистр');
INSERT INTO professor (professor_name,department,work_status,science_degree)
VALUES
  ('Веселовская О.А.','ИУ1','Лаборант','Магистр'),
  ('Миков Д.А.','ФН4','Семинарист','Кандидат наук'),
  ('Подзорова М.И.','Л2','Лаборант','Доктор наук'),
  ('Чуев А.С.','РК1','Лектор','Кандидат наук'),
  ('Лукин К.Б.','ФН4','Лектор','Бакалавр'),
  ('Губарь А.М.','ФН11','Лаборант','Кандидат наук'),
  ('Миков Д.А.','РК1','Лектор','Доктор наук'),
  ('Птицына И.В.','Л2','Лаборант','Магистр'),
  ('Лукин К.Б.','ИУ7','Лектор','Доктор наук'),
  ('Подзорова М.И.','Э9','Лаборант','Доктор наук');
INSERT INTO professor (professor_name,department,work_status,science_degree)
VALUES
  ('Птицына И.В.','ИУ3','Лектор','Бакалавр'),
  ('Самарев Р.С.','ИУ7','Семинарист','Бакалавр'),
  ('Фомин М.М.','Л4','Лаборант','Бакалавр'),
  ('Фомин М.М.','ФН12','Семинарист','Бакалавр'),
  ('Подзорова М.И.','Л2','Семинарист','Магистр'),
  ('Мугла Д.Р.','ИУ1','Лектор','Магистр'),
  ('Чуев А.С.','ИУ7','Семинарист','Магистр'),
  ('Подзорова М.И.','ФН11','Лаборант','Бакалавр'),
  ('Иванова Г.С.','ФН12','Семинарист','Доктор наук'),
  ('Левина Е.Ю.','Э9','Лектор','Бакалавр');
INSERT INTO professor (professor_name,department,work_status,science_degree)
VALUES
  ('Птицына И.В.','Л2','Семинарист','Бакалавр'),
  ('Левина Е.Ю.','ИУ7','Лектор','Магистр'),
  ('Веселовская О.А.','Л2','Лаборант','Магистр'),
  ('Чуев А.С.','ФН11','Лектор','Бакалавр'),
  ('Веселовская О.А.','ИУ1','Семинарист','Магистр'),
  ('Скворцов С.П.','ФН12','Лектор','Доктор наук'),
  ('Самарев Р.С.','Э9','Семинарист','Кандидат наук'),
  ('Самарев Р.С.','Л2','Семинарист','Магистр'),
  ('Чуев А.С.','Л4','Семинарист','Бакалавр'),
  ('Мугла Д.Р.','ИУ7','Лаборант','Кандидат наук');
INSERT INTO professor (professor_name,department,work_status,science_degree)
VALUES
  ('Горяинов В.Б.','ИУ6','Семинарист','Бакалавр'),
  ('Миков Д.А.','СГН3','Лектор','Магистр'),
  ('Самарев Р.С.','ИУ3','Лаборант','Бакалавр'),
  ('Губарь А.М.','ИУ3','Лектор','Доктор наук'),
  ('Губарь А.М.','ИУ9','Лектор','Бакалавр'),
  ('Горяинов В.Б.','СГН3','Семинарист','Доктор наук'),
  ('Иванова Г.С.','ИУ1','Семинарист','Доктор наук'),
  ('Константинов М.Ю.','ФН11','Лаборант','Доктор наук'),
  ('Халайджи А.К.','ИУ9','Лектор','Кандидат наук'),
  ('Самарев Р.С.','ФН11','Лаборант','Кандидат наук');
INSERT INTO professor (professor_name,department,work_status,science_degree)
VALUES
  ('Горяинов В.Б.','ИУ3','Лаборант','Бакалавр'),
  ('Скворцов С.П.','ИУ3','Лаборант','Кандидат наук'),
  ('Подзорова М.И.','ИУ6','Семинарист','Бакалавр'),
  ('Самарев Р.С.','ИУ9','Лаборант','Кандидат наук'),
  ('Иванова Г.С.','ФН4','Лаборант','Доктор наук'),
  ('Веселовская О.А.','ФН11','Семинарист','Бакалавр'),
  ('Миков Д.А.','ИУ7','Лектор','Магистр'),
  ('Горяинов В.Б.','ФН11','Семинарист','Кандидат наук'),
  ('Халайджи А.К.','СГН3','Семинарист','Кандидат наук'),
  ('Самарев Р.С.','Э9','Лаборант','Доктор наук');
INSERT INTO professor (professor_name,department,work_status,science_degree)
VALUES
  ('Птицына И.В.','ФН4','Лектор','Доктор наук'),
  ('Лукин К.Б.','Л2','Семинарист','Кандидат наук'),
  ('Горяинов В.Б.','ФН11','Лектор','Бакалавр'),
  ('Скворцов С.П.','РК1','Лектор','Магистр'),
  ('Иванова Г.С.','Л4','Лаборант','Кандидат наук'),
  ('Лукин К.Б.','ИУ6','Лектор','Доктор наук'),
  ('Горяинов В.Б.','СГН3','Лаборант','Доктор наук'),
  ('Фомин М.М.','СГН3','Лаборант','Доктор наук'),
  ('Левина Е.Ю.','Л2','Лаборант','Бакалавр'),
  ('Губарь А.М.','ФН4','Семинарист','Магистр');
INSERT INTO professor (professor_name,department,work_status,science_degree)
VALUES
  ('Самарев Р.С.','РК1','Лаборант','Доктор наук'),
  ('Веселовская О.А.','ФН12','Лаборант','Магистр'),
  ('Миков Д.А.','РК1','Семинарист','Бакалавр'),
  ('Скворцов С.П.','Л4','Лектор','Магистр'),
  ('Лукин К.Б.','ФН11','Лаборант','Доктор наук'),
  ('Горяинов В.Б.','ИУ1','Лаборант','Бакалавр'),
  ('Лукин К.Б.','РК1','Лектор','Доктор наук'),
  ('Веселовская О.А.','Э9','Лектор','Бакалавр'),
  ('Левина Е.Ю.','СГН3','Семинарист','Кандидат наук'),
  ('Халайджи А.К.','Л2','Семинарист','Кандидат наук');
INSERT INTO professor (professor_name,department,work_status,science_degree)
VALUES
  ('Лукин К.Б.','ФН4','Семинарист','Доктор наук'),
  ('Константинов М.Ю.','ИУ6','Семинарист','Бакалавр'),
  ('Скворцов С.П.','ИУ6','Лаборант','Доктор наук'),
  ('Самарев Р.С.','Л2','Лектор','Доктор наук'),
  ('Скворцов С.П.','Л2','Семинарист','Бакалавр'),
  ('Левина Е.Ю.','ИУ9','Лектор','Бакалавр'),
  ('Чуев А.С.','РК1','Семинарист','Бакалавр'),
  ('Чуев А.С.','РК1','Семинарист','Доктор наук'),
  ('Халайджи А.К.','Л4','Лаборант','Магистр'),
  ('Чуев А.С.','РК1','Семинарист','Магистр');
INSERT INTO professor (professor_name,department,work_status,science_degree)
VALUES
  ('Губарь А.М.','ФН4','Семинарист','Бакалавр'),
  ('Горяинов В.Б.','СГН3','Лектор','Бакалавр'),
  ('Константинов М.Ю.','ИУ3','Семинарист','Бакалавр'),
  ('Горяинов В.Б.','ИУ6','Семинарист','Бакалавр'),
  ('Скворцов С.П.','ИУ9','Семинарист','Кандидат наук'),
  ('Лукин К.Б.','ФН4','Семинарист','Кандидат наук'),
  ('Лукин К.Б.','ФН11','Лектор','Бакалавр'),
  ('Скворцов С.П.','ФН4','Семинарист','Доктор наук'),
  ('Самарев Р.С.','СГН3','Семинарист','Бакалавр'),
  ('Иванова Г.С.','РК1','Лаборант','Кандидат наук');
INSERT INTO professor (professor_name,department,work_status,science_degree)
VALUES
  ('Лукин К.Б.','ИУ3','Лектор','Доктор наук'),
  ('Подзорова М.И.','СГН3','Семинарист','Бакалавр'),
  ('Константинов М.Ю.','ФН12','Лаборант','Магистр'),
  ('Скворцов С.П.','ИУ1','Лаборант','Магистр'),
  ('Иванова Г.С.','ИУ6','Лектор','Доктор наук'),
  ('Константинов М.Ю.','ИУ7','Лаборант','Бакалавр'),
  ('Иванова Г.С.','ИУ7','Лаборант','Кандидат наук'),
  ('Скворцов С.П.','Л4','Лектор','Кандидат наук'),
  ('Веселовская О.А.','Л4','Лектор','Кандидат наук'),
  ('Птицына И.В.','ИУ1','Лектор','Магистр');
INSERT INTO professor (professor_name,department,work_status,science_degree)
VALUES
  ('Левина Е.Ю.','ФН4','Семинарист','Магистр'),
  ('Чуев А.С.','ИУ7','Семинарист','Бакалавр'),
  ('Иванова Г.С.','ИУ7','Семинарист','Кандидат наук'),
  ('Мугла Д.Р.','СГН3','Лаборант','Бакалавр'),
  ('Халайджи А.К.','Э9','Лаборант','Кандидат наук'),
  ('Самарев Р.С.','ИУ9','Семинарист','Доктор наук'),
  ('Губарь А.М.','Э9','Лектор','Доктор наук'),
  ('Мугла Д.Р.','ИУ1','Семинарист','Кандидат наук'),
  ('Халайджи А.К.','ФН11','Семинарист','Бакалавр'),
  ('Самарев Р.С.','ИУ9','Семинарист','Кандидат наук');
INSERT INTO professor (professor_name,department,work_status,science_degree)
VALUES
  ('Самарев Р.С.','ФН12','Семинарист','Бакалавр'),
  ('Веселовская О.А.','Л4','Семинарист','Магистр'),
  ('Горяинов В.Б.','ИУ6','Лектор','Бакалавр'),
  ('Веселовская О.А.','ФН4','Лектор','Доктор наук'),
  ('Халайджи А.К.','Л2','Семинарист','Магистр'),
  ('Лукин К.Б.','ИУ3','Семинарист','Кандидат наук'),
  ('Горяинов В.Б.','ФН4','Семинарист','Кандидат наук'),
  ('Подзорова М.И.','ФН11','Семинарист','Бакалавр'),
  ('Подзорова М.И.','ИУ9','Семинарист','Кандидат наук'),
  ('Птицына И.В.','Э9','Лектор','Доктор наук');
INSERT INTO professor (professor_name,department,work_status,science_degree)
VALUES
  ('Губарь А.М.','РК1','Лектор','Кандидат наук'),
  ('Веселовская О.А.','ИУ1','Лектор','Кандидат наук'),
  ('Халайджи А.К.','ИУ1','Семинарист','Доктор наук'),
  ('Лукин К.Б.','Л2','Семинарист','Доктор наук'),
  ('Чуев А.С.','СГН3','Семинарист','Магистр'),
  ('Веселовская О.А.','ФН4','Лаборант','Кандидат наук'),
  ('Самарев Р.С.','ФН4','Лаборант','Доктор наук'),
  ('Константинов М.Ю.','РК1','Лектор','Доктор наук'),
  ('Скворцов С.П.','ИУ3','Лаборант','Кандидат наук'),
  ('Миков Д.А.','РК1','Семинарист','Кандидат наук');
INSERT INTO professor (professor_name,department,work_status,science_degree)
VALUES
  ('Птицына И.В.','Э9','Лаборант','Кандидат наук'),
  ('Чуев А.С.','Э9','Лектор','Бакалавр'),
  ('Фомин М.М.','ФН12','Семинарист','Кандидат наук'),
  ('Халайджи А.К.','Л4','Семинарист','Бакалавр'),
  ('Самарев Р.С.','ИУ6','Лектор','Бакалавр'),
  ('Чуев А.С.','ИУ1','Лектор','Бакалавр'),
  ('Горяинов В.Б.','Э9','Лектор','Кандидат наук'),
  ('Левина Е.Ю.','ИУ9','Лектор','Кандидат наук'),
  ('Миков Д.А.','ИУ9','Лаборант','Доктор наук'),
  ('Фомин М.М.','ФН4','Семинарист','Магистр');
INSERT INTO professor (professor_name,department,work_status,science_degree)
VALUES
  ('Губарь А.М.','ИУ3','Семинарист','Доктор наук'),
  ('Левина Е.Ю.','ФН12','Лаборант','Доктор наук'),
  ('Левина Е.Ю.','Л2','Лектор','Доктор наук'),
  ('Птицына И.В.','ИУ7','Лектор','Магистр'),
  ('Самарев Р.С.','ИУ7','Лаборант','Доктор наук'),
  ('Фомин М.М.','ИУ9','Лаборант','Бакалавр'),
  ('Фомин М.М.','ИУ1','Лектор','Кандидат наук'),
  ('Лукин К.Б.','Л4','Семинарист','Доктор наук'),
  ('Иванова Г.С.','РК1','Лаборант','Кандидат наук'),
  ('Птицына И.В.','ФН11','Лаборант','Магистр');
INSERT INTO professor (professor_name,department,work_status,science_degree)
VALUES
  ('Мугла Д.Р.','ИУ7','Семинарист','Бакалавр'),
  ('Веселовская О.А.','ИУ7','Лектор','Магистр'),
  ('Миков Д.А.','Л2','Семинарист','Магистр'),
  ('Халайджи А.К.','Л2','Лектор','Магистр'),
  ('Левина Е.Ю.','СГН3','Лектор','Бакалавр'),
  ('Подзорова М.И.','СГН3','Семинарист','Кандидат наук'),
  ('Фомин М.М.','Л2','Семинарист','Кандидат наук'),
  ('Миков Д.А.','ИУ1','Лаборант','Кандидат наук'),
  ('Скворцов С.П.','ФН11','Семинарист','Бакалавр'),
  ('Губарь А.М.','Л4','Лектор','Бакалавр');
INSERT INTO professor (professor_name,department,work_status,science_degree)
VALUES
  ('Горяинов В.Б.','ИУ1','Лаборант','Бакалавр'),
  ('Веселовская О.А.','Л4','Лектор','Кандидат наук'),
  ('Халайджи А.К.','ФН4','Лаборант','Доктор наук'),
  ('Миков Д.А.','ФН11','Семинарист','Магистр'),
  ('Миков Д.А.','ФН4','Лаборант','Доктор наук'),
  ('Горяинов В.Б.','ИУ1','Семинарист','Кандидат наук'),
  ('Иванова Г.С.','ФН4','Лектор','Магистр'),
  ('Халайджи А.К.','Л2','Семинарист','Кандидат наук'),
  ('Иванова Г.С.','ИУ6','Лаборант','Магистр'),
  ('Левина Е.Ю.','Л2','Лаборант','Бакалавр');
INSERT INTO professor (professor_name,department,work_status,science_degree)
VALUES
  ('Птицына И.В.','Э9','Лаборант','Бакалавр'),
  ('Самарев Р.С.','ФН4','Лектор','Магистр'),
  ('Губарь А.М.','Л4','Лаборант','Кандидат наук'),
  ('Константинов М.Ю.','ИУ9','Семинарист','Кандидат наук'),
  ('Иванова Г.С.','Л4','Лаборант','Кандидат наук'),
  ('Мугла Д.Р.','ИУ6','Лаборант','Бакалавр'),
  ('Скворцов С.П.','ФН11','Семинарист','Доктор наук'),
  ('Птицына И.В.','ФН12','Лектор','Доктор наук'),
  ('Птицына И.В.','Э9','Лаборант','Доктор наук'),
  ('Константинов М.Ю.','ИУ9','Лаборант','Магистр');
INSERT INTO professor (professor_name,department,work_status,science_degree)
VALUES
  ('Левина Е.Ю.','РК1','Семинарист','Доктор наук'),
  ('Константинов М.Ю.','ИУ3','Семинарист','Кандидат наук'),
  ('Константинов М.Ю.','ИУ9','Семинарист','Магистр'),
  ('Птицына И.В.','СГН3','Семинарист','Доктор наук'),
  ('Мугла Д.Р.','Э9','Лектор','Бакалавр'),
  ('Самарев Р.С.','Л4','Лаборант','Доктор наук'),
  ('Иванова Г.С.','Э9','Семинарист','Бакалавр'),
  ('Чуев А.С.','Л4','Лаборант','Кандидат наук'),
  ('Иванова Г.С.','Э9','Семинарист','Кандидат наук'),
  ('Чуев А.С.','ФН4','Лаборант','Кандидат наук');
INSERT INTO professor (professor_name,department,work_status,science_degree)
VALUES
  ('Горяинов В.Б.','ИУ3','Семинарист','Доктор наук'),
  ('Константинов М.Ю.','ИУ6','Лектор','Кандидат наук'),
  ('Самарев Р.С.','РК1','Лаборант','Магистр'),
  ('Губарь А.М.','ИУ9','Семинарист','Магистр'),
  ('Мугла Д.Р.','ФН11','Семинарист','Бакалавр'),
  ('Скворцов С.П.','ФН11','Лаборант','Бакалавр'),
  ('Чуев А.С.','ИУ9','Семинарист','Кандидат наук'),
  ('Иванова Г.С.','ФН11','Семинарист','Доктор наук'),
  ('Подзорова М.И.','ИУ6','Лаборант','Доктор наук'),
  ('Скворцов С.П.','ФН12','Лаборант','Кандидат наук');
INSERT INTO professor (professor_name,department,work_status,science_degree)
VALUES
  ('Веселовская О.А.','РК1','Лаборант','Бакалавр'),
  ('Птицына И.В.','ИУ7','Лектор','Доктор наук'),
  ('Левина Е.Ю.','РК1','Лаборант','Кандидат наук'),
  ('Птицына И.В.','Э9','Лаборант','Кандидат наук'),
  ('Губарь А.М.','ФН4','Семинарист','Доктор наук'),
  ('Иванова Г.С.','Л4','Лектор','Кандидат наук'),
  ('Халайджи А.К.','СГН3','Семинарист','Бакалавр'),
  ('Самарев Р.С.','ИУ9','Лаборант','Доктор наук'),
  ('Чуев А.С.','ИУ9','Лектор','Кандидат наук'),
  ('Скворцов С.П.','Э9','Семинарист','Кандидат наук');
INSERT INTO professor (professor_name,department,work_status,science_degree)
VALUES
  ('Скворцов С.П.','ФН4','Семинарист','Доктор наук'),
  ('Самарев Р.С.','РК1','Лектор','Бакалавр'),
  ('Самарев Р.С.','ФН4','Семинарист','Бакалавр'),
  ('Птицына И.В.','ИУ9','Лектор','Магистр'),
  ('Птицына И.В.','СГН3','Семинарист','Доктор наук'),
  ('Губарь А.М.','ИУ7','Лектор','Кандидат наук'),
  ('Миков Д.А.','ИУ3','Семинарист','Доктор наук'),
  ('Самарев Р.С.','ИУ3','Лектор','Доктор наук'),
  ('Подзорова М.И.','ИУ7','Семинарист','Кандидат наук'),
  ('Мугла Д.Р.','ФН11','Лектор','Магистр');
INSERT INTO professor (professor_name,department,work_status,science_degree)
VALUES
  ('Фомин М.М.','ИУ1','Лектор','Бакалавр'),
  ('Скворцов С.П.','ИУ7','Лаборант','Доктор наук'),
  ('Миков Д.А.','ИУ9','Лектор','Доктор наук'),
  ('Миков Д.А.','ФН4','Лаборант','Доктор наук'),
  ('Иванова Г.С.','Э9','Семинарист','Бакалавр'),
  ('Самарев Р.С.','ИУ6','Лаборант','Кандидат наук'),
  ('Губарь А.М.','Л4','Лаборант','Доктор наук'),
  ('Константинов М.Ю.','Л4','Семинарист','Доктор наук'),
  ('Халайджи А.К.','РК1','Лектор','Бакалавр'),
  ('Миков Д.А.','СГН3','Лаборант','Кандидат наук');
INSERT INTO professor (professor_name,department,work_status,science_degree)
VALUES
  ('Птицына И.В.','ФН12','Лектор','Бакалавр'),
  ('Подзорова М.И.','Э9','Лаборант','Кандидат наук'),
  ('Чуев А.С.','Л2','Лектор','Доктор наук'),
  ('Веселовская О.А.','ИУ7','Лаборант','Доктор наук'),
  ('Иванова Г.С.','ФН11','Лаборант','Кандидат наук'),
  ('Чуев А.С.','Л4','Лаборант','Бакалавр'),
  ('Лукин К.Б.','ИУ3','Лектор','Бакалавр'),
  ('Лукин К.Б.','Л4','Семинарист','Магистр'),
  ('Лукин К.Б.','ИУ3','Лаборант','Доктор наук'),
  ('Птицына И.В.','Л4','Семинарист','Магистр');
INSERT INTO professor (professor_name,department,work_status,science_degree)
VALUES
  ('Чуев А.С.','СГН3','Семинарист','Доктор наук'),
  ('Губарь А.М.','ИУ1','Семинарист','Доктор наук'),
  ('Подзорова М.И.','ФН12','Лектор','Кандидат наук'),
  ('Птицына И.В.','ИУ3','Семинарист','Бакалавр'),
  ('Миков Д.А.','ФН11','Семинарист','Магистр'),
  ('Фомин М.М.','ИУ1','Лаборант','Доктор наук'),
  ('Чуев А.С.','Л2','Лаборант','Бакалавр'),
  ('Веселовская О.А.','Л4','Семинарист','Доктор наук'),
  ('Мугла Д.Р.','Л2','Лектор','Бакалавр'),
  ('Горяинов В.Б.','ФН11','Семинарист','Бакалавр');
INSERT INTO professor (professor_name,department,work_status,science_degree)
VALUES
  ('Миков Д.А.','ИУ7','Семинарист','Бакалавр'),
  ('Миков Д.А.','ФН11','Лектор','Бакалавр'),
  ('Иванова Г.С.','ИУ3','Лаборант','Магистр'),
  ('Губарь А.М.','Э9','Лектор','Бакалавр'),
  ('Горяинов В.Б.','ИУ9','Лектор','Доктор наук'),
  ('Горяинов В.Б.','ИУ3','Семинарист','Кандидат наук'),
  ('Губарь А.М.','ФН11','Лаборант','Доктор наук'),
  ('Миков Д.А.','ИУ3','Семинарист','Кандидат наук'),
  ('Подзорова М.И.','ИУ7','Лектор','Магистр'),
  ('Веселовская О.А.','ИУ1','Семинарист','Магистр');
INSERT INTO professor (professor_name,department,work_status,science_degree)
VALUES
  ('Лукин К.Б.','ФН12','Лектор','Магистр'),
  ('Мугла Д.Р.','ФН11','Лектор','Магистр'),
  ('Мугла Д.Р.','Л2','Лаборант','Кандидат наук'),
  ('Чуев А.С.','РК1','Семинарист','Доктор наук'),
  ('Мугла Д.Р.','ИУ6','Семинарист','Доктор наук'),
  ('Мугла Д.Р.','Л4','Лектор','Бакалавр'),
  ('Подзорова М.И.','ФН11','Семинарист','Доктор наук'),
  ('Самарев Р.С.','ИУ3','Лектор','Магистр'),
  ('Самарев Р.С.','ИУ7','Лаборант','Бакалавр'),
  ('Лукин К.Б.','Л2','Семинарист','Доктор наук');
INSERT INTO professor (professor_name,department,work_status,science_degree)
VALUES
  ('Константинов М.Ю.','ИУ7','Лаборант','Магистр'),
  ('Скворцов С.П.','ИУ9','Лектор','Доктор наук'),
  ('Веселовская О.А.','ФН4','Семинарист','Доктор наук'),
  ('Чуев А.С.','ИУ1','Лектор','Доктор наук'),
  ('Иванова Г.С.','ИУ7','Семинарист','Доктор наук'),
  ('Миков Д.А.','ИУ7','Лаборант','Магистр'),
  ('Мугла Д.Р.','ИУ1','Лектор','Доктор наук'),
  ('Миков Д.А.','Э9','Семинарист','Бакалавр'),
  ('Птицына И.В.','ФН12','Лаборант','Бакалавр'),
  ('Мугла Д.Р.','ФН12','Лаборант','Доктор наук');
INSERT INTO professor (professor_name,department,work_status,science_degree)
VALUES
  ('Лукин К.Б.','Л2','Лаборант','Доктор наук'),
  ('Мугла Д.Р.','ФН11','Лектор','Магистр'),
  ('Константинов М.Ю.','ИУ1','Семинарист','Кандидат наук'),
  ('Константинов М.Ю.','ФН4','Лаборант','Бакалавр'),
  ('Горяинов В.Б.','ИУ9','Лектор','Кандидат наук'),
  ('Скворцов С.П.','Л2','Семинарист','Доктор наук'),
  ('Самарев Р.С.','ФН11','Семинарист','Кандидат наук'),
  ('Скворцов С.П.','ИУ9','Лектор','Бакалавр'),
  ('Фомин М.М.','ИУ6','Лаборант','Доктор наук'),
  ('Самарев Р.С.','ИУ7','Лаборант','Магистр');
INSERT INTO professor (professor_name,department,work_status,science_degree)
VALUES
  ('Скворцов С.П.','ФН4','Лаборант','Бакалавр'),
  ('Иванова Г.С.','ИУ6','Семинарист','Магистр'),
  ('Чуев А.С.','Э9','Семинарист','Кандидат наук'),
  ('Лукин К.Б.','Л4','Лаборант','Магистр'),
  ('Подзорова М.И.','СГН3','Лектор','Магистр'),
  ('Горяинов В.Б.','ИУ3','Лектор','Магистр'),
  ('Лукин К.Б.','РК1','Лаборант','Кандидат наук'),
  ('Губарь А.М.','ФН4','Семинарист','Доктор наук'),
  ('Миков Д.А.','ИУ1','Семинарист','Бакалавр'),
  ('Халайджи А.К.','Э9','Семинарист','Магистр');
INSERT INTO professor (professor_name,department,work_status,science_degree)
VALUES
  ('Левина Е.Ю.','ИУ7','Лаборант','Доктор наук'),
  ('Веселовская О.А.','ФН4','Лектор','Кандидат наук'),
  ('Мугла Д.Р.','ФН12','Семинарист','Магистр'),
  ('Губарь А.М.','Л2','Лектор','Доктор наук'),
  ('Лукин К.Б.','ФН12','Лаборант','Кандидат наук'),
  ('Миков Д.А.','СГН3','Лектор','Кандидат наук'),
  ('Скворцов С.П.','ИУ1','Лаборант','Магистр'),
  ('Фомин М.М.','ИУ9','Лаборант','Бакалавр'),
  ('Константинов М.Ю.','Л4','Лаборант','Бакалавр'),
  ('Самарев Р.С.','ИУ7','Лектор','Бакалавр');
INSERT INTO professor (professor_name,department,work_status,science_degree)
VALUES
  ('Губарь А.М.','РК1','Лектор','Бакалавр'),
  ('Фомин М.М.','ИУ7','Лаборант','Кандидат наук'),
  ('Мугла Д.Р.','Э9','Лаборант','Магистр'),
  ('Скворцов С.П.','ФН4','Лектор','Бакалавр'),
  ('Скворцов С.П.','Л4','Лаборант','Кандидат наук'),
  ('Мугла Д.Р.','ИУ6','Лектор','Доктор наук'),
  ('Скворцов С.П.','ФН12','Семинарист','Доктор наук'),
  ('Константинов М.Ю.','ИУ6','Лектор','Кандидат наук'),
  ('Самарев Р.С.','ФН4','Лектор','Кандидат наук'),
  ('Константинов М.Ю.','СГН3','Лектор','Доктор наук');
INSERT INTO professor (professor_name,department,work_status,science_degree)
VALUES
  ('Самарев Р.С.','ИУ7','Лаборант','Доктор наук'),
  ('Халайджи А.К.','ИУ6','Семинарист','Магистр'),
  ('Миков Д.А.','ФН12','Лектор','Бакалавр'),
  ('Чуев А.С.','ИУ1','Семинарист','Бакалавр'),
  ('Лукин К.Б.','ИУ6','Лектор','Кандидат наук'),
  ('Константинов М.Ю.','СГН3','Семинарист','Кандидат наук'),
  ('Самарев Р.С.','СГН3','Лаборант','Бакалавр'),
  ('Самарев Р.С.','Э9','Семинарист','Бакалавр'),
  ('Веселовская О.А.','ФН11','Лектор','Кандидат наук'),
  ('Фомин М.М.','ИУ7','Лаборант','Доктор наук');
INSERT INTO professor (professor_name,department,work_status,science_degree)
VALUES
  ('Левина Е.Ю.','ИУ7','Лаборант','Бакалавр'),
  ('Константинов М.Ю.','Э9','Лектор','Кандидат наук'),
  ('Левина Е.Ю.','ИУ1','Лектор','Бакалавр'),
  ('Халайджи А.К.','Л4','Лаборант','Кандидат наук'),
  ('Мугла Д.Р.','Л4','Семинарист','Бакалавр'),
  ('Миков Д.А.','Л2','Семинарист','Кандидат наук'),
  ('Горяинов В.Б.','ИУ1','Лектор','Доктор наук'),
  ('Миков Д.А.','Л4','Лектор','Кандидат наук'),
  ('Халайджи А.К.','ФН11','Лаборант','Кандидат наук'),
  ('Горяинов В.Б.','ИУ7','Лаборант','Бакалавр');
INSERT INTO professor (professor_name,department,work_status,science_degree)
VALUES
  ('Лукин К.Б.','ФН11','Лаборант','Бакалавр'),
  ('Иванова Г.С.','Л4','Лаборант','Бакалавр'),
  ('Константинов М.Ю.','Э9','Лаборант','Кандидат наук'),
  ('Веселовская О.А.','ИУ7','Семинарист','Магистр'),
  ('Горяинов В.Б.','ФН11','Семинарист','Кандидат наук'),
  ('Миков Д.А.','РК1','Лаборант','Магистр'),
  ('Лукин К.Б.','СГН3','Лектор','Магистр'),
  ('Миков Д.А.','СГН3','Лаборант','Доктор наук'),
  ('Чуев А.С.','ИУ6','Семинарист','Кандидат наук'),
  ('Иванова Г.С.','Э9','Лаборант','Доктор наук');
INSERT INTO professor (professor_name,department,work_status,science_degree)
VALUES
  ('Чуев А.С.','Л2','Лаборант','Бакалавр'),
  ('Подзорова М.И.','ФН4','Лаборант','Магистр'),
  ('Самарев Р.С.','ФН12','Лектор','Магистр'),
  ('Птицына И.В.','РК1','Лектор','Бакалавр'),
  ('Иванова Г.С.','ИУ9','Лаборант','Магистр'),
  ('Фомин М.М.','Л2','Лаборант','Доктор наук'),
  ('Подзорова М.И.','ФН4','Лаборант','Магистр'),
  ('Левина Е.Ю.','Л2','Лаборант','Бакалавр'),
  ('Мугла Д.Р.','ФН12','Семинарист','Бакалавр'),
  ('Скворцов С.П.','РК1','Семинарист','Доктор наук');
INSERT INTO professor (professor_name,department,work_status,science_degree)
VALUES
  ('Лукин К.Б.','ФН12','Семинарист','Кандидат наук'),
  ('Фомин М.М.','РК1','Семинарист','Кандидат наук'),
  ('Подзорова М.И.','СГН3','Лектор','Кандидат наук'),
  ('Скворцов С.П.','Л4','Лектор','Бакалавр'),
  ('Мугла Д.Р.','ФН4','Семинарист','Бакалавр'),
  ('Константинов М.Ю.','Л2','Лектор','Кандидат наук'),
  ('Фомин М.М.','ИУ3','Семинарист','Кандидат наук'),
  ('Иванова Г.С.','РК1','Лаборант','Бакалавр'),
  ('Иванова Г.С.','ИУ7','Семинарист','Доктор наук'),
  ('Птицына И.В.','ФН12','Лаборант','Доктор наук');
INSERT INTO professor (professor_name,department,work_status,science_degree)
VALUES
  ('Фомин М.М.','РК1','Лектор','Бакалавр'),
  ('Левина Е.Ю.','ФН4','Лектор','Бакалавр'),
  ('Горяинов В.Б.','ИУ6','Лектор','Бакалавр'),
  ('Горяинов В.Б.','Л4','Семинарист','Доктор наук'),
  ('Скворцов С.П.','ИУ9','Лаборант','Доктор наук'),
  ('Миков Д.А.','ИУ9','Лаборант','Магистр'),
  ('Горяинов В.Б.','ИУ3','Семинарист','Доктор наук'),
  ('Самарев Р.С.','ИУ6','Лаборант','Бакалавр'),
  ('Веселовская О.А.','Л4','Семинарист','Магистр'),
  ('Миков Д.А.','ФН12','Лектор','Доктор наук');
INSERT INTO professor (professor_name,department,work_status,science_degree)
VALUES
  ('Горяинов В.Б.','СГН3','Лектор','Магистр'),
  ('Миков Д.А.','ИУ9','Лаборант','Бакалавр'),
  ('Миков Д.А.','ИУ7','Семинарист','Магистр'),
  ('Самарев Р.С.','Л2','Лаборант','Магистр'),
  ('Халайджи А.К.','ФН11','Семинарист','Магистр'),
  ('Фомин М.М.','ИУ9','Лаборант','Магистр'),
  ('Чуев А.С.','ФН12','Лаборант','Кандидат наук'),
  ('Фомин М.М.','ФН12','Лектор','Кандидат наук'),
  ('Халайджи А.К.','ФН12','Лектор','Магистр'),
  ('Губарь А.М.','ИУ1','Семинарист','Кандидат наук');
