TRUNCATE student RESTART IDENTITY CASCADE;

INSERT INTO student (department,semester,group_number,degree,scholarship,name,student_id)
VALUES
  ('Л4',4,6,'Б',10730,'Курицын Я.О.','47179704'),
  ('Л4',6,3,'М',4488,'Полубояров В.К.','29549574'),
  ('ЛТ11',9,3,'М',7780,'Курицын Я.О.','23400726'),
  ('СГН3',6,4,'Б',12719,'Фасхутдинов А.Р.','43878271'),
  ('ИУ3',3,4,'Б',14041,'Степура А.В.','28579758'),
  ('Л4',2,1,'М',14515,'Степура А.В.','20667802'),
  ('Л4',9,2,'М',10552,'Еферов Н.А.','40994564'),
  ('ИУ10',8,3,'М',5466,'Ягмуров И.Б.','24314146'),
  ('СГН3',7,2,'Б',10762,'Степура А.В.','36929212'),
  ('ЛТ11',7,5,'М',4406,'Фасхутдинов А.Р.','40722271');
INSERT INTO student (department,semester,group_number,degree,scholarship,name,student_id)
VALUES
  ('ИУ8',4,5,'Б',10174,'Спасскова К.А.','14477929'),
  ('Л4',9,4,'Б',8410,'Ягмуров И.Б.','43630756'),
  ('ИУ3',0,2,'Б',12932,'Угаров Р.Д.','30495848'),
  ('ФН12',5,3,'Б',13349,'Спасскова К.А.','45466901'),
  ('ИУ7',5,2,'Б',12366,'Синявина А.П.','27537980'),
  ('ФН12',4,5,'Б',6321,'Степура А.В.','11141365'),
  ('ФН12',9,2,'Б',12989,'Степура А.В.','2012177'),
  ('ИУ7',0,4,'Б',6780,'Фасхутдинов А.Р.','22353439'),
  ('СМ3',6,1,'М',2998,'Еферов Н.А.','31494246'),
  ('СМ12',3,2,'М',2471,'Угаров Р.Д.','44214304');
INSERT INTO student (department,semester,group_number,degree,scholarship,name,student_id)
VALUES
  ('СГН3',1,5,'М',12443,'Барсегян Л.Э.','3666968'),
  ('ИУ3',2,5,'М',7910,'Фасхутдинов А.Р.','27665920'),
  ('ИУ6',9,4,'Б',13438,'Полубояров В.К.','9158486'),
  ('ИУ10',0,2,'М',3528,'Ягмуров И.Б.','23831492'),
  ('СГН3',2,1,'Б',14537,'Бухов А.К.','42282234'),
  ('ИУ8',6,5,'М',2622,'Еферов Н.А.','171441'),
  ('СМ12',9,5,'М',7892,'Еферов Н.А.','19682314'),
  ('ФН12',1,3,'Б',5369,'Еферов Н.А.','41151830'),
  ('Л4',7,3,'Б',3991,'Фасхутдинов А.Р.','4673813'),
  ('СГН3',5,2,'Б',14863,'Полубояров В.К.','25648862');
INSERT INTO student (department,semester,group_number,degree,scholarship,name,student_id)
VALUES
  ('СМ3',5,3,'М',7442,'Синявина А.П.','5247209'),
  ('СГН3',2,2,'Б',2837,'Угаров Р.Д.','3385892'),
  ('ЛТ11',9,2,'М',11811,'Степура А.В.','6154553'),
  ('СМ3',2,2,'М',13570,'Угаров Р.Д.','17511814'),
  ('СМ3',4,6,'Б',7744,'Степура А.В.','28449454'),
  ('ИУ3',7,1,'Б',14664,'Курицын Я.О.','26274508'),
  ('ИУ8',0,3,'М',4298,'Бухов А.К.','47702325'),
  ('СГН3',0,2,'М',6916,'Фасхутдинов А.Р.','48144424'),
  ('СМ3',9,3,'Б',2138,'Еферов Н.А.','16298332'),
  ('СМ12',3,2,'М',4941,'Угаров Р.Д.','27965762');
INSERT INTO student (department,semester,group_number,degree,scholarship,name,student_id)
VALUES
  ('СГН3',10,4,'Б',3221,'Угаров Р.Д.','3291574'),
  ('ФН12',6,3,'Б',7604,'Спасскова К.А.','39225385'),
  ('ЛТ11',3,3,'Б',9119,'Угаров Р.Д.','34988458'),
  ('ЛТ11',7,4,'М',11416,'Синявина А.П.','49787721'),
  ('ИУ8',2,2,'М',2343,'Степура А.В.','1064798'),
  ('СМ12',8,1,'Б',12353,'Ягмуров И.Б.','11271654'),
  ('ФН12',9,5,'М',13370,'Барсегян Л.Э.','2122265'),
  ('ИУ7',8,3,'Б',9695,'Синявина А.П.','3123995'),
  ('СМ12',6,2,'М',14658,'Курицын Я.О.','531345'),
  ('СМ12',4,5,'М',11339,'Угаров Р.Д.','2038770');
INSERT INTO student (department,semester,group_number,degree,scholarship,name,student_id)
VALUES
  ('ИУ3',5,5,'М',2161,'Курицын Я.О.','46627469'),
  ('ИУ8',6,4,'М',3928,'Барсегян Л.Э.','22436845'),
  ('ИУ3',3,2,'Б',8232,'Бухов А.К.','50800324'),
  ('СМ12',2,5,'Б',2561,'Степура А.В.','19463101'),
  ('ИУ10',5,6,'М',3564,'Степура А.В.','43235622'),
  ('СГН3',0,5,'М',10260,'Еферов Н.А.','20942986'),
  ('Л4',3,6,'М',7673,'Полубояров В.К.','29445104'),
  ('ИУ3',5,6,'Б',8657,'Синявина А.П.','4553799'),
  ('ФН12',3,4,'Б',12358,'Угаров Р.Д.','30763407'),
  ('ФН12',5,6,'М',8275,'Фасхутдинов А.Р.','27809345');
INSERT INTO student (department,semester,group_number,degree,scholarship,name,student_id)
VALUES
  ('ИУ8',3,2,'Б',13919,'Барсегян Л.Э.','24823270'),
  ('ИУ8',2,5,'М',9435,'Синявина А.П.','27519530'),
  ('Л4',3,5,'М',5677,'Ягмуров И.Б.','28575758'),
  ('СГН3',6,2,'Б',7309,'Спасскова К.А.','9999998'),
  ('ИУ3',2,3,'М',10192,'Спасскова К.А.','11773211'),
  ('СГН3',4,5,'М',7736,'Еферов Н.А.','40607130'),
  ('ИУ6',1,2,'М',8587,'Степура А.В.','33403714'),
  ('ИУ7',7,4,'Б',1835,'Полубояров В.К.','32382861'),
  ('ИУ3',3,2,'М',14584,'Ягмуров И.Б.','3263750'),
  ('СГН3',10,5,'Б',6072,'Курицын Я.О.','14437416');
INSERT INTO student (department,semester,group_number,degree,scholarship,name,student_id)
VALUES
  ('СМ3',10,2,'Б',14496,'Бухов А.К.','2338247'),
  ('ФН12',2,3,'Б',5129,'Угаров Р.Д.','34108689'),
  ('ИУ3',2,3,'М',5480,'Спасскова К.А.','33300181'),
  ('ИУ10',3,3,'Б',11732,'Ягмуров И.Б.','11909168'),
  ('ЛТ11',6,5,'Б',11006,'Угаров Р.Д.','21184543'),
  ('ИУ3',0,5,'М',10954,'Спасскова К.А.','24842280'),
  ('СГН3',2,4,'М',7273,'Спасскова К.А.','7358797'),
  ('ЛТ11',9,4,'М',4096,'Курицын Я.О.','37754874'),
  ('ИУ10',7,4,'Б',4049,'Степура А.В.','29284156'),
  ('ИУ8',0,5,'М',11427,'Спасскова К.А.','39128566');
INSERT INTO student (department,semester,group_number,degree,scholarship,name,student_id)
VALUES
  ('ИУ8',1,5,'М',6725,'Еферов Н.А.','10111129'),
  ('СМ12',5,3,'М',10792,'Еферов Н.А.','2576662'),
  ('ИУ7',1,4,'Б',14908,'Спасскова К.А.','34980322'),
  ('ЛТ11',5,5,'Б',3109,'Спасскова К.А.','964633'),
  ('Л4',2,3,'Б',11042,'Спасскова К.А.','205964'),
  ('ФН12',10,3,'М',8478,'Ягмуров И.Б.','35554331'),
  ('СМ12',9,4,'Б',14957,'Синявина А.П.','17374327'),
  ('СГН3',6,2,'Б',5126,'Бухов А.К.','20465857'),
  ('ИУ7',4,2,'Б',11914,'Синявина А.П.','13187539'),
  ('ИУ7',3,1,'Б',2365,'Спасскова К.А.','22720784');
INSERT INTO student (department,semester,group_number,degree,scholarship,name,student_id)
VALUES
  ('СГН3',10,6,'М',10734,'Бухов А.К.','8702992'),
  ('ФН12',6,5,'Б',9576,'Курицын Я.О.','29223965'),
  ('СМ3',5,1,'М',4505,'Курицын Я.О.','39467688'),
  ('СГН3',4,2,'М',14532,'Ягмуров И.Б.','43967253'),
  ('Л4',0,3,'Б',14333,'Синявина А.П.','14383883'),
  ('ИУ8',0,4,'М',12207,'Спасскова К.А.','3360269'),
  ('ИУ7',9,1,'М',13470,'Угаров Р.Д.','4365151'),
  ('СГН3',5,1,'М',3914,'Угаров Р.Д.','12343666'),
  ('ИУ3',3,5,'М',7786,'Синявина А.П.','22583349'),
  ('СМ3',1,3,'Б',11110,'Бухов А.К.','4797762');
INSERT INTO student (department,semester,group_number,degree,scholarship,name,student_id)
VALUES
  ('ЛТ11',10,4,'Б',4639,'Барсегян Л.Э.','8632632'),
  ('Л4',9,4,'Б',11645,'Курицын Я.О.','37787535'),
  ('ИУ3',8,3,'М',5509,'Курицын Я.О.','18440288'),
  ('ЛТ11',8,6,'Б',13559,'Еферов Н.А.','23247295'),
  ('ФН12',9,4,'Б',7213,'Курицын Я.О.','46458679'),
  ('ЛТ11',2,3,'М',9787,'Бухов А.К.','2377425'),
  ('ИУ8',3,5,'М',11140,'Фасхутдинов А.Р.','46923298'),
  ('ИУ6',10,3,'М',8824,'Фасхутдинов А.Р.','4487750'),
  ('ИУ3',1,2,'М',4759,'Ягмуров И.Б.','21609267'),
  ('ФН12',9,6,'М',6759,'Спасскова К.А.','5889792');
INSERT INTO student (department,semester,group_number,degree,scholarship,name,student_id)
VALUES
  ('ИУ7',4,4,'М',13147,'Фасхутдинов А.Р.','39711580'),
  ('ИУ10',5,1,'М',12149,'Барсегян Л.Э.','3813498'),
  ('ИУ3',7,1,'Б',2155,'Фасхутдинов А.Р.','2084084'),
  ('ФН12',7,6,'Б',4271,'Синявина А.П.','49392310'),
  ('ИУ7',1,5,'М',7651,'Еферов Н.А.','31654519'),
  ('ИУ3',8,5,'Б',7273,'Ягмуров И.Б.','46183245'),
  ('ИУ6',0,2,'Б',10093,'Курицын Я.О.','48141974'),
  ('ИУ8',7,3,'М',11351,'Фасхутдинов А.Р.','23110625'),
  ('СГН3',6,5,'Б',6083,'Синявина А.П.','12110835'),
  ('ИУ8',8,6,'М',9328,'Фасхутдинов А.Р.','42958355');
INSERT INTO student (department,semester,group_number,degree,scholarship,name,student_id)
VALUES
  ('СМ3',10,4,'М',6396,'Барсегян Л.Э.','29435321'),
  ('Л4',7,2,'Б',10982,'Барсегян Л.Э.','26164750'),
  ('СМ3',5,4,'Б',8608,'Фасхутдинов А.Р.','1685320'),
  ('Л4',6,5,'Б',3862,'Степура А.В.','40281865'),
  ('ИУ6',10,2,'М',8737,'Бухов А.К.','27904449'),
  ('ИУ6',10,5,'Б',5436,'Угаров Р.Д.','656546'),
  ('ИУ6',5,1,'М',13313,'Барсегян Л.Э.','22783890'),
  ('Л4',0,5,'Б',13714,'Синявина А.П.','34724286'),
  ('ФН12',1,4,'Б',8182,'Спасскова К.А.','3271697'),
  ('ИУ7',9,3,'Б',13859,'Фасхутдинов А.Р.','39236991');
INSERT INTO student (department,semester,group_number,degree,scholarship,name,student_id)
VALUES
  ('ИУ8',7,6,'Б',14103,'Бухов А.К.','8634577'),
  ('ИУ6',1,4,'Б',5443,'Угаров Р.Д.','20194368'),
  ('ИУ3',3,6,'Б',13780,'Ягмуров И.Б.','32186484'),
  ('ИУ8',1,1,'Б',7357,'Ягмуров И.Б.','11196551'),
  ('ФН12',0,4,'М',14071,'Фасхутдинов А.Р.','898345'),
  ('ИУ7',3,2,'Б',14600,'Степура А.В.','16755'),
  ('ИУ3',2,6,'М',14151,'Синявина А.П.','46983176'),
  ('ИУ3',9,3,'М',2123,'Еферов Н.А.','29243365'),
  ('СГН3',4,4,'Б',2577,'Полубояров В.К.','25147339'),
  ('ИУ6',8,6,'М',3432,'Бухов А.К.','37114725');
INSERT INTO student (department,semester,group_number,degree,scholarship,name,student_id)
VALUES
  ('Л4',7,5,'Б',3278,'Бухов А.К.','6157132'),
  ('СМ3',8,6,'М',8294,'Ягмуров И.Б.','3582972'),
  ('ИУ3',4,5,'М',4063,'Фасхутдинов А.Р.','2982521'),
  ('ИУ8',5,3,'М',3620,'Синявина А.П.','35877420'),
  ('ИУ8',0,5,'Б',11932,'Синявина А.П.','36669262'),
  ('ФН12',9,2,'Б',5544,'Фасхутдинов А.Р.','46559850'),
  ('ИУ10',7,1,'М',7258,'Бухов А.К.','34399120'),
  ('ИУ6',4,3,'Б',6892,'Спасскова К.А.','22684898'),
  ('ИУ6',5,1,'Б',11825,'Барсегян Л.Э.','31575445'),
  ('ИУ10',5,6,'М',6786,'Фасхутдинов А.Р.','35314352');
INSERT INTO student (department,semester,group_number,degree,scholarship,name,student_id)
VALUES
  ('ИУ8',10,6,'М',5169,'Ягмуров И.Б.','2674736'),
  ('ИУ8',1,2,'Б',2468,'Спасскова К.А.','4544999'),
  ('ФН12',8,5,'М',12762,'Барсегян Л.Э.','6689289'),
  ('СГН3',6,6,'Б',8013,'Ягмуров И.Б.','27939804'),
  ('ИУ7',4,3,'Б',7385,'Курицын Я.О.','31839704'),
  ('ИУ10',7,6,'М',8440,'Еферов Н.А.','26708487'),
  ('ИУ6',3,4,'Б',13991,'Спасскова К.А.','41416133'),
  ('ИУ7',8,4,'Б',8742,'Еферов Н.А.','29581164'),
  ('СМ3',6,2,'М',5695,'Барсегян Л.Э.','19650631'),
  ('ИУ8',7,3,'Б',2185,'Бухов А.К.','35591281');
INSERT INTO student (department,semester,group_number,degree,scholarship,name,student_id)
VALUES
  ('Л4',3,3,'Б',7959,'Барсегян Л.Э.','34759161'),
  ('ИУ6',3,3,'Б',2874,'Бухов А.К.','28489253'),
  ('СМ3',6,5,'М',11229,'Бухов А.К.','17115332'),
  ('ИУ3',5,2,'Б',10372,'Ягмуров И.Б.','17684420'),
  ('ИУ3',8,5,'М',13494,'Спасскова К.А.','21112325'),
  ('ИУ7',9,5,'М',11554,'Спасскова К.А.','13358852'),
  ('ИУ6',1,3,'Б',3882,'Полубояров В.К.','18422265'),
  ('ИУ6',3,3,'М',10932,'Синявина А.П.','18126582'),
  ('Л4',2,4,'Б',3056,'Барсегян Л.Э.','25366161'),
  ('СМ12',4,5,'М',4926,'Барсегян Л.Э.','50501199');
INSERT INTO student (department,semester,group_number,degree,scholarship,name,student_id)
VALUES
  ('ИУ10',1,4,'Б',14344,'Синявина А.П.','38264244'),
  ('ИУ6',2,5,'Б',1978,'Бухов А.К.','47577846'),
  ('Л4',6,4,'М',13112,'Ягмуров И.Б.','49566702'),
  ('ЛТ11',9,3,'М',2522,'Спасскова К.А.','2881124'),
  ('ФН12',8,6,'М',6208,'Бухов А.К.','32958449'),
  ('ИУ8',4,2,'Б',2026,'Степура А.В.','13749863'),
  ('СГН3',1,5,'М',14943,'Курицын Я.О.','45889792'),
  ('СМ12',5,2,'Б',6125,'Синявина А.П.','7410916'),
  ('СГН3',7,1,'М',9829,'Еферов Н.А.','13277554'),
  ('ИУ8',1,4,'Б',5935,'Полубояров В.К.','34250138');
INSERT INTO student (department,semester,group_number,degree,scholarship,name,student_id)
VALUES
  ('ЛТ11',5,2,'М',14078,'Еферов Н.А.','43368394'),
  ('ФН12',2,1,'Б',11210,'Курицын Я.О.','42895623'),
  ('ИУ8',10,3,'Б',3276,'Ягмуров И.Б.','40922142'),
  ('ИУ10',8,6,'Б',11533,'Полубояров В.К.','32852790'),
  ('ЛТ11',10,1,'М',9935,'Курицын Я.О.','1577175'),
  ('ИУ7',5,2,'Б',3064,'Барсегян Л.Э.','4282859'),
  ('Л4',9,5,'Б',13147,'Угаров Р.Д.','9613805'),
  ('ФН12',8,4,'М',5431,'Ягмуров И.Б.','9496129'),
  ('ИУ3',7,2,'М',12494,'Угаров Р.Д.','20505487'),
  ('ИУ10',5,5,'М',10078,'Фасхутдинов А.Р.','42673');
INSERT INTO student (department,semester,group_number,degree,scholarship,name,student_id)
VALUES
  ('СГН3',5,2,'М',9631,'Барсегян Л.Э.','21940960'),
  ('СМ3',5,1,'М',7855,'Еферов Н.А.','37158525'),
  ('ЛТ11',6,6,'М',6399,'Курицын Я.О.','26391850'),
  ('СМ3',4,1,'М',4864,'Курицын Я.О.','2373110'),
  ('ИУ8',7,1,'М',11769,'Ягмуров И.Б.','48200240'),
  ('ЛТ11',3,1,'М',9257,'Ягмуров И.Б.','14983328'),
  ('СМ3',2,2,'М',4797,'Степура А.В.','43125892'),
  ('ИУ6',1,5,'М',4633,'Спасскова К.А.','5209214'),
  ('СГН3',7,5,'Б',5544,'Степура А.В.','16223651'),
  ('ИУ10',1,4,'Б',11125,'Барсегян Л.Э.','459170');
INSERT INTO student (department,semester,group_number,degree,scholarship,name,student_id)
VALUES
  ('ИУ10',2,4,'Б',8047,'Бухов А.К.','15122661'),
  ('Л4',5,6,'Б',6859,'Степура А.В.','7628257'),
  ('ИУ8',2,6,'Б',12797,'Бухов А.К.','25340162'),
  ('ФН12',1,5,'М',10936,'Полубояров В.К.','18599845'),
  ('СМ12',2,4,'Б',14880,'Еферов Н.А.','16553767'),
  ('ИУ3',4,2,'Б',6952,'Курицын Я.О.','4418250'),
  ('СМ3',1,5,'Б',10299,'Еферов Н.А.','25891373'),
  ('ИУ6',5,5,'Б',10313,'Угаров Р.Д.','34173863'),
  ('ЛТ11',0,3,'Б',13443,'Фасхутдинов А.Р.','41193199'),
  ('Л4',6,3,'М',10946,'Курицын Я.О.','25138867');
INSERT INTO student (department,semester,group_number,degree,scholarship,name,student_id)
VALUES
  ('ЛТ11',6,5,'Б',8939,'Синявина А.П.','36159437'),
  ('СГН3',5,2,'Б',1791,'Синявина А.П.','31122665'),
  ('ИУ8',4,2,'М',6641,'Барсегян Л.Э.','3271193'),
  ('ИУ3',2,3,'М',2876,'Полубояров В.К.','472047'),
  ('ИУ6',1,3,'М',10905,'Угаров Р.Д.','31265789'),
  ('ИУ10',1,2,'М',14521,'Барсегян Л.Э.','481768'),
  ('ИУ6',9,3,'М',12891,'Степура А.В.','39592301'),
  ('ИУ8',1,2,'Б',14441,'Спасскова К.А.','40755932'),
  ('ИУ10',6,3,'Б',1997,'Барсегян Л.Э.','11252953'),
  ('ИУ7',8,3,'Б',11445,'Степура А.В.','326810');
INSERT INTO student (department,semester,group_number,degree,scholarship,name,student_id)
VALUES
  ('ЛТ11',1,2,'Б',1780,'Спасскова К.А.','24249175'),
  ('ИУ10',3,5,'М',6581,'Фасхутдинов А.Р.','35140948'),
  ('ИУ6',7,6,'М',3588,'Курицын Я.О.','21658611'),
  ('ФН12',5,4,'Б',14980,'Еферов Н.А.','4596866'),
  ('СМ3',3,4,'Б',10217,'Курицын Я.О.','441259'),
  ('ИУ7',1,5,'М',11853,'Угаров Р.Д.','41510409'),
  ('СМ3',3,1,'Б',12882,'Фасхутдинов А.Р.','3441943'),
  ('ИУ7',6,5,'М',11733,'Бухов А.К.','42337848'),
  ('СМ3',10,2,'Б',13212,'Степура А.В.','4957376'),
  ('ИУ7',7,1,'М',2437,'Угаров Р.Д.','47709829');
INSERT INTO student (department,semester,group_number,degree,scholarship,name,student_id)
VALUES
  ('СГН3',8,2,'М',4827,'Курицын Я.О.','19642122'),
  ('ЛТ11',7,4,'М',6851,'Спасскова К.А.','47560895'),
  ('Л4',1,3,'М',12471,'Полубояров В.К.','87287'),
  ('СМ3',7,4,'Б',13813,'Угаров Р.Д.','1155795'),
  ('ИУ3',4,4,'М',7275,'Еферов Н.А.','20203147'),
  ('СМ12',3,3,'М',7262,'Степура А.В.','32318309'),
  ('ИУ3',6,4,'М',14564,'Барсегян Л.Э.','28275259'),
  ('СМ3',1,6,'Б',12853,'Ягмуров И.Б.','48579895'),
  ('ЛТ11',7,4,'Б',4746,'Полубояров В.К.','24298576'),
  ('ИУ8',1,5,'М',1832,'Фасхутдинов А.Р.','40935311');
INSERT INTO student (department,semester,group_number,degree,scholarship,name,student_id)
VALUES
  ('ИУ10',7,5,'Б',10481,'Ягмуров И.Б.','17487178'),
  ('Л4',5,3,'М',5214,'Еферов Н.А.','32872609'),
  ('Л4',7,4,'Б',10974,'Угаров Р.Д.','3780238'),
  ('ЛТ11',6,3,'Б',10178,'Бухов А.К.','7174227'),
  ('СМ3',7,2,'Б',14268,'Угаров Р.Д.','23382112'),
  ('ИУ10',3,5,'Б',4524,'Ягмуров И.Б.','14639197'),
  ('ИУ8',1,3,'Б',4131,'Степура А.В.','38193590'),
  ('ФН12',1,6,'М',14407,'Полубояров В.К.','46227217'),
  ('ИУ7',10,1,'М',2801,'Ягмуров И.Б.','6520640'),
  ('ИУ10',8,4,'М',13827,'Курицын Я.О.','3235859');
INSERT INTO student (department,semester,group_number,degree,scholarship,name,student_id)
VALUES
  ('СМ3',7,5,'Б',13551,'Полубояров В.К.','45294478'),
  ('ИУ6',1,2,'Б',14652,'Спасскова К.А.','19856659'),
  ('ИУ7',5,2,'Б',14285,'Полубояров В.К.','48511633'),
  ('СГН3',0,3,'Б',8611,'Фасхутдинов А.Р.','49600771'),
  ('ФН12',4,5,'Б',9959,'Угаров Р.Д.','9491618'),
  ('СМ3',6,4,'Б',14216,'Барсегян Л.Э.','40797140'),
  ('ИУ8',9,3,'М',5940,'Полубояров В.К.','9746174'),
  ('Л4',7,2,'М',11396,'Фасхутдинов А.Р.','4868473'),
  ('ИУ3',10,5,'М',4019,'Степура А.В.','1040582'),
  ('ЛТ11',9,4,'М',2187,'Степура А.В.','1168345');
INSERT INTO student (department,semester,group_number,degree,scholarship,name,student_id)
VALUES
  ('СМ12',9,5,'М',9400,'Угаров Р.Д.','5666944'),
  ('ИУ10',8,3,'Б',10532,'Степура А.В.','7513156'),
  ('СМ3',4,4,'Б',8732,'Угаров Р.Д.','41640905'),
  ('СМ3',1,2,'М',9903,'Еферов Н.А.','31956586'),
  ('ИУ7',6,6,'М',3922,'Курицын Я.О.','21900635'),
  ('ФН12',6,2,'М',12065,'Спасскова К.А.','45347707'),
  ('ИУ10',6,2,'Б',5611,'Ягмуров И.Б.','26274639'),
  ('СМ3',3,2,'Б',5604,'Спасскова К.А.','38961615'),
  ('ИУ8',7,1,'Б',13718,'Спасскова К.А.','27312596'),
  ('ИУ6',1,2,'Б',13528,'Фасхутдинов А.Р.','50677678');
INSERT INTO student (department,semester,group_number,degree,scholarship,name,student_id)
VALUES
  ('ИУ10',2,3,'М',3978,'Фасхутдинов А.Р.','32783526'),
  ('ФН12',6,4,'Б',4238,'Еферов Н.А.','3036108'),
  ('ИУ7',7,4,'Б',10879,'Барсегян Л.Э.','35704118'),
  ('ЛТ11',8,5,'М',2827,'Бухов А.К.','40619706'),
  ('ЛТ11',4,6,'М',11228,'Спасскова К.А.','2033910'),
  ('ИУ10',8,5,'М',11725,'Угаров Р.Д.','29424344'),
  ('СМ3',5,3,'М',2733,'Угаров Р.Д.','47662532'),
  ('ИУ7',0,3,'М',4163,'Степура А.В.','23296640'),
  ('СМ12',10,2,'Б',14457,'Бухов А.К.','27452985'),
  ('СГН3',7,4,'Б',5291,'Полубояров В.К.','35533912');
INSERT INTO student (department,semester,group_number,degree,scholarship,name,student_id)
VALUES
  ('ИУ3',1,4,'Б',5813,'Курицын Я.О.','22440587'),
  ('ИУ7',8,4,'М',8642,'Бухов А.К.','21799542'),
  ('ИУ6',5,5,'Б',6525,'Бухов А.К.','49673828'),
  ('Л4',4,2,'М',11656,'Барсегян Л.Э.','41385460'),
  ('ИУ8',9,1,'М',2360,'Синявина А.П.','36100829'),
  ('СМ3',0,2,'М',7671,'Еферов Н.А.','45520514'),
  ('ФН12',1,4,'Б',3785,'Угаров Р.Д.','49202492'),
  ('СГН3',0,1,'М',13343,'Бухов А.К.','38124726'),
  ('Л4',5,4,'М',12881,'Фасхутдинов А.Р.','2252432'),
  ('СГН3',1,5,'Б',6185,'Угаров Р.Д.','20820246');
INSERT INTO student (department,semester,group_number,degree,scholarship,name,student_id)
VALUES
  ('СГН3',0,5,'Б',11455,'Фасхутдинов А.Р.','39157615'),
  ('ЛТ11',2,5,'М',10346,'Полубояров В.К.','2523723'),
  ('ИУ3',5,2,'М',3569,'Степура А.В.','20200864'),
  ('ИУ10',9,1,'Б',5589,'Полубояров В.К.','14661334'),
  ('Л4',3,5,'Б',12872,'Барсегян Л.Э.','12226978'),
  ('СГН3',9,2,'Б',10258,'Еферов Н.А.','37767263'),
  ('СМ3',5,4,'М',11080,'Фасхутдинов А.Р.','24390933'),
  ('СМ3',6,1,'Б',12689,'Барсегян Л.Э.','8293651'),
  ('СМ12',9,1,'Б',7439,'Синявина А.П.','9729606'),
  ('СГН3',2,3,'Б',8874,'Еферов Н.А.','21498457');
INSERT INTO student (department,semester,group_number,degree,scholarship,name,student_id)
VALUES
  ('СМ3',6,3,'М',9990,'Еферов Н.А.','21642880'),
  ('СМ3',4,5,'М',9774,'Бухов А.К.','31159444'),
  ('СМ3',2,2,'М',13331,'Ягмуров И.Б.','9155761'),
  ('СМ12',8,1,'Б',13649,'Спасскова К.А.','35989299'),
  ('ИУ10',10,4,'Б',3513,'Еферов Н.А.','44384981'),
  ('ЛТ11',9,2,'М',14496,'Барсегян Л.Э.','44326774'),
  ('ИУ7',4,3,'Б',1865,'Угаров Р.Д.','40852783'),
  ('ИУ7',6,2,'М',6263,'Курицын Я.О.','21316770'),
  ('СМ12',7,6,'Б',12517,'Угаров Р.Д.','3679553'),
  ('ИУ6',5,3,'М',8462,'Фасхутдинов А.Р.','18936660');
INSERT INTO student (department,semester,group_number,degree,scholarship,name,student_id)
VALUES
  ('ИУ3',7,3,'М',8823,'Полубояров В.К.','38742579'),
  ('СМ12',2,4,'Б',9565,'Синявина А.П.','4925073'),
  ('ФН12',1,1,'Б',7246,'Еферов Н.А.','12199288'),
  ('ИУ3',10,5,'М',6142,'Полубояров В.К.','10404208'),
  ('Л4',3,4,'М',13642,'Спасскова К.А.','1821670'),
  ('ИУ6',2,4,'Б',11705,'Бухов А.К.','27884265'),
  ('ИУ6',9,4,'М',12794,'Бухов А.К.','44924161'),
  ('ИУ10',9,5,'М',8926,'Синявина А.П.','4685438'),
  ('ФН12',8,1,'М',13934,'Синявина А.П.','22881214'),
  ('ИУ6',1,4,'Б',5469,'Фасхутдинов А.Р.','993751');
INSERT INTO student (department,semester,group_number,degree,scholarship,name,student_id)
VALUES
  ('Л4',2,2,'Б',11746,'Курицын Я.О.','3640201'),
  ('ИУ8',6,1,'М',7542,'Синявина А.П.','39250156'),
  ('ИУ7',0,3,'Б',7538,'Полубояров В.К.','172245'),
  ('СМ3',1,3,'Б',13081,'Курицын Я.О.','4816111'),
  ('СМ3',4,2,'Б',11496,'Бухов А.К.','2685262'),
  ('СМ12',5,3,'Б',13695,'Спасскова К.А.','25182612'),
  ('ИУ8',7,4,'М',12817,'Полубояров В.К.','33400807'),
  ('ИУ3',7,2,'Б',9928,'Синявина А.П.','45904563'),
  ('СМ12',2,2,'Б',2929,'Синявина А.П.','10302318'),
  ('СМ3',5,5,'Б',11596,'Степура А.В.','21536445');
INSERT INTO student (department,semester,group_number,degree,scholarship,name,student_id)
VALUES
  ('ИУ7',3,3,'Б',9884,'Синявина А.П.','1573585'),
  ('ИУ10',5,6,'М',4875,'Курицын Я.О.','48341336'),
  ('Л4',5,3,'М',7551,'Ягмуров И.Б.','4473337'),
  ('ИУ10',2,2,'М',12397,'Ягмуров И.Б.','38926260'),
  ('ЛТ11',4,5,'М',3527,'Полубояров В.К.','8770526'),
  ('Л4',10,4,'М',4182,'Ягмуров И.Б.','35978544'),
  ('ИУ3',2,4,'Б',12932,'Курицын Я.О.','19489196'),
  ('СМ3',6,2,'Б',2395,'Барсегян Л.Э.','17807250'),
  ('Л4',9,6,'М',9973,'Барсегян Л.Э.','44567214'),
  ('ИУ8',6,6,'М',9859,'Курицын Я.О.','24684205');
INSERT INTO student (department,semester,group_number,degree,scholarship,name,student_id)
VALUES
  ('ИУ7',8,2,'М',4862,'Степура А.В.','46739181'),
  ('ИУ6',8,1,'М',4109,'Бухов А.К.','48199655'),
  ('ИУ7',7,5,'М',13209,'Ягмуров И.Б.','30427743'),
  ('ИУ8',9,5,'М',3503,'Курицын Я.О.','41787669'),
  ('СМ3',1,2,'Б',7100,'Полубояров В.К.','22454206'),
  ('СМ12',4,3,'М',10358,'Еферов Н.А.','43404165'),
  ('ИУ7',8,2,'М',13214,'Ягмуров И.Б.','46555930'),
  ('ЛТ11',7,2,'Б',9465,'Спасскова К.А.','2536342'),
  ('ИУ7',6,3,'М',11437,'Синявина А.П.','27574839'),
  ('СГН3',7,5,'Б',2975,'Барсегян Л.Э.','37319759');
INSERT INTO student (department,semester,group_number,degree,scholarship,name,student_id)
VALUES
  ('ИУ7',7,5,'М',9356,'Синявина А.П.','16341940'),
  ('ИУ6',5,1,'М',2598,'Барсегян Л.Э.','375187'),
  ('ИУ3',0,2,'Б',12966,'Еферов Н.А.','26105364'),
  ('ИУ8',9,3,'М',14927,'Фасхутдинов А.Р.','10266539'),
  ('СГН3',3,5,'М',1965,'Степура А.В.','9970275'),
  ('Л4',9,2,'Б',14114,'Бухов А.К.','2550535'),
  ('СГН3',2,6,'Б',14266,'Полубояров В.К.','19750405'),
  ('СМ12',7,3,'Б',8380,'Ягмуров И.Б.','17140968'),
  ('СМ12',3,1,'М',8156,'Фасхутдинов А.Р.','25127681'),
  ('Л4',5,5,'Б',6276,'Спасскова К.А.','18685458');
INSERT INTO student (department,semester,group_number,degree,scholarship,name,student_id)
VALUES
  ('Л4',3,5,'Б',11159,'Еферов Н.А.','23364167'),
  ('СМ3',5,2,'М',2761,'Бухов А.К.','24892877'),
  ('ЛТ11',4,4,'Б',14152,'Барсегян Л.Э.','8443573'),
  ('Л4',0,1,'М',4864,'Еферов Н.А.','37829781'),
  ('ИУ6',4,6,'Б',6688,'Спасскова К.А.','3149953'),
  ('СМ12',2,5,'М',5641,'Степура А.В.','2157433'),
  ('ИУ10',2,4,'Б',2958,'Ягмуров И.Б.','11957473'),
  ('ФН12',4,1,'Б',1980,'Фасхутдинов А.Р.','19417995'),
  ('Л4',9,4,'М',12760,'Полубояров В.К.','4672706'),
  ('СМ3',9,4,'Б',12181,'Спасскова К.А.','21374361');
INSERT INTO student (department,semester,group_number,degree,scholarship,name,student_id)
VALUES
  ('Л4',1,4,'Б',5167,'Курицын Я.О.','3056909'),
  ('ИУ8',5,4,'М',11348,'Угаров Р.Д.','49266925'),
  ('СГН3',5,2,'Б',14565,'Фасхутдинов А.Р.','3412237'),
  ('ИУ8',6,5,'М',2721,'Барсегян Л.Э.','26333705'),
  ('ФН12',7,3,'М',5404,'Угаров Р.Д.','50641659'),
  ('СГН3',2,3,'М',9294,'Степура А.В.','17998993'),
  ('ИУ8',2,2,'М',12173,'Ягмуров И.Б.','30847859'),
  ('ФН12',5,6,'Б',13007,'Фасхутдинов А.Р.','2770111'),
  ('СГН3',6,3,'Б',14261,'Фасхутдинов А.Р.','50738834'),
  ('СМ12',6,1,'Б',9422,'Фасхутдинов А.Р.','38706335');
INSERT INTO student (department,semester,group_number,degree,scholarship,name,student_id)
VALUES
  ('ИУ7',6,2,'М',9496,'Полубояров В.К.','22628384'),
  ('ИУ10',1,3,'Б',3047,'Ягмуров И.Б.','31740464'),
  ('СМ12',0,3,'Б',9819,'Барсегян Л.Э.','45979300'),
  ('ИУ10',8,5,'М',13057,'Бухов А.К.','42664388'),
  ('ИУ7',8,2,'М',13136,'Спасскова К.А.','38754615'),
  ('ИУ7',2,5,'М',3480,'Курицын Я.О.','15848939'),
  ('ИУ8',6,3,'М',5396,'Бухов А.К.','40532534'),
  ('ИУ7',2,5,'Б',3348,'Угаров Р.Д.','31498126'),
  ('СМ12',5,4,'Б',2191,'Синявина А.П.','43213799'),
  ('ФН12',6,5,'М',8018,'Степура А.В.','19558192');
INSERT INTO student (department,semester,group_number,degree,scholarship,name,student_id)
VALUES
  ('СМ3',5,4,'Б',14955,'Курицын Я.О.','41958448'),
  ('ЛТ11',8,1,'М',6266,'Синявина А.П.','5940263'),
  ('ЛТ11',7,6,'М',9200,'Синявина А.П.','28403918'),
  ('СМ3',7,2,'М',10930,'Еферов Н.А.','30704604'),
  ('ИУ6',6,2,'Б',3788,'Спасскова К.А.','44145908'),
  ('ИУ7',4,4,'Б',9682,'Еферов Н.А.','21726830'),
  ('ИУ7',1,2,'Б',3172,'Полубояров В.К.','9560952'),
  ('ИУ7',10,2,'М',10770,'Степура А.В.','9249292'),
  ('ФН12',10,1,'Б',8670,'Синявина А.П.','18998842'),
  ('ФН12',6,5,'Б',5564,'Еферов Н.А.','1616873');
INSERT INTO student (department,semester,group_number,degree,scholarship,name,student_id)
VALUES
  ('ФН12',1,4,'М',14476,'Угаров Р.Д.','39168281'),
  ('ФН12',2,5,'Б',4448,'Фасхутдинов А.Р.','447332'),
  ('Л4',2,3,'М',4419,'Полубояров В.К.','3574818'),
  ('ИУ3',7,1,'Б',4230,'Бухов А.К.','2299975'),
  ('СГН3',5,3,'М',7792,'Степура А.В.','34609807'),
  ('ИУ10',6,4,'Б',11051,'Степура А.В.','13891558'),
  ('ИУ3',5,4,'Б',12712,'Спасскова К.А.','2783413'),
  ('ИУ8',3,4,'М',10898,'Курицын Я.О.','16980577'),
  ('Л4',7,4,'Б',13944,'Еферов Н.А.','22751128'),
  ('СГН3',2,3,'Б',3915,'Фасхутдинов А.Р.','21568874');
INSERT INTO student (department,semester,group_number,degree,scholarship,name,student_id)
VALUES
  ('ФН12',3,3,'Б',11905,'Ягмуров И.Б.','46489320'),
  ('СГН3',1,3,'М',14397,'Степура А.В.','15232632'),
  ('ИУ8',1,1,'М',9937,'Барсегян Л.Э.','1258929'),
  ('СГН3',7,2,'Б',14582,'Ягмуров И.Б.','50229739'),
  ('ИУ7',6,2,'М',7610,'Курицын Я.О.','4340045'),
  ('ИУ10',6,2,'Б',3978,'Угаров Р.Д.','12765221'),
  ('ИУ7',3,1,'Б',8183,'Барсегян Л.Э.','14324181'),
  ('Л4',7,2,'Б',12027,'Ягмуров И.Б.','19122501'),
  ('СМ12',7,2,'Б',9036,'Угаров Р.Д.','12303292'),
  ('СГН3',8,2,'М',10147,'Степура А.В.','44938637');
INSERT INTO student (department,semester,group_number,degree,scholarship,name,student_id)
VALUES
  ('СМ12',3,2,'М',10716,'Полубояров В.К.','28104525'),
  ('СГН3',8,4,'М',7761,'Курицын Я.О.','27679497'),
  ('ИУ7',9,3,'М',5837,'Синявина А.П.','14926101'),
  ('Л4',5,2,'Б',9842,'Еферов Н.А.','41837716'),
  ('ИУ10',8,5,'М',3714,'Курицын Я.О.','619053'),
  ('ИУ10',6,5,'Б',3491,'Угаров Р.Д.','4143547'),
  ('ИУ8',6,1,'М',11171,'Угаров Р.Д.','9764805'),
  ('ИУ6',4,3,'М',2385,'Бухов А.К.','19631856'),
  ('ИУ6',7,1,'Б',6880,'Угаров Р.Д.','124588'),
  ('ФН12',1,1,'Б',7487,'Синявина А.П.','3645781');
INSERT INTO student (department,semester,group_number,degree,scholarship,name,student_id)
VALUES
  ('ИУ10',2,2,'М',13457,'Спасскова К.А.','17758558'),
  ('ИУ6',7,2,'Б',6241,'Фасхутдинов А.Р.','1517605'),
  ('СГН3',9,5,'М',4938,'Бухов А.К.','18610998'),
  ('СМ3',1,4,'М',14430,'Курицын Я.О.','42451725'),
  ('Л4',6,2,'М',3542,'Полубояров В.К.','944666'),
  ('ЛТ11',9,3,'Б',7020,'Полубояров В.К.','7310908'),
  ('ИУ6',3,1,'М',12647,'Степура А.В.','6720409'),
  ('ИУ7',2,2,'Б',9699,'Барсегян Л.Э.','8611933'),
  ('ЛТ11',1,4,'М',3035,'Бухов А.К.','33644464'),
  ('ИУ3',6,3,'М',11833,'Еферов Н.А.','9840575');
INSERT INTO student (department,semester,group_number,degree,scholarship,name,student_id)
VALUES
  ('СГН3',2,5,'М',3877,'Синявина А.П.','18217504'),
  ('ИУ8',0,5,'Б',13109,'Еферов Н.А.','44264826'),
  ('ИУ6',3,6,'Б',14827,'Спасскова К.А.','1723637'),
  ('СМ12',5,2,'М',3293,'Полубояров В.К.','30764166'),
  ('ИУ7',9,2,'Б',4793,'Полубояров В.К.','24263317'),
  ('ИУ3',1,4,'М',11606,'Спасскова К.А.','3366179'),
  ('ИУ10',7,3,'М',8847,'Синявина А.П.','35226522'),
  ('ИУ8',8,4,'Б',10079,'Полубояров В.К.','199415'),
  ('ИУ6',9,2,'Б',5129,'Спасскова К.А.','28352761'),
  ('СМ12',0,3,'Б',14650,'Курицын Я.О.','18219628');
INSERT INTO student (department,semester,group_number,degree,scholarship,name,student_id)
VALUES
  ('ИУ6',4,6,'М',14500,'Спасскова К.А.','44318251'),
  ('СМ3',2,2,'Б',7850,'Бухов А.К.','1410846'),
  ('ИУ10',8,3,'М',9667,'Ягмуров И.Б.','4350610'),
  ('ИУ8',5,5,'М',7047,'Полубояров В.К.','1670146'),
  ('СГН3',5,1,'М',12659,'Ягмуров И.Б.','23472906'),
  ('ФН12',5,5,'М',8076,'Курицын Я.О.','27361835'),
  ('ЛТ11',1,5,'М',13325,'Фасхутдинов А.Р.','276701'),
  ('СМ3',8,5,'М',2761,'Полубояров В.К.','20217145'),
  ('ИУ3',8,2,'Б',14473,'Еферов Н.А.','2819458'),
  ('ИУ10',7,1,'М',11842,'Еферов Н.А.','12516236');
INSERT INTO student (department,semester,group_number,degree,scholarship,name,student_id)
VALUES
  ('ЛТ11',10,1,'Б',13012,'Степура А.В.','25519520'),
  ('ЛТ11',4,5,'М',9408,'Угаров Р.Д.','17101266'),
  ('СМ12',3,2,'М',7278,'Фасхутдинов А.Р.','17866617'),
  ('ЛТ11',5,4,'М',2786,'Степура А.В.','22709890'),
  ('СМ3',5,6,'М',5182,'Курицын Я.О.','32611662'),
  ('ИУ6',8,2,'М',14188,'Степура А.В.','10996753'),
  ('СМ12',7,3,'М',11643,'Барсегян Л.Э.','36148985'),
  ('ЛТ11',9,5,'Б',8939,'Барсегян Л.Э.','9879501'),
  ('СМ3',9,6,'М',10168,'Фасхутдинов А.Р.','26102677'),
  ('СМ12',2,4,'М',2991,'Полубояров В.К.','49386907');
INSERT INTO student (department,semester,group_number,degree,scholarship,name,student_id)
VALUES
  ('ИУ6',5,4,'М',14286,'Ягмуров И.Б.','35867177'),
  ('Л4',9,2,'М',13735,'Полубояров В.К.','7183138'),
  ('ИУ7',6,5,'Б',3686,'Угаров Р.Д.','39568708'),
  ('СМ12',0,4,'Б',6114,'Фасхутдинов А.Р.','9199943'),
  ('ЛТ11',1,4,'М',5436,'Бухов А.К.','42312295'),
  ('СМ3',4,1,'Б',10644,'Ягмуров И.Б.','18871467'),
  ('ИУ3',0,3,'М',3298,'Еферов Н.А.','4420270'),
  ('Л4',10,1,'М',12641,'Бухов А.К.','49803698'),
  ('СМ3',6,4,'Б',14359,'Бухов А.К.','98911'),
  ('ФН12',8,4,'М',4197,'Степура А.В.','5845154');
INSERT INTO student (department,semester,group_number,degree,scholarship,name,student_id)
VALUES
  ('ЛТ11',7,3,'Б',3370,'Еферов Н.А.','15383340'),
  ('СМ12',4,3,'М',10312,'Ягмуров И.Б.','48566128'),
  ('ИУ10',6,1,'М',12592,'Угаров Р.Д.','34823824'),
  ('СГН3',8,2,'М',6232,'Курицын Я.О.','31182358'),
  ('СМ3',8,5,'Б',11993,'Курицын Я.О.','50745177'),
  ('ИУ7',0,3,'М',13853,'Полубояров В.К.','12651925'),
  ('ФН12',4,5,'Б',1917,'Фасхутдинов А.Р.','40836130'),
  ('СМ12',2,4,'М',14514,'Полубояров В.К.','1182131'),
  ('ИУ3',4,1,'М',3410,'Курицын Я.О.','44991316'),
  ('ФН12',4,5,'Б',12675,'Фасхутдинов А.Р.','43349890');
INSERT INTO student (department,semester,group_number,degree,scholarship,name,student_id)
VALUES
  ('ИУ6',8,5,'Б',10855,'Еферов Н.А.','8477680'),
  ('СГН3',9,5,'Б',4958,'Спасскова К.А.','8820509'),
  ('ИУ6',9,1,'Б',11367,'Степура А.В.','22478144'),
  ('СГН3',7,2,'М',12497,'Еферов Н.А.','23370454'),
  ('Л4',3,6,'М',14361,'Спасскова К.А.','27912459'),
  ('Л4',6,2,'М',3427,'Спасскова К.А.','6525971'),
  ('ИУ7',7,1,'М',10641,'Степура А.В.','41444842'),
  ('ФН12',5,2,'Б',11001,'Барсегян Л.Э.','6258696'),
  ('ИУ7',7,2,'М',10196,'Курицын Я.О.','28531537'),
  ('ИУ6',6,4,'Б',2841,'Угаров Р.Д.','22926144');
