TRUNCATE subject RESTART IDENTITY CASCADE;
INSERT INTO subject (subject_name,obligation,check_type,hours_number)
VALUES
  ('Физика','Предмет по выбору','Зачет',157),
  ('Основы программирования','Обязательный предмет','Распределенный экзамен',310),
  ('Электротехника','Предмет по выбору','Дифференцированный зачет',168),
  ('Интегралы и дифференциальные уравнения','Обязательный предмет','Зачет',163),
  ('Физика','Предмет по выбору','Дифференцированный зачет',305),
  ('Теоретическая механика','Обязательный предмет','Распределенный экзамен',303),
  ('Основы программирования','Предмет по выбору','Дифференцированный зачет',329),
  ('Теория вероятностей и математическая статистика','Обязательный предмет','Экзамен',165),
  ('Основы программирования','Обязательный предмет','Зачет',327),
  ('Основы программирования','Предмет по выбору','Распределенный экзамен',198);
INSERT INTO subject (subject_name,obligation,check_type,hours_number)
VALUES
  ('Сопротивление материалов','Предмет по выбору','Распределенный экзамен',171),
  ('Основы программирования','Обязательный предмет','Зачет',254),
  ('Теория вероятностей и математическая статистика','Обязательный предмет','Экзамен',191),
  ('Теория вероятностей и математическая статистика','Обязательный предмет','Распределенный экзамен',350),
  ('Теоретическая механика','Предмет по выбору','Зачет',167),
  ('Языки интернет-программирования','Обязательный предмет','Экзамен',227),
  ('Физика','Предмет по выбору','Экзамен',313),
  ('Сопротивление материалов','Обязательный предмет','Экзамен',317),
  ('Основы программирования','Обязательный предмет','Дифференцированный зачет',263),
  ('Языки интернет-программирования','Предмет по выбору','Зачет',253);
INSERT INTO subject (subject_name,obligation,check_type,hours_number)
VALUES
  ('Теория вероятностей и математическая статистика','Предмет по выбору','Зачет',320),
  ('Языки интернет-программирования','Обязательный предмет','Распределенный экзамен',261),
  ('Теория вероятностей и математическая статистика','Предмет по выбору','Экзамен',313),
  ('Электротехника','Предмет по выбору','Зачет',317),
  ('Языки интернет-программирования','Обязательный предмет','Распределенный экзамен',304),
  ('Основы программирования','Предмет по выбору','Распределенный экзамен',189),
  ('Языки интернет-программирования','Обязательный предмет','Дифференцированный зачет',331),
  ('Теоретическая механика','Предмет по выбору','Дифференцированный зачет',215),
  ('Сопротивление материалов','Предмет по выбору','Зачет',162),
  ('Теория вероятностей и математическая статистика','Обязательный предмет','Распределенный экзамен',154);
INSERT INTO subject (subject_name,obligation,check_type,hours_number)
VALUES
  ('Основы программирования','Обязательный предмет','Зачет',233),
  ('Интегралы и дифференциальные уравнения','Обязательный предмет','Дифференцированный зачет',309),
  ('Электротехника','Обязательный предмет','Распределенный экзамен',207),
  ('Интегралы и дифференциальные уравнения','Обязательный предмет','Распределенный экзамен',325),
  ('Сопротивление материалов','Обязательный предмет','Распределенный экзамен',223),
  ('Интегралы и дифференциальные уравнения','Предмет по выбору','Экзамен',285),
  ('Физика','Обязательный предмет','Дифференцированный зачет',210),
  ('Электротехника','Обязательный предмет','Распределенный экзамен',212),
  ('Языки интернет-программирования','Обязательный предмет','Дифференцированный зачет',307),
  ('Языки интернет-программирования','Предмет по выбору','Экзамен',196);
INSERT INTO subject (subject_name,obligation,check_type,hours_number)
VALUES
  ('Теория вероятностей и математическая статистика','Предмет по выбору','Зачет',225),
  ('Интегралы и дифференциальные уравнения','Обязательный предмет','Распределенный экзамен',215),
  ('Интегралы и дифференциальные уравнения','Предмет по выбору','Зачет',159),
  ('Сопротивление материалов','Предмет по выбору','Экзамен',289),
  ('Теория вероятностей и математическая статистика','Предмет по выбору','Экзамен',269),
  ('Языки интернет-программирования','Предмет по выбору','Дифференцированный зачет',223),
  ('Электротехника','Предмет по выбору','Зачет',185),
  ('Электротехника','Обязательный предмет','Экзамен',276),
  ('Теоретическая механика','Предмет по выбору','Экзамен',275),
  ('Физика','Обязательный предмет','Распределенный экзамен',201);
